{
  "云凌": {
    "Story": "云凌\n女。二十出头。短发英气，穿浅色麂子皮衣，长裤皮靴。行动利落，不喜欢说废话。\n你是一个做事凭心情的女人，不喜欢约束，亲手剪短长发，爱穿男装。你生于山西太原。前清时，父亲【廖一乔】去关外经商，把你和弟弟还有母亲（唐婉枫）寄宿到杭州的舅舅（唐茂光）家——舅舅以前在军队带兵，你在他家看见枪支，就求他教你射击和使用。\n你父亲现在是民国“晋商会”的会长，经营着“廖氏商行”，生意涉及许多洋务和工厂。“廖公馆”里经常有各色人物往来，父亲接回你们后，忙于生意和公务，很少回来。你不喜欢这样的家，成年后常借故外出。“廖公馆”由管家【任爷爷】(任仲远）打理——【任爷爷】会武术，平日里行医助弱，为人正派，救过你父亲的命，【廖】家人都很尊重他。\n常来的客人里，有一个名叫【徐伯清】的年轻军人，和你见过几面，他在“辛亥革命”（1911年）后调来太原，即将返回南方。你打算去杭州探望舅舅（你母亲死后就再没见过舅舅)，【徐伯清】听说后主动请缨做你的“护花使者”——你不是第一次出远门，从不用人保护，父亲却同意了他的请求。\n你们出发前，【徐伯清】收到部队电报，让他去苏州的驻地，你看他为难，就说先陪他去苏州报到——你打算等他去部队，独自去舅舅家。\n（7月25日）你们到苏州，住在“临池客栈”，【徐伯清】嘱咐你一定要等他—他三天后就能回来。你满口答应，他一离开，你就去了杭州。\n舅舅的女儿（你的表姐）在上海上大学，假期没回来，只有舅舅在家。舅舅见到你非常高兴，他送给你一支做工精细的“汉阳步枪”——这支枪是当年“试制”的，子弹里的火药威力很大，开枪的后坐力很大，没有投入量产。舅舅让你小心使用，你问他这种火药是不是很贵，他苦笑道:“我的老朋友说，它们比金子还珍贵……”你用一块“青布”把“汉阳步枪”包起，舅舅打趣说，你的爱好跟男孩一样，要是在前清，都没人敢娶你。\n（7月28日）有《申报》的记者来拜访舅舅，你想起【徐伯清】这时该办完事了，就跟舅舅告辞─—你打算去上海看表姐，为了给她一个惊喜，你让舅舅先不要告诉她。你回到“临池客栈”，【徐伯清】仍没回来，你在苏州游玩等他。",
    "Script": "昨天(8月2日）下午\n你收到【徐伯清】派人送来客栈的信，说他在“百里村”【姚】家，因为任务脱不开身，让你再等他几天。“百里村”位于苏州和上海之间，去上海时正好经过，你本来就不需要人陪，打算去跟【徐伯清】见面说一声，免得牵挂。\n你雇马车到“百里村”——这里只有一条入村的路,【姚】家大宅位于村北，是一幢有露台的洋楼，背靠一片树林。\n你敲开大门，侍女带你去一楼客厅，见到一个【艳妆女人】和两个青年，你说来找【徐伯清】，其中一个青年带你上二楼——他是【姚】家次子【姚仲义】,【艳妆女人】是他父亲的继室【红夫人】。\n【徐伯清】住在二楼客房，他在房里头戴“黑爵士帽”，用“白围巾”挡住面容，还戴一副“墨镜”—他看见你又惊又喜，摘下伪装，让【姚仲义】出去，嘱咐他不要打扰你们。你来这里只为向他道别，他似乎误会了什么。\n【徐伯清】小声告诉你，“白头蛇”提及有“被通缉的危险人物”会出现在这里，让你不要独自出去——你不知道什么“白头蛇”“黑头蛇”，你很不喜欢这种命令的口吻，你告诉【徐伯清】你可以帮他，他大笑起来──你看他没把你的话当真，就跟他辞行，说要去上海。\n【徐伯清】皱起眉，说“百里村”比不了城市，下午没有出村的马车，你最早也要等到明天才能出发，不如你今晚留在这里住宿。然后他喊来【姚仲义】送你去客房安顿。\n【姚仲义】给你客房的钥匙，送你进去。你放下行李，在客房里待了一会儿，就锁门离开。你去村里散步，刚走进村北树林，就看见树林深处升起滚滚黑烟,还有火光，一只“白色的鸟”从黑烟里冲出来，没飞多远就栽倒在树林外。一个【头发乱蓬的男人】从里面跑出来。你问他出了什么事?他神情慌乱,回答不出。\n你看到一个青年（刚才在客厅见过）挟持一个【长发姑娘】（他用手捂住姑娘的嘴，在地上拖行）从树林里出来。你想去救人，但“汉阳步枪”留在客房，如果这两个男人是一伙儿的，你没带武器该怎么应付?\n青年突然倒在【头发乱蓬的男人】的怀里昏了过去，你扶起【长发姑娘】,看她已经昏迷。\n【姚仲义】跑进树林，他扶住青年，说青年是他请来的【虞医师】，昏迷的【长发姑娘】是他的嫂子【陈均梦】。【头发乱蓬的男人】自称【贵叔】，懂一些医术，说要帮忙。【姚仲义】请你把【陈均梦】扶进大宅一楼里一间干净的卧室(一楼旧屋)，你看她容貌秀美苍白，双眼紧闭，眼角有泪痕。【贵叔】带【红夫人】拿着药品进来给她检查。\n你看帮不上忙，就从房里出来，在走廊上遇到头戴“黑爵士帽”，用“白围巾”挡住面容，在宅子里仍戴“墨镜”的【徐伯清】。他让你先不要说话，带你上楼去他的客房。\n你问【徐伯清】在装什么鬼?他说他不能被认出来。然后他问你认识【陈均梦】吗?听你说只知道名字后，才松了一口气。你问他宅子后的树林里有什么?【徐伯清】冷笑起来，说那里葬着【姚】家的“耻辱”……你刚要继续追问，【徐伯清】突然抓起你的手，对你告白说:“云凌，其实我从第一次见到你，就爱上了你……”\n你一把甩开他，警告他注意分寸，你们现在连朋友都算不上。你转身出去,【徐伯清】追到你客房门口，你一把推开房门（房门的锁是开的)。你回房反锁上门，你这时发觉放在屋里的“汉阳步枪”被人动过，外面的“青布”也被打开了……你检查行李，没有丢失财物。\n昨天（8月2日）晚上\n(22:20）有人把一张手写的“字条”从门缝下塞进来，上面写着:“今晚子时(23:00)，我在二楼阳台等你”（没有署名）。\n(23:00）你来到阳台，这次你带上装弹的“汉阳步枪”——阳台上此时只有一个人，他头戴“黑爵士帽”，用“白围巾”挡住面容，在晚上仍戴着“墨镜”，你看约你出来的人是【徐伯清】，马上问他:“你还想干什么?”\n他做了让你小声的手势，压低声音，自作聪明地说:“我知道你来‘百里村’就是来找我的——明天我按之前约定好的，把东西带上——我跟你一起离开这里。”\n“之前的约定就算了，我已经改主意了。”你不想再继续这个话题了——你,本来就不需要任何人陪，何况这样有企图的“护花使者”。\n“改主意了?”他有些激动，“你还不知道，部队那边的事情暴露了，‘白头蛇’死了，我很快也会被连累，这都是因为你家的这笔‘交易’——没关系，‘交易’可以半价，只要我们明天一起走!”你对父亲这些年做的买卖一无所知，想不到会和他还有部队有关。\n他看你不再说话，从身后掏出一把“快利步枪”，指着你说:“看见这枪了吗?事到如今，要不我们一起离开，要不就谁也甭想走了!”\n你看他手持凶器，立刻解开“青布”，端起“汉阳步枪”对准他，他仍在嘴硬:“你有本事就现在打死我!”你不想伤害他，瞄准他身旁的阳台“栏杆”开了一枪。他被吓得倒退数步，靠在“栏杆”上面，你丢下一句:“我以后不想再看见你。”就返回自己的客房。\n(23:10）窗外传来东西坠地的声音。\n(23:20）你想出去看一下，推门时感觉门被顶住，你拿起“汉阳步枪”，又去推门，这次一推门就开了。你看见走廊上只有身穿伪装的【徐伯清】走向他自己的房门口，你不想跟他再说话，关门回到房里。\n(23:40）你估计【徐伯清】已经回房，就走出房，看见一个人影在楼梯口一闪而过（你没看清长相)。\n(23:50）你跟着人影来到楼梯口，看见一楼走廊上，一个男人（这时一楼光线很暗，你没看清他的长相）扶住【陈均梦】，对她说:“谁要欺负你，我就要他的命!”你记得【姚仲义】提过【陈均梦】是他的嫂子，估计这男人是他兄长。你不愿偷听夫妻情话，就上楼回房。\n(00:40）窗外有“碰”的声响，你打开窗户，看见大门外有人，【红夫人】探出头来，然后她带一个男人进了大宅。你苦笑一下，关好窗户，回床上休息。\n今天（8月3日）早上\n天刚亮你就收拾好行李，想去看看马车。你留下行李，走出大门，看见大门外的地上有血迹，一直延续到大宅最东边（一楼主卧室）的窗外。血迹尽头是一个躺在地上的人。\n你走过去，见到地上的人正是【徐伯清】!他的伪装只剩下染血的“白围巾”。你看他头上有伤，胸口有一个血洞，伤口的血液已经凝固，早已死去多时——你抬起头看上面正是你昨晚开枪的二楼阳台，阳台的“栏杆”就在【徐伯清】的身子下面……\n你急匆匆回到客厅，通知大家出了人命，因为昨晚没有离开村子的马车，你知道真凶一定藏身在这里……",
    "Relationship": "1、徐伯清:死者。二十多岁，曾在武昌参加起义，后被派往山西，经常去你家。你们一起到苏州，你猜他这次伪装来“百里村”是为了完成部队给他的任务。\n2、姚仲义:【姚】家的二少爷，认识【徐伯清】。\n3、虞医师:被【姚仲义】请来的医师，他挟持【陈均梦】从树林里出来。\n4、红夫人:【姚】家的太太。\n5、贵叔:你注意到他的眼神游离，想起【徐伯清】说的“被通缉的危险人物”。\n6、陈均梦:【姚仲义】的嫂子，一直闭着眼，你不知道在她身上发生了什么事。\n7、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、你在苏州游玩时，遇到军队严查私人携带军械——好在他们没有怀疑女性会带枪，仅仅严查男性─—你听说之前有一个走私军火的中间商被就地正法。\n2、隐瞒你带着“汉阳步枪”。\n3、【徐伯清】告诉你“百里村”下午没有出村的马车。\n4、你问【虞医师】为什么要挟持【陈均梦】。\n5、你觉得【虞医师】眼熟，想起过年时曾见过他来“廖家公馆”找【任爷爷】。\n6、隐瞒【徐伯清】曾对你告白并被你拒绝。",
    "Purpose": "1、找出真凶。\n2、不让别人指认你是真凶。\n3、找出昨天（8月2日)下午树林里发生的事件的真相。\n4、找出【徐伯清】提及的“危险人物”。\n5、找出昨天下午溜进你客房的人。\n6、找出昨晚听到的“交易”的真相。\n7、隐瞒你在阳台开过枪。",
    "Ability": "你能辨认出以下“标识”的枪械的型号和子弹口径\n1、【*】(勃朗宁M1903，美国产）9mm手枪子弹。\n2、【◆】(江南制造局产，中国自行设计制造的第一种连发枪）8mm步枪子弹。\n3、【◎】(标有“试制”字样）8mm步枪子弹。你的“汉阳步枪”。\n4、【★】(标有“试制”字样，毛瑟枪外观，特制子弹）8mm手枪子弹。"
  },
  "姚仲义": {
    "Story": "姚仲义\n男。年纪二十出头。短发白净，举止斯文。说话时，语气谦逊有礼。从不跟仆从生气。\n你是【姚长寿】的庶出次子，你母亲【张雅娣】是父亲大太太【徐夫人】的陪嫁婢女，你们处处比【徐夫人】和她生的【姚孟仁】(你的嫡出大哥)低一等。能平等看待你们的只有同住在大宅里的【敏月姐】，她和你表哥【张得采】(你母亲的侄子，和你们住在一起）关系很好，她还教你和大哥“启蒙思想”。\n你唯一的朋友叫【虞君鸿】，十多年前（1900年)，他来“百里村”时和你认识。(1903年）你母亲从二楼阳台摔落身亡后，父亲送你去京城读书，寄住在他家。三年前（1911年)，家里来信说大哥去世，当时【徐夫人】已经死了，父亲续娶【红夫人】做继室。你回家后留在“百里村”，和好友只有书信往来。\n父亲没送大哥的尸骨去祖坟，而是葬在村北树林深处(外人不知道进来的路):那里有一片泛黄的土地,中间是一座二层洋馆,大哥的坟在洋馆东,用砖石修筑，碑上刻着“姚家不肖子孟仁之墓”。洋馆正门被一把“大锁”(锁上有法蓝绘饰,锁孔是扁口特制)牢牢锁住，父亲没有钥匙，就拆开洋馆后墙，安排大哥新娶的妻子【陈均梦】住进去守孝，每天派人送饭——这是你第一次见到【陈均梦】,她脱下红装换上孝衣，从新娘子成了未亡人。\n你常去树林，从远处看望【陈均梦】。一天，你见到她站在阳台上放飞一只白鸽，秀美的面孔苍白动人——你的心被这一幕深深打动。\n大约半个月前，有顽童晚上跑进树林，你带人找到他，他不断胡言乱语说见到“鬼”——那“鬼”走过的地方没有活物,连毒蛇都被吓跑了……你看这里离洋馆不远，担心【陈均梦】，让人送顽童出去后，就去找她。\n你见到【陈均梦】站在洋馆前，手持“空木笼”，月光洒在她身上，仿佛镀了一层光晕，这时你发觉有些不对劲——眼下是七月，树林里的温度比外面低很多，周围的虫鸣都消失了……寂静的夜幕下，只剩下你和她在呼吸。你鼓起勇气走过去，借顽童的话题，第一次跟【陈均梦】交谈——【陈均梦】说她遇到被毒蛇围住的顽童，她去救人时，毒蛇都纷纷逃走，她也不知道是什么缘故。\n你立刻想到好友【虞君鸿】，他见多识广，又非常热心。你向【陈均梦】保证，很快会把这事查一个水落石出——你看【陈均梦】露出笑容，内心有抱住她的冲动,但她身上的白衣却提醒你，她是你的寡嫂!\n你给【虞君鸿】写信，请他来苏州，帮你调查“怪事”——你这时有一个非常大胆的想法:今年已经是【陈均梦】为大哥守孝的第三年，等她的孝期结束，你可以替大哥续娶她!\n你父亲在第二天病倒，【红夫人】请一位女西医【方医生】给他看病，你觉得并不见效-—父亲有时会一动不动地坐在床上，连话都说不清楚。\n(8月1日)一个头戴“黑爵士帽”，用“白围巾”挡住面容，还戴了一副“墨镜”的【神秘人】来家找你，他见到你后摘下伪装——竟是你的大哥【姚孟仁】\n大哥带你去二楼客房，告诉你他现在的身份是民国军人【徐伯清】，奉命来“百里村”公干，只在家里住几天——他警告你不能把他的身份泄露出去——如果有人问，就说他是【姚】家的“债主”。\n你告诉他【陈均梦】在为他守孝，他自言自语:“我已经让她回家了，怎么又回来了……”你刚要问他三年前的事，他就问你父亲是不是病了，你点头后，大哥说:“诅咒——这就是诅咒!我早警告过他了……”\n你不敢想像【陈均梦】得知大哥生还后的事情——这时你收到电报，原来【虞君鸿】已经到了苏州，等你去见他。",
    "Script": "昨天(8月2日）下午\n大哥让你送一封“信”去苏州的“临池客栈”，恰巧【虞君鸿】就住在那里，你把“信”交给客栈后接上好友，乘马车返回“百里村”。\n你们在路上聊起天南地北的故事，从清末一直说到民国，你正聊得高兴,【虞君鸿】突然问起那件“怪事”——大哥回来后，【陈均梦】身边的“怪事”就轮不到你来过问，你只能向好友解释说:“我给虞兄写信时，确实想请虞兄来一探‘怪事’究竟—没想到这原来是一场‘诅咒’……”你用“诅咒”来形容大哥的归来，然后说道:“我眼下有一个不情之请，虞兄一定要答应!”\n你跟【虞君鸿】提起家里情况，你想请他扮演一位留洋归来的“医师”，由你请来借看病为名，避开旁人，私下向生病的父亲问一件事。【虞君鸿】好奇是一件什么事?你攥拳说道:“我大哥姚孟仁到底是怎么‘死’的!”\n马车抵达“百里村”后，你带好友去二楼客房（你给他准备露台间围栏不高的客房)，安置行李后，下来一楼客厅见【红夫人】——她正在和【方医生】说话，【方医生】看见你们进来就告辞出去——你趁机把好友（虞医师）按计划介绍给【红夫人】。\n【红夫人】和【虞君鸿】交谈时，【陈均梦】的陪嫁侍女【陈安巧】领着一位带行李的【短发女人】进来。她说要找【徐伯清】。你马上带她去二楼大哥的房间——上楼时,你们互通姓名，知道她叫【云凌】。\n【徐伯清】看见【云凌】非常高兴，让你出去——你不知道他们在房里聊了什么，只听到大哥的笑声，然后大哥让你送【云凌】去二楼客房安顿。\n客房钥匙在一楼主卧室，你拿钥匙时看见父亲躺在床上，胸口不断起伏，你赶紧拿药（锁药的柜子只有你和红夫人、方医生有钥匙，你看见柜门打开)。房里的落地窗上挂着垂地的厚窗帘，其中一块被拉开——你并没在意，找出钥匙,送【云凌】去离二楼阳台最近的客房。然后你去问大哥这女人是谁?大哥说:“她将是徐伯清的妻子。”你马上问他守孝的【陈均梦】该怎么办?\n大哥轻描淡写地说:“我没想到她会回来-—都民国了，还守什么孝……你等她孝期满了，叮嘱她另外嫁人就是。”你听了又惊又喜，但看大哥另寻新欢,心里涌起一丝不安……\n你想去见【陈均梦】，但不知是不是该把真相说出，你犹豫数次，终于走到树林外，看见树林深处升起滚滚黑烟，还有火光。一个【头发乱蓬的男人】在树林边上，抓住受伤昏倒的【虞君鸿】。你跑过去扶住好友，说明身份，这时你看到的【云凌】扶着已经昏迷的【陈均梦】。\n【头发乱蓬的男人】自称【贵叔】，懂一些医术，也想帮忙。你来不及多想，请【云凌】把【陈均梦】扶进大宅的一楼旧屋（大哥曾经的卧室)，你则扶【虞君鸿】去二楼客房。不久【贵叔】上来帮【虞君鸿】处理胳膊上的伤口，【虞君鸿】这时醒了，你给他端水，又不住地谢谢【贵叔】,【贵叔】给【虞君鸿】喂了掺了药的水（你觉得是为了帮助好友恢复)，【虞君鸿】沉沉睡去。\n【贵叔】告诉你【陈均梦】的情况——她的眼睛因为毒素影响视力，已经帮她敷过药，这几天不要睁眼，换几次药就没事了。【贵叔】说完离开，你看【虞君鸿】喘气不稳，就留下来陪他，直到他呼吸正常，才放下心来。\n天这时黑了，你去看望【陈均梦】——她闭着眼睛，你跟她轻轻打了招呼，她请你送她去主卧室，见你父亲。\n你扶着她的手来到主卧室，看见【红夫人】和【贵叔】。父亲这时情绪激动，从床上挣扎起来说:“我的孟仁回来了……我看见他了……3\n【红夫人】手里的灯掉到地下，火苗蹿起来，父亲把他的“日记”撕开（你从没看过里面的内容)，扔进火里，【贵叔】见鬼似的踩灭。大家都没说话，只有【姚长寿】看着“烧坏的纸张”说:“我找到了……你休想抢走……”【陈均梦】哭出来，【贵叔】让你送她回去，记得今晚再换一次药，你扶她回房换药，看她眼角的泪痕，对大哥突然有了怨恨，但想到只要大哥带着【云凌】离开，你就可以等心爱的人孝期过后正式娶她，又高兴起来—【陈均梦】问父亲所说的事情时，你回答父亲病得厉害，开始说胡话了。\n昨天(8月2日)晚上\n(21:50）你去厨房给没吃晚饭的【虞君鸿】找食物，看见一盘“太湖银鱼”(这是红夫人的拿手菜)，就用托盘端了出来。\n(22:00）你走上二楼，大哥从他的客房开门出来。他把伪装用的“黑爵士帽”，“白围巾”和“墨镜”拿在手里，你知道他做事随心所欲，有些担心。大哥让你去屋顶天台（你上去后就放下了鱼)，他跟着上来，当着你的面，把“三件伪装”扔下天台，然后说:“我不干了!当什么民国军人，查什么要犯，这些都没意思，云凌看不出我的心意，我还当什么徐伯清!”你马上问他是要回来吗?\n“当然了!让徐伯清见鬼去吧!”大哥恶狠狠地说，“我要做回姚孟仁，然后惩罚那个嘴上说守孝、对我诚实，却至今仍在和外面‘私通’的女人……”你忍不住反驳:“你怎么能这么说她!”“少废话，你一个婢妾生的,还敢过问我的事!我说了就有证据!”他踹倒你，又不断殴打——就像小时候一样。\n你却不再是以前的【姚仲义】，你反抗他时，从他的腰上抓出一把“手枪”。他看见了反而大笑起来:“你有本事就往这里开枪!”他手指额头，还帮你把枪的保险打开，然后靠在天台边上嘲笑你说:“姚仲义!你和你娘都是我姚家的下人、贱种……”大哥的话让你不相信他是新时代的民国军人，他哪里有一点能带来平等时代的样子!\n(22:30）你想警告大哥，抬高枪口后扣动扳机，没想到枪的后坐力非常大，把你震得几乎摔到——大哥向后仰去，发出一声惨叫，从天台中间向外摔落，掉了下去。你的手仍在颤抖，使足力气把“手枪”扔下天台后，跌坐地下。枪声让你一时听不见声音，你堵住耳朵，脑海里不断回响大哥喊你名字的声音。\n(23:00）你的听觉终于恢复过来，你从天台往下望去:大哥的尸体就在二楼的西边露台上，血从胸口涌出来，染红了露台——你这时内心反而非常平静,只有脱力后的疲劳。\n(23:10）你在下天台的楼梯口看见【虞君鸿】从房里出来，想起刚才要去找他，以及给他带食物，就返回天台拾起“太湖银鱼”。\n(23:20）你敲着【虞君鸿】的房门问:“虞兄，回来了吗?”屋里没有回应,你只好把“太湖银鱼”放在他房门外后下楼。\n(23:30）你回自己房里，听到有人问“现在是几点?”声音很近，你打开一条门缝,看见【红夫人】红着脸，从【贵叔】的房里出来。\n(23:50）你不知道好友回来了没有，就再次上楼，在二楼储物间门口的地上看见大哥的“黑爵士帽”，你捡起来跑回自己房，心里一阵慌乱。\n(00:10）你这时非常想见【陈均梦】,就去一楼旧屋,看见心上人坐在床上，脖子上多了一件“饰物”。你问她眼睛怎么样了，她没有回答，而是突然问你:“屋里还有什么人吗?”你环顾屋里后对她说没有。她摇头说道:“我遇到你大哥了……”这一句好似晴天霹雳，你急忙说道:“不可能!他已经死了——我亲眼看见了!”然后你转身跑了出去。\n(00:20）你躲回自己屋里，无法入眠，你想起父亲的药里有稳定情绪的，就去主卧室拿。【红夫人】这时不在房里，父亲在熟睡。你发现柜子里已经没有药了。你在卧室里找了一遍，什么都没有发现。\n(00:50）你失望地回到自己房间，关上门的一瞬间，看见【红夫人】带着一个男人进了主卧室。你今晚遇到太多意外的情况，终于感到疲惫，沉沉睡去。\n今天(8月3日)早上\n你不断做着噩梦，好不容易熬到天亮。你去敲【虞君鸿】的门，他开门后，你带他来到客厅——你猜到大哥的尸体被人看到了—【云凌】说昨晚没有离开村子的马车，真凶一定还藏身在这里……",
    "Relationship": "1、姚孟仁:你同父异母的大哥，他伪装成【徐伯清】，被你开枪打下天台。\n2、陈均梦:【姚孟仁】的妻子，你的心上人。\n3、虞君鸿:你的好友，你本来请他来调查发生在【陈均梦】身上的怪事，现在请他假扮留洋的【虞医师】，找机会问出大哥当年“死亡”的真相。\n4、红夫人:【姚长寿】的继室，你跟她很少交流。\n5、姚长寿:你的父亲,“百里村”的大地主，现在得病卧床。\n6、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、【虞君鸿】是你从海外请回来的医师（可以讲一些不被人怀疑的经历)。\n2、客房的门可以从房里锁上，房间的“钥匙”除了给客人的一把外（你安排人住宿时都会给他们客房的钥匙)，还有一套“备用钥匙”在一楼主卧室里。\n3、你不认识【徐伯清】，他自称是【姚】家的“债主”。你准备安排他和父亲见面（但是父亲最近似乎有些神智不清)，才领他住在二楼客房。\n4、你不知道家里要卖地。",
    "Purpose": "1、不让别人指认你是真凶。\n2、不让别人发现【徐伯清】就是【姚孟仁】的事实。\n3、不让别人指认【陈均梦】是真凶。\n4、隐瞒你对大哥开枪。",
    "Ability": ""
  },
  "方医生": {
    "Story": "方医生\n女。二十九岁。双颊消瘦，头发齐肩。身穿白色大褂，中性打扮系领带。独身至今。\n你没学过医，自然也不是医生。你本名【方敏月】，你父亲【方乘山】给“法蓝庄”主人【孟老爷】做事，担任“法蓝庄”【杜老总管】的助手。父亲带着你和母亲，和同样给【孟老爷】做事的同事【姚长寿】一家，都住在“百里村”的大宅里（后来的姚家大宅)。\n父亲欣赏新式教育，从小教你读书，你很敬爱他。大宅里还有【姚长寿】的两个儿子:1l岁的【姚孟仁】和6岁的【姚仲义】，你把学到的“启蒙思想”教给他们，【姚孟仁】听得非常入迷。【姚长寿】侧室【张雅娣】的侄子【张得采】也住在大宅里，他和你年纪相似，对你很好。你那时15岁，懵懵懂懂感到爱情，向往“桔梗花”的花语—永恒的爱。\n美好的时光最易流逝。(1900年)【杜老总管】去世不久，你父亲毫无征兆地失踪了，你非常痛苦，被母亲带回上海娘家。你离开大宅时，【张得采】追出来跟你约定，将来一定会发大财，带大红花轿来娶你。\n你母亲身体不好，你又别无兄弟，只能中断学业，去姨父在上海浦东经营的“嘉善堂”医馆帮忙赚钱。没想到不久“嘉善堂”倒闭，医馆一个前辈介绍你去“闸北西医院”照顾病人——那段日子很艰苦，好在有【张得采】的来信，你回信时总把好事告诉他，很少提困难。\n三年后(1903年)，你收到【张得采】最后一封“信”，他说他赚了一大笔钱，很快会来找你，然后娶你。你把这封“信”当宝物，等待他的出现。时间一天天过去，【张得采】却从此音信全无………\n你要赡养母亲，靠努力工作来度过感情的难关——父亲和爱人的失踪让你害怕再次失去身边的人，因此一直独身，也少了很多烦恼，今年还被提升成西医院的“护士长”(“护士”是今年，即1914年，刚刚从Nurse翻译来的新鲜词)。\n三年前（1911年)，你的表妹【田红娇】(她因家里经营酒馆“翡翠居”，村里人都称她作“卖酒阿红”，很会跟客人打交道）嫁给【姚长寿】(这时姚长寿已是大地主，他的年岁足够做表妹的父亲)。你参加婚宴，在酒席上喝多了，不甘心被表亲轻视，夸口说在上海“闸北西医院”当医生，是女西医【方医生】\n上周，你收到表妹的来信——她说【姚长寿】得了病，请你来诊断。你硬着头皮到【姚】家，看见【姚长寿】比实际年龄还要衰老，精神萎靡，肤色上出现“黄疸”，眼球颜色也不正常。你暗中记下这些，回上海找西医院里内科【宋医生】(宋笃诚)，他给你一些药，里面有“硼酸溶液”和“金霉素”，还告诉你用法。你转手高价卖给表妹(照顾母亲已经让你精疲力竭，你非常需要额外收入)。\n你用这种方法伪装成【方医生】，还赚到钱，虽然【姚长寿】没有康复，但是表妹仍信任你的治疗—你没跟表妹提过曾在这里生活的事,【姚长寿】和【姚仲义】也都没有认出你。\n你在这期间偷听到【姚】家的秘密——【姚长寿】曾对表妹喊道:……地下面有宝贝……谁敢卖就打死谁!然后他把表妹骂出卧室——你看不惯【姚长寿】的专横霸道，回上海医院找来一些“镇静剂”交给表妹，【姚长寿】吃下去后情绪稳定,但也没有再提过“宝贝”的事。\n你猜想【姚长寿】的成为大宅主人和大地主的背后一定有文章，甚至可能和你父亲的失踪有关。你借照看病人为名，请表妹给你在二楼安排下一间客房（她给了你房间钥匙）——这样你才有机会留在宅子里，直到找出真相。",
    "Script": "昨天（8月2日）下午\n你在客厅和表妹闲聊，【姚仲义】带客人来见她，你趁机去找【姚长寿】——你听西医院的医生说过，有的病人在服用“镇静剂”后，很容易说出一些平时不会说的事情。你来到一楼主卧室，先让【姚长寿】吃药（锁药的柜子只有你和红夫人还有姚仲义有钥匙)，然后试着问他，他说出一个你意想不到的故事:\n【姚长寿】一直在寻找【孟】家当初派【杜老总管】藏在“百里村”的“宝贝”，当初来藏东西的人早已不在人世，唯一知晓秘密的人也失踪了……你立刻问他:“失踪的人是谁?“\n“他叫方乘山，是我和老陈的同僚，可是孟老爷只信任他和杜老总管……”你早猜出失踪的人是父亲，但听【姚长寿】亲口说出，心里仍是一阵颤抖——【姚长寿】这时激动起来，喊道:“你为什么要问他，你是谁?为什么要问他!”这时你听到有人推门，就躲到窗帘后面（主卧室里的窗上都挂着落地窗帘)。\n你透过窗帘缝隙，看见进来一个头戴“黑爵士帽”，用“白围巾”挡住面容，还戴了一副“墨镜”的【神秘人】。【神秘人】走到【姚长寿】床前，【姚长寿】指着【神秘人】还没说话，就被【神秘人】捂住了嘴。\n【神秘人】说:“你想不到我会回来吧?”【姚长寿】不断挣扎,【神秘人】松开手说:“当初不可一世的姚长寿如今只能在床上苟延残喘，多可笑啊─—我当初劝你，那些宝贝本来就是胡说八道，你，还有姓陈的，你们密谋的结果还不是一无所得?”\n【姚长寿】大口地喘着气，【神秘人】把水杯递给他说:“你已经得到这么多的土地,就该老老实实地安度晚年——年轻的妻子不错啊-—你我的追求不同我自有目标，不然早回来了。”说完他扶【姚长寿】躺回床上，要出去的时候,又回头说道:“我其实知道宝贝是什么了——这对你来说，已经毫无用处了。”\n你现在知道“宝贝”和父亲的失踪必然有关,就偷偷跟【神秘人】上了二楼。他走进客房，你躲到去天台的楼梯上，暗中观察【神秘人】的门口（你在楼梯上只能看到这里):你看到【姚仲义】先带一个【短发女人】走进【神秘人】的客房，然后【姚仲义】送【短发女人】离开后又回到【神秘人】的客房里，你不知道他们说了什么。【姚仲义】出去后不久，【神秘人】也离开客房下楼。你想进他房间却发现他锁了门——你回到自己房里，下决心不惜一切代价也要找出父亲失踪的真相和下落。\n昨天（8月2日）晚上\n(22:10）你听到走廊上有人说话，悄悄打开房门，看见【姚仲义】和【神秘人】一前一后走上天台——【神秘人】的房门没有关上。你刚要进去，就被表妹叫住——她来询问【姚长寿】的病情，你随口敷衍:“我诊断姚长寿病情很麻烦，他受病毒侵蚀，导致皮肤异样，脉搏轻——要杀死病毒，只能靠西医院的特效药，那药很猛，任何病毒都不在话下……就是价钱不便宜!”\n(22:20）侍女请表妹下楼，你溜进【神秘人】的客房，关上门后，在房里翻找—─—你这时非常紧张，随时留意着房外的动静——你听到隔壁〈朱迪房)有人出去。\n(22:30）你找到“撕开的地图（上)”，上面有【方乘山】的“签名”——你终于找到和父亲失踪有关的确凿证据—-—你记得最后一次见到父亲出门时,他带着一张临时绘在写信用纸上的“地图”(你让父亲在上面签名，说这是一张画作)，还有一把特制“法蓝钥匙”(扁型钥匙)，说是【杜老总管】在世时交给他保管的,要送还给【孟老爷】。你还看见地图上有褐色的痕迹!\n你知道血迹要过很久才会变成褐色，害怕一直“担心的事情”已经发生，就走到露台上，借月光看清楚，确实是血迹——你知道父亲早已经被害——凶手为了夺走“地图”杀害了他。天台上传来“碰”的声响，一个男人从天而降，摔到你的面前。你想躲已经来不及了，一个“物件”掉到你的脚边。\n(22:40）男人爬起来，因为额头摔破而满脸是血，他的表情愤怒而扭曲。\n(22:50）男人瞪着你，然后他把目光转向地上的“物件”，是一把“手枪”(你在上海知道扣动扳机就能杀人),你马上捡起来。男人仰头大喊:“姚仲义!”\n(23:00)男人注意到你手里“撕开的地图(上)”,对你吼道:“把地图还我!”你举起枪，指着地图上父亲的“签名”问他:“地图原先的主人在哪里?”男人冷笑道:“早就被我一枪打死了——你要不把地图给我，也跟他一个下场!”你想不到凶手会如此简单地承认，宝贝的魔力让他们连杀人都无所顾忌……月光照到你的脸上，冰冷的泪水滑过脸颊，你的心充满悲愤。男人看到后神情大变，突然喊出你的名字:“方敏月，我认出你了——你是方乘山的女儿!”\n男人伸开手臂要来抓你。你却要为父亲报仇!你扣动扳机(枪的保险是打开的)，子弹近距离打中男人的胸膛。枪声很响，你一时间听不到声音——你看到男人在说话，却听不到，然后他向后倒去，摔倒在隔壁的露台上（西边)，血向上喷出来。你被枪的后坐力震得摔到在地，“手枪”被甩到反方向的露台上(东边)，你爬起来跑回房里,用发麻的手捂住嘴。\n(23:20）隔壁的房间（虞医师房）响起敲门声，你发现恢复了听力。你屏住呼吸，听到【姚仲义】的声音:“虞兄，回来了吗?”并没有人回应。\n(23:30）你听到门外的人离开后，立刻出来，看见东边相邻的虞医师房门外地上有一盘放在托盘上的“太湖银鱼”。你快步回自己客房(你的客房在虞医师房的东边相邻)，你觉得可以把刚才听到和看到的事当作自己在房里的证据。\n(00:40）你站在窗前，看见窗外正下方的楼下有人拖着一件物体——外面太黑了，你并没有看清。\n今天（8月3日）早上\n你一觉醒来，【姚】家已经一片大乱——你杀害的男人的尸体被发现了—首先发现尸体的【短发女人】说昨晚没有离开村子的马车，真凶一定还藏身在这里。你跟大家一起在客厅里，装作一无所知……",
    "Relationship": "1、方乘山:你的父亲，他是【杜老总管】的助手，1900年在【杜老总管】死后失踪。你断定他已经死亡，并且和【姚长寿】提到的“宝贝”有关……\n2、姚孟仁:【姚长寿】的长子，已经去世，你是他的启蒙老师。\n3、姚仲义:【姚长寿】的次子，你教他时他只有六岁，现在没有认出你。你还记得他因是婢妾所生，一直对正室所生的大哥【姚孟仁】处处忍让。\n4、姚长寿:“百里村”的大地主，曾是你父亲的同事。\n5、红夫人:本名【田红娇】，是你的表妹，也是【姚长寿】的继室。你记得她曾有一个姓【范】的未婚夫，在成亲前那男人死了（她在村北树林里找到未婚夫的尸体)。\n6、张得采:你的初恋，已经失踪。\n7、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、你喜欢的植物是“桔梗花”和“文竹”，它们的花语是“永恒的爱”和“纯洁的心”，你曾幻想在婚礼上佩戴它们—后来你才知道“白色桔梗花”还有一种花语是“无望的爱”…….\n2、你回上海拿“镇静剂”时，曾遇见当地驻军部队的抓捕行动，阵仗很大。他们在酒楼里抓出来一个宿醉的男人，男人满嘴酒话:“老子就是‘白头蛇’，谁敢动老子，老子就去‘百里村’叫来土匪杀他全家!”。\n3、你在医院听说，患有精神病的杀人犯可以免除死刑。\n4、你父亲跟你提过【杜老总管】的儿子叫【杜贵成】，你在“闸北西医院”里意外得知，【宋医生】(给你药剂的医生）跟他做过同学。",
    "Purpose": "1、不让多数人指认你是真凶。\n2、找出父亲死亡的真相。\n3、找出【姚】家“宝贝”的下落。\n4、找出【张德采】的下落。",
    "Ability": ""
  },
  "朱迪": {
    "Story": "朱迪\n男。年纪三十出头。烫发，唇上蓄胡须。身穿西装，说话时常夹一些洋话。有吸烟的习惯。\n你并不是买办，【朱迪】是你的假名。你本名【张得采】，父母早亡，跟在姑姑【张雅娣】身边长大，她是【姚长寿】的婢妾，虽然生了二少爷【姚仲义】,但母子的身份仍然比不了大房太太【徐夫人】和嫡长子【姚孟仁】。\n那时大宅里还住着【姚长寿】的同事【方乘山】一家。【方乘山】的女儿【方敏月】和你年纪相近，她接受新式教育，让你很羡慕。【方敏月】对你很好--那是你在大宅里最美好的一段时光，可惜很快消逝——1900年【方乘山】突然失踪，他的妻子带【方敏月】回上海娘家，你追出来跟心上人约定，将来一定会发大财，带大红花轿娶她。\n你此后和【方敏月】只有书信往来，了解到她对【方乘山】的失踪非常痛苦，但她很坚强，在浦东的医馆实习，后来还去了一家西医院，你这时仍在姑姑家寄人篱下，开始担心彼此间的距离越来越大。\n后来【姚长寿】成了“百里村”大地主，【徐夫人】对姑姑越发不满，大少爷【姚孟仁】把你和【姚仲义】都当作下人，呼来喝去，你们不敢反抗。三年后(1903年）姑姑从二楼阳台摔落身亡,【徐夫人】让【姚长寿】送【姚仲义】去京城上学——你那时已经成年，觉得是时候离开了。\n你离开【姚】家前，偷了值钱的东西—─你当天给【方敏月】写信，告诉她你赚了大钱，马上去娶她——你刚寄出信就被【姚孟仁】发现并抓起来，送进官府。你出狱后，两手空空去了上海，没脸见【方敏月】，只能混迹在城里，给自己起了洋名【朱迪】，仍幻想有一天出人头地，风风光光地去迎娶心上人——许多年过去，你不但毫无建树,连一份正经差事都没有。\n上周，无所事事的你回到“百里村”，才知道【徐夫人】早已去世，【姚孟仁】也得病死了，这时【姚长寿】新娶了一位【红夫人】。你来到【姚】家，自称在上海跟着洋老爷们做买办，现在回来探亲（你隐瞒你的真实身份，只说是姚家的亲戚)。【红夫人】热情地接待了你。\n你们聊天时，【红夫人】提到家里有一块闲置多年的土地（村北树林)，【姚长寿】想卖了换现钱。你觉得这是一个抽佣赚钱的机会，连表弟【姚仲义】都没见，就跑回上海找买家——你坐牢时认识一个绰号“白头蛇”的人，自称有很多门路。你找他询问时，他突然问你“百里村”里有没有能藏东西的地方?\n你记起十多年前，【方敏月】的父亲【方乘山】雇佣了一个叫【范金魁】的工头，你替【方敏月】去找她父亲时，见到他带人在村北“白霜亭”附近挖掘和运输东西—后来地下发生坍塌，你跑去大宅喊人，告诉他们后面出事了，【范金魁】带去的“李家兄弟”都没跑出来……“。\n你带“白头蛇”在“白霜亭”附近找到一个早已被杂草掩埋的入口。地下有一条隧道，里面什么都没有，你们走到尽头找到机关，打开后就是出口。你们上到地面，看见出口是一块可以移动的坟前墓碑，刻着“姚家不肖子孟仁之墓”。坟墓西边有一座灰白色的二层洋馆，矗立在一片泛黄的土地上，洋馆外墙上生满藤萝。洋馆正门被一把“大锁”(锁上有法蓝绘饰）牢牢锁住，扁形的锁孔绣痕斑斑,不知锁了多久。周围都是茂密的树林。\n“白头蛇”大笑起来，说这地方好，一点人烟都没有——后来“白头蛇”往隧道里运进去不少木箱，藏在隧道尽头墓碑的下方。他回上海前给你一个任务，说这几天要是有人来找你看货，你就接待一下，事后少不了你的好处。\n你跟【红夫人】谎称已经找到买家，对方很快会来看土地，你要在这里住上几天等他。【红夫人】安排你住到二楼有露台的客房（露台间的围栏不高)，还给了你房间钥匙——你等了几天，并没有外人来，你去上海找“白头蛇”，听说他被驻上海的部队抓走。“白头蛇”在审讯后企图逃走，被调来查案的中尉击毙!",
    "Script": "昨天(8月2日）下午\n你赶回“百里村”，在“白霜亭”外遇到一个【头发乱蓬的男人】，怕被他看见，就装作闲逛，并点燃一支烟，他跟你要走一根“洋火”(火柴)。你看他走远才钻进隧道，跑去“白头蛇”藏东西的地方，撬开箱子看见里面都是“步枪”。\n你被吓到头昏冒汗，赶紧用外衣裹住一支“步枪”，打开机关上来，呼吸几口外面的空气，开始绕着洋馆踱步——你知道自己被牵连进一场军火走私，这要命的违法交易很可能已经暴露——你突然看到洋馆二层有一个身穿白衣的【长发姑娘】站在阳台上，把一只白鸽放飞到空中。\n你怕回隧道时被她看见，就划了一根“洋火”点着地上的枯叶，想转移【长发姑娘】的注意力。没想到这火见风就起，青色的火焰一下子燎到洋馆一层，你赶紧跑回隧道，心想这次犯了要命的事—多亏你跑得快，当你从入口离开隧道后再回头看时，隧道里已是滚滚黑烟，还有刺鼻的味道。\n你跑回【姚】家，在客厅里见到【红夫人】在和一个客人说话。你出于礼貌，跟对方打了招呼——你此时只能寄希望于“白头蛇”的交易对象,希望从对方那里得到逃亡的花费或门道─你悄悄问【红夫人】今天有没有奇怪的人来，【红夫人】小声告诉你二楼来了一个【短发女人】，像个女土匪。\n土匪?太好了!——你不等【红夫人】介绍客人，借口说不舒服，急匆匆去确认【短发女人】的身份。\n你从客厅出来，看见【姚仲义】从一楼主卧室（姚长寿和红夫人居住）出来后去二楼（你躲在楼梯处，他没注意)，你看他送土匪装扮的【短发女人】去了二楼客房。你知道一楼主卧室里有一套“备用钥匙”，溜进去拿时见到【姚长寿】躺在床上。你在床边等了一会儿，看他没有动静，就偷出“备用钥匙”，上楼去敲【短发女人】的房门，确定房里没人后开锁进去:屋里有一个“青布”缠绕的长包裹,你打开一角，看里面是一支“步枪”。\n你断定她就是“白头蛇”的交易对象，但你不敢贸然接触。你回客房后思索着该如何跟她进行“交易”——你躺在床上思来想去，不觉得睡了过去。\n昨天（8月2日）晚上\n你睡得并不安稳，很快就被声响吵醒，你睁开眼睛，看房间的露台上有一顶黑箭士帽”，一副“墨镜”，以及一条“白围巾”。\n(22:10）你想去接触【短发女人】，刚走出客房就看到许多年不见的【方敏月】——她比当年更加削瘦，你仍一眼认出来。你现在不但没有出人头地，还陷入麻烦，不愿被她看到——多亏这时【红夫人】来叫她，你隔壁的客房门又正好开着，你躲在隔壁房里，听她对【红夫人】说:“我……伯…清……杀死……”你没听完就赶紧躲回自己房里。\n(22:20）你戴上露台上的“黑爵士帽”和“墨镜”，用“白围巾”挡住面容——即使你被人见到，也认不出来你是谁（你尤其怕被方敏月认出)。你写了一个“字条”:“今晚子时（23点)，我在二楼阳台等你”，趁二楼走廊上没人，房门都关着，把“字条”塞到【短发女人】客房门缝下面，然后去二楼东边的阳台等她—你把从隧道里带回来的“步枪”也拿上，藏在身后，准备做样品。\n(22:30）你在阳台上听见西边有“碰”的声响。\n(22:50）你听到二楼西边有人在喊“姚仲义”。\n(23:00）【短发女人】拿着长包裹来到阳台，她问你:“你还想干什么?”你猜她已经知道你进过她的房间，就做了让她小声的手势，压低声音说:“我知道你来‘百里村’就是来找我的——明天我按之前约定好的，把东西带上——我跟你一起离开这里。”\n“之前的约定就算了，我已经改主意了。”\n“改主意了?”你着急了,“你还不知道，部队那边的事情暴露了，‘白头蛇’死了，我很快也会被连累，这都是因为你家的这笔‘交易’——没关系，‘交易’可以半价，只要我们明天一起走!”\n你看她在犹豫，赶紧拿出“步枪”当样品，对她说:“看见这枪了吗?事到如今，要不我们一起离开，要不就谁也甭想走了!”你心里知道，打死“白头蛇”的中尉很快就会找到这里，到时候插翅都难飞了。\n你没想到【短发女人】突然翻脸，她解开“青布”，端起她的“步枪”对准你，你越发急了，喊道:“你有本事就现在打死我!”你没想到，她真的对你开了枪，好在只打到了身旁的阳台“栏杆”上——你被吓得倒退，靠在“栏杆”上。你这才知道和“白头蛇”做交易的女土匪是何等的穷凶极恶!你同时也庆幸没有被她看到真面目。【短发女人】丢下一句:“我以后不想再看见你。”就离开了。\n(23:10）你觉得身后的“栏杆”摇摇欲坠，一个【青年】走到你面前，问你是谁?你不想节外生枝，压低嗓音说:“小子，不要管闲事，回你屋去!”你看【青年】仍在仔细打量你，就端起手里的“步枪”吓唬他说:“小子，你是不是活得不耐烦了?”【青年】马上举起手来，你刚要放下枪，他就一个箭步过来，一掌切在你的手腕上，把你手里的“步枪”打掉，反掌拍击你的胸口。你向后撞在阳台的“栏杆”上，然后他一脚踢飞“步枪”，捡起“青布”捆住你的双臂。你挣扎了几下，但是挣脱不开。阳台的“栏杆”突然掉落下去，你多亏【青年】拉住“青布”才没摔下去——你突然想起姑姑【张雅娣】当年就是从这里摔下去的，你也怀疑“栏杆”被做过手脚……\n(23:20）你出了一身冷汗，对【青年】说:“多……多谢!”他松开你，你马上绕开他，走回自己的房间。\n(23:30）你回到房里，刚摘下“墨镜”，就看见露台上有一个死人!你大着胆子看了一眼尸体的脸:他满脸是血，表情震惊，又有些面熟，露台都被他的血染红了!\n(23:40）你把尸体使劲往外推，直到从你的露台上掉下去——你已经打算第二天就逃走，这时绝不能被人怀疑。\n(23:50）你庆幸此前拿了“备用钥匙”，你用它打开二楼储物间——这时你已经满头大汗，就把“黑爵士帽”摘下扔在储物间门口，拿出“抹布”和“清洁工具”擦回房擦干净露台的血迹，又把这些东西都藏进屋顶天台的杂类间。\n(00:20）你回到二楼时发现扔在储物间门口的“黑爵士帽”不见了，你赶紧回到房里。\n(00:30）你这时才注意到自己还系着“白围巾”，上面也染了血，就把它从露台扔下去。然后你听到楼下有“碰”的声响，你没敢探头，爬回床上。\n(00:40）你听见楼下有人说话，似乎是一男一女，你这时已经非常疲惫，不久就昏昏睡去。\n今天（8月3日）早上\n你早起就想离开，但尸体已经被发现，所有人都聚在客厅，发现尸体的【短发女人】说昨晚没有离开村子的马车，真凶一定还藏身在这里……你躲避着【方敏月】的目光，装作一无所知,希望能蒙混过关……",
    "Relationship": "1、姚孟仁:【姚长寿】的长子，大太太所生，为人专横，三年前去世。你偷东西的事被他发现，遭到殴打。\n2、姚仲义:【姚长寿】的次子，你姑姑【张雅娣】所生，你离开这里时他还没有成年，应该认不出你。\n3、姚长寿:你记得他以前并不是大宅的主人和大地主，你现在自称他的亲戚。\n4、红夫人:【姚长寿】的继室，对你很热情。\n5、方医生:她叫【敏月】，是你的初恋，你曾许诺娶她，现在非常怕被她认出来。她的父亲【方乘山】在1900年失踪，你曾见【方乘山】带着一张临时绘在写信用纸上的“地图”和一把特制“法蓝钥匙”(扁型钥匙）出门。\n6、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、你现在是在上海租界给洋人做买办的【朱迪】,手里有不少有“洋火”、“洋纱”等交易，赚了很多钱。\n2、你是【姚】家的亲戚，之前回来探亲，今天就要走了。\n3、打听【方敏月】这些年的情况，小心不要被她认出你是【张雅娣】的侄子。\n4、你想知道有谁对枪械感兴趣。",
    "Purpose": "1、找出真凶。\n2、不让别人指认你是真凶。\n3、隐瞒你是【张得采】。\n4、隐瞒你昨天下午在洋馆外放火。\n5、隐瞒你为“白头蛇”工作以及你昨晚曾在阳台尝试“交易”。\n6、隐瞒你把尸体推下露台。",
    "Ability": ""
  },
  "红夫人": {
    "Story": "红夫人\n女。二十九岁。身穿有金色刺绣纹样的宽袖上衣，红色长裙。妆容明艳，笑声动人。\n你是“百里村”本地人，本名【田红娇】，因家里经营酒馆“翡翠居”，曾被称作“卖酒阿红”。十多年前（1900年）有客人(姚长寿，岁数比你大很多）在酒馆骚扰你，你打了他，他带人堵在酒馆外，被你的未婚夫【范金魁】赶走。\n你介绍【范金魁】带好兄弟【李宽生】和【李广生】哥俩给你姨父【方乘山】工作，不久“李家兄弟”发生意外，【范金魁】也失去行踪。你到处找他，最后在村北树林里见到他已经腐烂、面目全非的尸体，你只能从衣服上辨认出人。此后你常被噩梦惊醒，非常害怕这些“不好的东西”(鬼或尸体）——你也从此下决心，不管发生什么，自己都要好好生活——这期间你不乏追求的酒客，比如【大眼阿坤】、【郭立柱】等人，你都当作过眼云烟。\n三年前（1911年)，已是村里大地主的【姚长寿】派人送来聘礼，还说十多年前就想娶你，可惜当时他老婆没死。【姚长寿】的长子【姚孟仁】来找你，让你不要答应他父亲的求婚并离开这里——如果你同意，他就送你去南方，见识外面的世界。你这时已经决定嫁到【姚】家，并且要【姚长寿】明媒正娶。【姚孟仁】说你早晚后悔!你知道他是【姚】家的继承人，并不敢得罪他。\n你嫁过去后，【姚孟仁】也成了亲，但他很快就染恶疾死了—【姚长寿】把次子【姚仲义】从外面叫回家，将【姚孟仁】的尸骨葬在村北树林深处。【姚孟仁】的新娘【陈均梦】留在那里守孝，由她的陪嫁侍女【陈安巧】负责每日送饭———你在未婚夫死后，一直害怕进入村北树林，下葬那天装病没去。\n大约半个月前，有人在村北树林里看见“不好的东西”:一个顽童跑进去，晚上还没出来，【姚仲义】带人找到他—-顽童已经撞邪，不断地跟人说他见到“鬼”……你听说后非常害怕，又想起未婚夫的死亡。\n也是在那天晚上，【姚长寿】一身黄土回到卧室，第二天就病倒了——他的样子变得更加衰老，精神萎靡，皮肤和眼球的颜色也不正常。你记得他晚上常常离开卧室,很久才回来。\n你的表姐【方敏月】(方乘山的女儿）参加你的婚礼时，提过她是上海“闸北西医院”的女西医【方医生】。你写信请她来给【姚长寿】诊断，表姐出诊后，回上海配了两种“高价药”。你付钱后发现家里现钱不多，就跟丈夫商量，想卖一块地周转。【姚长寿】听完激动地说，地下面有宝贝，谁敢卖就打死谁!还把你骂出去。表姐看到后，送你一瓶“镇静剂”，你喂【姚长寿】吃下，他变得情绪稳定，说什么也不再反对。\n几天前，【姚】家的亲戚【朱迪】来拜访，他在上海租界做买办，跟着洋人赚大钱。你热情地接待他，提到家里有一块闲置多年的土地(村北树林，你最讨厌那里)，你借口【姚长寿】想卖了换现钱，【朱迪】答应帮你物色买家——他不愧是买办，很快就找到买家——他要在【姚】家留住几天，等对方来一起去看土地。你安排他住到二楼有露台的客房(露台间的栏杆不高)。\n(8月1日)【姚仲义】领来一个头戴“黑爵士帽”，用“白围巾”挡住面容，还戴了一副“墨镜”的【神秘人】住进二楼客房。",
    "Script": "昨天(8月2日)下午\n你和表姐在客厅闲聊，【姚仲义】带来一个青年，表姐告辞出去。【姚仲义】介绍青年是他请来给他父亲看病的【虞医师】，还留过洋。你像当初经营酒馆时一样热情地接待他,心里却感到不安。\n一个带着行李的【短发女人】来到大厅，她年纪二十出头，身穿浅色麂子皮衣，长裤皮靴，拿着一个用“青布”缠绕的长包裹（你觉得像个女土匪)。她说来找【徐伯清】。【姚仲义】马上起身，带她去二楼。你觉得【姚仲义】正在计划一些事，不敢让【虞医师】现在见丈夫，就借口说:“虞医师远来，请先休息一晚，明天再给夫君诊断吧。”【虞医师】说要去村里逛逛，你告诉他“翡翠居”不错（你嫁人后交给妹妹阿翠经营，还让她帮你寻过买地的人)，年轻人应该去尝尝那里的“一日醉”，但千万不要去村北树林，那里有“不好的东西”。\n你想找表姐询问丈夫病情，但她不在房里（你敲门没有回应)，你只能下楼——这时【陈安巧】领着来看土地的客人到客厅见你—客人名叫【胡人玉】,对你的开价并没有还价，你和他交谈时，觉得很可靠。\n【朱迪】满头大汗进来，他抱着外衣，身上有刺鼻的气味。他跟【胡人玉】打过招呼，悄悄问你今天有没有奇怪的人来，你告诉他【短发女人】的事。\n【朱迪】说身体不舒服，离开客厅。你和【胡人玉】聊了一会儿，因为现在【姚长寿】没吃药，你不敢让他们见面，就请【胡人玉】去二楼客房住下，说等【姚长寿】休息好再当面确定“交易”。\n你正考虑如何安排他们见面，【姚仲义】就带着几个人进来，其中有【短发女人】，她把昏迷的【陈均梦】送进一楼旧屋（姚孟仁生前的卧室)。一个【头发乱蓬的男人】名叫【贵叔】，自称懂医术，要帮【陈均梦】检查——你没找到表姐，就去一楼主卧室拿出所有的药物，陪【贵叔】一起去（锁药的柜子只有你和姚仲义还有表姐有钥匙，你进去时看见柜门打开，姚长寿在睡觉）。\n【贵叔】帮【陈均梦】检查后，你看他配药的手法很熟练，就称赞【贵叔】的医术，请他留下来，给【姚长寿】诊断一下（你非常想在虞医师诊断前先知道丈夫的病情，还有治疗费用)。【贵叔】说先上楼看一下【虞医师】的情况，再下来出诊(你这才想起,贵叔也是姚仲义带进来的)。\n天黑时【贵叔】来给【姚长寿】出诊——主卧室里的落地窗上都挂着厚窗帘(姚长寿最近怕光)，你拿上灯烛照明。【贵叔】才刚开始看病，【姚仲义】就扶着【陈均梦】进来，【姚长寿】突然情绪激动，从床上挣扎起来说:“我的孟仁回来了……我看见他了……-”\n你被吓到，手里的灯掉到地下，火苗蹿起来，【姚长寿】把他的“日记”撕开（他从不让你看)，扔进火里，【贵叔】脚踩灭，大家都没有说话，只有【姚长寿】看着“烧坏的纸张”，不断喃喃自语:“我找到了……你休想抢走……”\n【陈均梦】哭起来，【贵叔】让【姚仲义】送她回去——你这时才回复平静，【贵叔】说今天累了，明天再来继续诊断。你安排他住进一楼客房。\n昨天(8月2日)晚上\n(21:30）你要准备好丈夫明天见【胡人玉】前服用的“镇静剂”，想起下午都一股脑拿去一楼旧屋。你去一楼旧屋找药，看见【陈均梦】闭着眼，正在摸索什么。你去拿药时，【陈均梦】摸到你的手，她问是谁，你没敢出声，拿起一个“写着‘安神’的药瓶”出去。\n(21:40）你去厨房，准备在丈夫的饮食里放药时，才发现拿的不是往常的\n“镇静剂”，但觉得“安神”的意思也差不多，就把药拿出来碾碎，放进一盘“太湖银鱼”(你的拿手菜)，药没有马上融化，你只能把盘子放下。\n(21:50）你再次走进一楼旧屋，想拿平时用的“镇静剂”，却没有找到。【陈均梦】身旁的桌子上只有贵叔调好的药剂。\n(22:00）你想找表姐问药和丈夫的病情，就上二楼找她。\n(22:10）你在二楼走廊上遇到表姐，向她询问丈夫的病情，表姐说:“我诊断姚长寿病情很麻烦，他受病毒侵蚀，导致皮肤异样，脉搏轻─—要杀死病毒,只能靠西医院的特效药,那药很猛,任何病毒都不在话下……就是价钱不便宜!”你开始犹豫，还要不要为丈夫继续花钱治疗。\n(22:20）侍女(不是陈安巧，她休息得早，你晚上从没找过她）来叫你，说【贵叔】在客厅等你。\n(22:30）你心里惦记丈夫的医疗费用，下楼后就去一楼主卧室，看着床上的【姚长寿】——他坐在床上，目光呆滞，皮肤皱皴，让你从心里厌恶。\n(22:40）你来到客厅见【贵叔】，他询问你【姚长寿】病倒前是否去过村北树林，你想起那天【姚长寿】一身黄土回来，不像去了树林，就回答没有。你这时决定不再给【姚长寿】花钱，卖地的银子也要自己留起来-—你对【贵叔】说明天早起【姚长寿】要见一位客人（胡人玉)，就先不麻烦他诊断了。\n(22:50）你说要给丈夫拿食物,去了厨房。\n(23:00）厨房里下过药的“太湖银鱼”不见了，你着急起来。\n(23:10）你想去二楼问侍女,在楼梯口捡到一个没见过的“木柄的长铁管”，你把它拿进主卧室时，窗外有东西坠地的声响。你感到害怕，去敲【姚仲义】的房门，没有人回应。这时你听到【贵叔】房里有人喊:“杀人偿命!”你敲【贵叔】的门，他在房里却没有开门，而是让你在外面等了一会儿才开门让你进屋。\n(23:30）你在【贵叔】房里嗅到有东西烧过的气味。你看【贵叔】脸上有伤，几乎要渗出血来，他的眼神游离不定。你问他去过厨房吗，他回答没有，然后他突然大声问你现在是几点?你吓了一跳，用手捂住嘴，发现自己脸很烫。你告诉他“子时二刻”(23:30）后，心有余悸地离开了。\n(23:40）大门外有东西坠地的声响——你走到玄关，心越跳越快——你不敢再移动脚步，蹲在地上，头脑里开始出现各种可怕的画面……\n(00:20）你遇到【胡人玉】，他问你这么晚在做什么，你指着大门口说刚才听到那里有声响,不敢出去看，怕是“不好的东西”…-….\n(00:30）【胡人玉】替你出去查看，外面有“碰”的声响。\n(00:40）【胡人玉】让你不要出来，说外面有蛇，过了一会儿他才让你出来看，你并不敢睁眼看，就闭着眼睛探出头来，又马上躲回去。\n(00:50）【胡人玉】送你回房休息，【姚长寿】在床上瞪着你胡言乱语:“孟仁说他知道宝贝，你去叫他来……”你担心【胡人玉】会跟【姚长寿】说土地的事，赶紧让【胡人玉】回房休息,说“交易”等明天再说。\n(01:10）你感到非常疲惫，上床后却无法入眠，你心里总是七上八下，甚至觉得窗户外面有人……你不知道这样折腾了多久，才终于睡着。",
    "Relationship": "1、姚孟仁:【姚长寿】的长子，大太太所生，他去世前反对你嫁给他父亲。\n2、姚仲义:【姚长寿】的次子，他在【姚孟仁】死后才回到家里，你们的关系并不好，很少说话或过问彼此的事情。他的生母是大太太的婢妾，也已经去世。\n3、姚长寿:你的丈夫，“百里村”的大地主。你今天起床后，看他今天仍然神智不清,无法交流，就让他留在床上休息。\n4、陈均梦:【姚孟仁】的遗孀，【姚孟仁】死的那天，她一早回了娘家。\n5、方医生:你的表姐，是上海“闸北西医院”的女西医，被你请来给丈夫诊断，她开的西药都价格不菲。\n6、朱迪:【姚】家的亲戚，给洋人做买办，帮你找来土地的买家。\n7、范金魁:你曾经的未婚夫，1900年时死在村北树林里，他下巴的胡子里有几根黄毛，你当时非常害怕，没敢仔细看尸体已经腐烂的脸……\n8、陈安巧:陈均梦的陪嫁女仆，留在大宅工作。比起其他侍女，你更信任她。\n9、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、卖土地是【姚长寿】的主意，他现在的药费非常昂贵——你告诉大家，你的丈夫虽然年纪比你大，但一直爱慕你，对你非常好。你一直花好多好多钱买药给他治病，因此需要卖地——来买地的【胡人玉】都没有还价。\n2、每间客房的钥匙除给客人的一把外（你安排人住宿时都给了他们房间钥匙),主卧室里还有一套“备用钥匙”的，今天早起不见了。\n3、你也没见过“枪”，非常怕死人，不敢说“尸体”和“鬼”，你称它们是“不好的东西”，你听这些会表现出恐惧——你绝不会“调查”尸体或现场的情况。4、“百里村”虽不比大城市，但村里有不少做车夫的，他们在天黑前都会工作，接送客人往返苏州或上海。\n4、你记得表姐当年有过恋人，不知道她为什么至今未婚。",
    "Purpose": "1、找出真凶。\n2、不让别人指认你是真凶。\n3、隐瞒你打算利用“镇静剂”骗丈夫卖地，并把卖地的钱私吞。\n4、找出【姚仲义】请【虞医师】来的真实目的和他们隐瞒的事情。\n5、找出【范金魁】当年死亡的真相。",
    "Ability": ""
  },
  "胡人玉": {
    "Story": "胡人玉\n男。三十岁上下年纪。浓眉宽肩膀，唇上蓄着浓须，一直延展到两鬓，下巴剃得光净。\n你并不叫【胡人玉】，你其实是被通缉的江洋大盗“金胡子”，你的本名【范金魁】更少有人知。\n十多年前（1900年)，你住在故乡“百里村”，你的未婚妻【田红娇】家里经营“翡翠居”(酒馆）——村里人都称她“卖酒阿红”，她很会跟客人打交道——村里有个叫【姚长寿】好色之徒，仗着给富商工作，不顾年纪和家里己有一妻一妾，跑去“翡翠居”骚扰她。【姚长寿】很快就因为无耻被【田红娇】打了,然后他带着几个人堵在酒馆外。你把【姚长寿】赶走(你要干架,没想到他们只是虚张声势)，【田红娇】从酒馆里小心翼翼地探出头，问你“外面怎么啦?”你看她马上躲回去的样子，觉得可爱极了。\n【田红娇】介绍你给【方乘山】（他是田红娇的姨父，也是附近别墅的“杜老总管”的助手）工作，你带好兄弟【李宽生】和【李广生】一起赚钱，【方乘山】安排你们在村后面的“白霜亭”下挖掘——你这时才知道“百里村”地下有隧道。雇主要在隧道尽头的侧面挖出来一个巨大空洞，每挖出一些空间，【杜老总管】和【方乘山】就让你们夜里搬进去一些货物。\n你们即将完工时，【方乘山】带一个名叫的【虞北辰】的外来人参观工程。【虞北辰】夺下你的工具，说空洞现在非常危险，让你们赶紧离开。你和他争执起来，拉着他和【方乘山】去找【杜老总管】。“李家兄弟”留下继续工作——空洞这时突然发生坍塌，等人们赶去救援时，一切都已经晚了，空洞连同里面的人和物都被土石掩埋了…….\n【杜老总管】利用关系把事故隐瞒——你非常愤怒，揣着刀和“李家兄弟”的“牌位”偷偷去了附近的别墅。你在书房里遇到【杜老总管】，他小心地举着火烛，手里握着一小包东西。你跳出来，拔刀要挟他，让他还一个公道!\n【杜老总管】吓坏了，他把小包东西和火烛都放到地上。你拉他出来，他突然转身逃跑，大喊“有贼!”你慌忙赶紧逃走。【杜老总管】跑回书房，那里突然发爆炸，地面颤动,仿佛地震一般。\n你知道闯下大祸，不敢回家，躲进村北树林，靠野果充饥，直到你遇见三个人——你怕他们是来追捕你的，就藏起来观察。三个人发生争执，一个人要把一张纸撕碎,被另外两人阻止,他只来得及撕成两半就被杀死—一死者是【方乘山】,杀人凶手中有一个是【姚长寿】，另一个你不认识。他们行凶后，又争执许久，最后把撕开的纸各拿走一张，还面对面发了毒誓，约成儿女亲家。\n你等他们离开，用刀毁了【方乘山】的脸，再把衣服和他交换，你还在他身上找到一个“法蓝饰物”(你很喜欢，就戴在身上，兄弟的“牌位”你也舍不得扔掉）——你相信所有见到尸体的人都会认为【范金魁】已经死了。\n你逃去苏州，混迹在乞儿中，过了几年不堪的日子。一年冬天很冷，你躲在一户人家门外，一个小女孩独自出来，她脖子上戴着一个“黄金长生锁”，你动了歹心，假装过去乞讨，准备抢走东西。\n小女孩看见你，掏出一锭银子，放到你手里，说她娘告诉她，要帮助有困难的人。你的心一下子热起来，暗自发誓，将来一定要百倍、千倍地报答她。\n这家走出一个大人，叫小女孩回去后又出来，让你把银子还给他，还骂你卑鄙无耻，骗小孩的钱!你忍着怒火，把银子放到地上，趁他弯腰去捡时，抄起一块青砖狠狠砸在他头上，一下，又一下……你看到鲜血染红青砖，心里有一种说不出的畅快。你还从尸体上搜刮出几枚铜钱和“撕开的地图(上)”，你看图上有【方乘山】的“签名”，就留在身边。\n此后你做了土匪，因为骁勇机警，做事果断，“案底”和手下都不断增加。因为你胡子里有几根黄毛，得了绰号“金胡子”——“金胡子”纵横江南，无能的前清衙门只会贴出悬赏布告，却拿你无可奈何。\n如今时入民国，去年（1913年）南京“讨袁”，江南烽烟四起，你想趁机从“匪”转“官”——要带起部队，首先需要枪支——你听说一个绰号“白头蛇”的人去年趁战乱从上海的“江南制造局”偷运出一批军火，正在寻觅买家。你去上海找到“白头蛇”谈好价钱，他要求你去“百里村”交易——你立刻警觉起来——莫非他察觉到你的出身来历?\n你请“白头蛇”去酒楼，不断劝饮，推心置腹，甚至把“撕开的地图(上)”当信物给他（你骗他说这是藏宝图)，终于试探出他选择“百里村”是因为有“内应”在村里的【姚】家——你这才松了一口气。\n你回去准备好“二百两黄金”的货款，却联系不到“白头蛇”——你怕有人也在打这批军火的主意，决定去“百里村”找他的“内应”直接交易——为了避免引人注意，你让手下三天后再来跟你汇合。",
    "Script": "昨天（8月2日）下午\n你乔装一番后回到“百里村”，先带着“李家兄弟”的“牌位”去村北祭奠，然后在“翡翠居”里得知未婚妻【田红娇】居然嫁给了【姚长寿】——你一时气愤，摔碎了酒碗——你在酒馆还打听到【姚】家要出售一块土地，就打算借这个理由进入【姚】家，寻找“内应”。\n你自称【胡人玉】，女仆带你去一楼客厅见到【田红娇】——她现在被称作【红夫人】。待售土地是村北树林，你随口答应她开出的价格——眼前的女人本该是你的妻子，现在却称【姚长寿】为夫君，你看她此时虽然艳妆打扮，却难掩疲惫之色。\n这时一个抱着外衣的男人进来，他身上有刺鼻的味道。男人跟你打招呼，你客气回应，然后他跟【田红娇】低声说话。男人离开后，【田红娇】安排你去二楼客房住下，还给了你客房钥匙，她说等【姚长寿】休息好再当面确定“交易”——你对土地不关心，去客房休息时，思考如何让“内应”来找你。\n昨天（8月2日）晚上\n(22:10）你听见门外有声音，就打开一道门缝，看见【田红娇】在你左边隔壁的客房门前与人说话。你在客房里，隐约听到一个女人说:“……姚长寿……麻烦……杀死……西医院……-不在话下……价钱不便宜!”\n(22:20）有人叫走【田红娇】\n(22:30）窗外传来“砰”的声响，你马上警觉起来，从行李中摸出一把“手枪”(你的爱枪——马牌搀子)。\n(23:00）窗外又传来“砰”的声响，比刚才听到的更清晰。\n(23:10）你打开窗户，听见阳台方向有人说话。你离开客房，在右楼梯前的拐角探身，看见一个头戴“黑爵士帽”，用“白围巾”挡住面容，在大晚上仍\n戴着“墨镜”的【神秘人】，被一个男人推到阳台的“栏杆”上面。你退回拐角，靠在身后客房的门上，心想他们中会不会有你要找的“内应”。然后你听到东西坠地的声响。\n(23:20）你刚要探身再看，发觉身后的客房里的人推门，就立刻回房。\n(23:40）你想去看看【田红娇】问问她的近况。\n(23:50）你来到一楼，看见一个【长发姑娘】在一楼旧屋门口，她扶着走廊的墙壁，脖子上戴着一个“黄金长生锁”，正是你当年发誓要报答“小女孩”。你发现她眼睛看不见，赶紧过去扶住她。她突然问:“是你吗?”你想都没想就回答:“是我，我这些年一直都没忘了你——苏州女孩……当年我在苏州见到你时，你就带着这个‘长生锁’……”你话还没说完，她的眼泪就流下来，你立刻说:“谁要欺负你，我就要他的命!”你说完扶她进入一楼旧屋，送她坐回床上。\n(00:00）你听到走廊上有人走动，立刻躲到窗帘后。一个【白净青年】进来，他小声地和【长发姑娘】说话，你只听到“……他已经死了一─我亲眼看见了!”然后【白净青年】跑了出去。\n(00:10）你后悔刚才的冲动——你来这里是有“目的”的，报恩的事可以等事成后再说。你冷静下来后，悄悄走出去，没惊动【长发姑娘】。\n(00:20）客厅方向有光，你过去看见【田红娇】蹲在玄关，她神情惊恐，汗水渗透了她的衣服。你问她这么晚在做什么，她指着大门口说刚才听到那里有声响，不敢出去看，她怕是“不好的东西”——你知道她很怕“鬼”，把“害怕的事物”叫做“不好的东西”。你暗中掏出“手枪”，走出大门查看。\n(00:30）门外是一具尸体一一你虽然惊讶，也并不意外——看来不止你一个人抱着其他目的，或许有人盯上了你的军火。这时一样东西从上面掉下来，你立刻开枪，才看见掉下来的是一条染血的“白围巾”。【田红娇】在宅子里问你“外面怎么啦”时，让你想起以前的时光。\n(00:40）你让她不要出来，说外面有蛇，然后你用“白围巾”把尸体拉到东边的窗户底下，再让【田红娇】出来看—一你看她小心翼翼地探出头，又马上躲回去的样子和当年一模一样。\n(00:50）你送【田红娇】回房休息，看见她丈夫【姚长寿】躺在床上，衰老丑陋，一副半死不活的样子——你正要试探她“内应”的事，【姚长寿】突然瞪着【田红娇】说:“孟仁说他知道宝贝，你去叫他来……”【田红娇】的脸色一下子就变了，让你回房休息,说“交易”等明天再说。\n(01:00）你回到二楼房里,合眼休息,直到天亮。\n今天（8月3日）早上\n【姚】家早起就已经一片大乱——尸体被发现了——首先发现尸体的【短发女人】说昨晚没有离开村子的马车，真凶一定还藏身在这里……-\n你来到客厅，看见大家都在，心想只要找到“内应”，完成“交易”，等再过一天，你的手下就会来“百里村”迎接你了。",
    "Relationship": "1、田红娇:你曾经的未婚妻，现在是【姚长寿】的继室，被称作【红夫人】。\n2、杜辉信:“百里村”附近别墅的【杜老总管】，死在你闯入导致的爆炸里。\n3、姚长寿:“百里村”的大地主，他曾给富商工作，为人好色，你亲眼目睹他和另一个人一起谋杀了【方乘山】(田红娇的姨父)。\n4、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、你从苏州来，是当地著名商号“法朗商行”的经理，公司老板【陈轻梧】正在物色一块附近有居民的土地，准备开办工厂。\n2、如今世道不太平，去年(1913年)“讨袁”革命军进攻上海的“江南制造局”失利后，有人从那里偷运出一批军火（你借此试探“内应”的反应)。\n3、【陈老板】的“法朗商行”正受到来自山西太原的“廖氏商行”威胁，“廖氏商行”的老板【廖一乔】来苏州开设洋务工厂，挖走不少“法朗商行”的人，因此你对开办工厂的土地势在必得(你解释为什么不讲价)。\n4、你听说十多年前“百里村”后的树林里曾发现过死人。\n5、如果有人对【田红娇】表现出敌意，你会帮她说话。\n6、如果有人对当年的“苏州小女孩”表现出敌意，你会帮她说话。",
    "Purpose": "1、找出真凶。\n2、不让别人指认你是真凶。\n3、隐瞒你是被通缉的“金胡子”以及你是诈死逃生的【范金魁】。\n4、找到“内应”和军火的下落。",
    "Ability": "你能辨认出以下“标识”的枪械的型号和子弹口径\n1、【*】(勃朗宁M1903，美国产）9mm手枪子弹。你的“马牌橹子”。\n2、【◆】(江南制造局产，中国自行设计制造的第一种连发枪）8mm步枪子弹。\n3、【◎】(标有“试制”字样）8mm步枪子弹。\n4、【★】(标有“试制”字样，毛瑟枪外观，特制子弹）8mm手枪子弹。"
  },
  "虞医师": {
    "Story": "虞医师\n男。年纪二十出头，目测身高一米七三。头戴鸭舌帽，身穿各自外套，配一条呢子长裤。\n你并不是真正的“医师”。你名叫【虞君鸿】，来自京城，你的父亲【虞北辰】，是一名留英的地质学者（在戊戌年，他放弃科考，改学地质)。你母亲姓【任】,是京城里行医习武的世家。你小时候和母亲住在外公家，直到你外公（任仲远)被聘请去太原做管家，你才和母亲陪在父亲身边，又因为工作经常搬家，过年时才去和外公团聚几天——受他们熏陶，你对各地风俗、药物这些，都略知一二，你从小跟外公学的武术，也一直在练习。\n你少年时（1900年）跟父亲去过一座上海郊外的别墅，别墅主人【孟深】,是一位化学家，也是你父亲的朋友。你父亲常帮他找试验原料（如硫磺、硝石、煤矿等)。有一次，你父亲找到一批特殊的“荧石”，经过加工后，把成品存到别墅附近的“百里村”。你在那里结识了【姚仲义】，他和你同年，他的父亲【姚长寿】为【孟深】负责“百里村”的地租工作，全家住在大宅里。\n负责接待你父亲的人是【孟】家【杜老总管】的助手【方乘山】。一天，你看见他和你父亲被一个姓【范】的工头拉回大宅，嚷嚷着要找【杜老总管】，然后有人跑进来说:后面出事了，“李家兄弟”都没跑出来……【方乘山】的女儿照看你和其他孩子，大人们一起出去……你父亲回来后，神情沉重。\n1903年【姚仲义】来京城读书，寄住在你家﹐和你好似兄弟一般。三年前(1911年)，他因兄长去世回去奔丧，你们再没见过，只有书信往来不绝。\n大约半个月前，【姚仲义】在来信里提及他家有一件“怪事”，请你去苏州找他。你对“怪事”充满好奇，又跟好友多年不见，收好“信”后马上南下，开始一场意想不到的惊险之旅。\n你到苏州住进“临池客栈”，给【姚仲义】发了电报，等他来见面。",
    "Script": "昨天（8月2日）下午\n【姚仲义】赶过来接你，你们乘马车前往“百里村”，在路上聊着天南地北的故事，从清末一直说到民国，却始终不提那件“怪事”——你终于忍不住问起来，刚才还眉飞色舞的【姚仲义】，马上失去笑容，他说:“我给虞兄写信时，确实想请虞兄来一探‘怪事’究竟——没想到这原来是一场‘诅咒’……我眼下有一个不情之请，虞兄一定要答应!”\n原来【姚仲义】的父亲【姚长寿】现在是村里的大地主，他不久前突然病倒，由继室【红夫人】高价聘请一位西医来家治疗。【姚仲义】想请你扮演一位留洋归来的“医师”，由他请来，借看病为名，避开外人，私下向【姚长寿】问一件事。你看他说的严肃，马上问他是一件什么事?\n“我大哥姚孟仁当年是怎么死的!”他说这话时，攥住双拳。\n马车这时已经到了目的地——【姚】家大宅(一幢有露台的洋楼)位于村北，背靠一片树林——那里正是你当年和【姚仲义】认识的地方。\n【姚仲义】带你去二楼的客房（有露台的客房，露台间的围栏不高)，给了你房间钥匙。你安置好行李后，来到一楼客厅，见到宅子现在的女主人【红夫人】(她和一个医生打扮的女人正在说话,你们进来后,医生打扮的女人就告辞离开)——【姚仲义】把你按计划介绍时，【红夫人】表现出的热情让你有些意外。\n一位带着行李的【短发女人】来到大厅，她年纪二十出头，身穿浅色麂子皮衣，长裤皮靴，还拿着一个用“青布”缠绕的长包裹。她说要找【徐伯清】。【姚仲义】马上起身，带她上二楼。【红夫人】皱起眉头，对你说:“虞医师远来，请先休息一晚，明天再给夫君诊断吧。”\n你仍惦记“怪事”，想出去打听。【红夫人】表情缓和下来，告诉你村里有家酒馆“翡翠居”不错，年轻人应该去尝尝那里的“一日醉”，然后她告诫你，千万不要去村北树林，那里有“不好的东西”。\n你对美酒兴趣不大，却非常想知道“不好的东西”是什么，你离开宅子后，立刻去了那里——村北树林枝繁叶茂，你不敢贸然进入，直到你发现树上有刻的“记号”，你知道这是防止迷路的方法，就边寻找“记号”，边往深处走去。\n你走了一会儿，就发觉反常—--现在是八月初，树林里的温度比外面低很正常，但是周围的虫鸣却不知在什么时候消失了……寂静的树林里，似乎只剩下你一个“活物”。\n你走进树林深处。最后一棵刻着“记号”的树上挂着一个空的“木笼”，不远处是一片泛黄的土地，中间矗立着一座灰白色的二层洋馆，洋馆外生满藤萝，,正门被一把“大锁”(锁上有法蓝绘饰）牢牢锁住，扁形的锁孔已经绣痕斑斑，不知锁了多久。\n你走到洋馆东面，看见一座砖石修筑的坟茔，坟前的碑上刻着“姚家不肖子孟仁之墓”。这时洋馆二层传来声响。你爬上一棵大树，透过枝叶见到一位身穿白衣的【长发姑娘】怀抱一只白鸽，站在阳台上，她容貌秀美，面色却十分苍白，仿佛长年不见光照，脸上也没有任何妆容——你莫名地感到一阵寒意，不禁问自己:她是谁，为什么被锁在里面?\n你的余光注意到坟前的碑动了一下，你以为是眼花，仔细看去，那碑正缓缓地移动到一旁，一个“人影”(你没看清是谁）从地下走上来，仰头向天，碑又缓缓合上——你从不相信“白日遇鬼”，马上想到其中必有“机关”。\n“人影”离开后，你跑过去检查，看见碑下面果然有轨道，只是一时找不到开关。你把这些疑问都放在心里，准备回头向【姚仲义】——询问。\n你按原路返回时闻到一阵刺鼻的气味，回头就看见洋馆燃烧起来!你马上跑回去，大火已经把洋馆一层吞噬了，滚滚的黑烟张牙舞爪，伴随着难闻的气味。【长发姑娘】双眼紧闭，站在二层阳台的栏杆上面，摇摇欲坠，你刚要喊她，她就从上面摔了下来。\n你冲过去接她，并顺势抱着她倒在地下，两只手臂都受了伤，火辣辣地疼。火势这时越来越大，你顾不得擦伤和灼热，扶起【长发姑娘】，看她已经昏迷，你来不及救醒她，用一只胳膊扶住她，往树林外跑去。\n你没跑多远就感到一阵头晕，想到烟里有毒——你不敢停下，身后的火势无情，你只能咬牙坚持，用手捂住【长发姑娘】的口鼻，挟着她拼命往外跑，心想一定要把人救出去。终于你遇到一个【头发乱蓬的男人】，他一把扶住你，你才放心地闭上眼睛。\n你再次睁开眼睛，看见自己躺在客房床上,【姚仲义】和【头发乱蓬的男人】在帮你处理伤口—你身上的划伤都被处理消毒。【姚仲义】看你醒了，赶紧给你端来水，并向【头发乱蓬的男人】不断道谢。你喝完水后，又昏昏睡去。\n昨天(8月2日）晚上\n( ? :? )你在睡梦里听见“砰”的声音，但是身体却醒不过来。\n(23:00）你睁开眼睛，露台外的天色已经一片漆黑。“砰”的声音又一次响起，就像之前听到的一样——你确定不是梦里的事情。\n(23:10）你走出客房，看二楼的客房门都关着。你走到二楼阳台，见到一个头戴“黑爵士帽”，用“白围巾”挡住面容，在大晚上仍戴着“墨镜”的【神秘人】，他靠在阳台的“栏杆”上，地上有一条“青布”。\n你问他是谁?【神秘人】压低嗓子，隐藏原本的声音说:“小子，不要管闲事，回你屋去!”你借着月色仔细地打量他，却仍看不清长相。\n【神秘人】端起一把“快利步枪”，指着你说:“小子，你是不是活得不耐烦了?”你马上举起手来，趁他不备，一个箭步埋身上前，一掌切在他的手腕上，打掉“快利步枪”。你翻掌拍击他的胸口，【神秘人】向后摔倒，撞在阳台东边的“栏杆”上。你一脚踢飞“快利步枪”，捡起“青布”捆住他的双臂。他挣扎了几下，但是挣脱不开。没想到阳台的“栏杆”突然折了，掉到下面，多亏你拉住捆他的“青布”，才没让他摔下去。\n(23:20)【神秘人】惊魂未定，颤声对你说:“多……多谢!”你松开他，他马上躲开你，快步走了。你觉得双臂疼痛，就把“青布”挂在阳台上，活动一下四肢，好在没有大碍。\n(23:30）你回客房时，看见自己门口的地上有一盘放在托盘上的“太湖银鱼”，你想起自己没吃晚饭，就拿起来回房吃了。\n(23:40）你突然感到一阵困倦，就锁好门躺回到床上——你从来没像今天这样嗜睡过……你进入梦乡前,听到最后的声音是露台外面传来的东西坠地的声响……\n今天(8月3日）早上\n你被敲门声叫醒，看见露台上有一个“金属物件”(像一把手枪)。敲门的人是【姚仲义】，他带你去一楼客厅——原来是出了命案，发现尸体的【短发女人】说昨晚没有离开村子的马车，真凶一定还藏身在这里。",
    "Relationship": "1、姚仲义:【姚长寿】的次子，你的好友，他邀请你来，你现在有一肚子的事想问他——他和你一起长大，你知道他性格谦让，一直很尊敬他的大哥。\n2、姚孟仁:【姚长寿】的长子，【姚仲义】的大哥，三年前去世。【姚仲义】请你假扮【虞医师】向父亲【姚长寿】询问大哥当年去世的真相。\n3、姚长寿:“百里村”的大地主，你记得他曾为【孟】家工作。\n4、红夫人:【姚长寿】的继室,比【姚长寿】年轻很多。\n5、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、你是在外国留洋过的医师（编一些不被人怀疑的经历)。\n2、打听【姚长寿】的病情和病因，以及,【红夫人】打算如何给他请医治疗。\n3、你会为【姚仲义】辩护，你的好友绝不是杀人凶手!\n4、你在苏州听说上海有个绰号“白头蛇”的嫌疑犯被一个从山西调来办案的中尉就地正法，苏州也在严查私人携带枪支。\n5、你记得1901年，你父亲从【孟】家别墅回来，和母亲讲述经历时，你跑去偷听——父亲说【杜老总管】的儿子杀害了【孟深】，父亲猜他把【杜老总管】的死归罪于【孟深】的研究，但想不到……你当时被父亲发现，他让母亲送你回屋睡觉。",
    "Purpose": "1、找出真凶。\n2、不让别人指认你的好友【姚仲义】是真凶。\n3、找出洋馆失火的真相。\n4、找出你昨天（8月2日）嗜睡的真相。\n5、找出【姚仲义】所说的“怪事”的真相。\n6、找出【姚孟仁】当年死亡的真相。",
    "Ability": "你能辨认出以下药物的功能或用途\n1、“硼酸溶液”:无色澄明液体，消毒防腐药。用于皮肤、粘膜及伤口的消毒。长期反复应用，可能发生慢性中毒，其表现为乏力、厌食、皮疹、脱发等。\n2、“金霉素”:别名“氯四环素”。用于脓疱疮等化脓性皮肤病，也可用于治疗轻度小面积烧伤及溃疡面的感染。\n3、“硫磺”:别名“硫”。外观为淡黄色脆性结晶或粉末，不溶于水。性酸、温、有毒，归肾和大肠经。可防治病虫害，燃烧时发出青色火焰，产生二氧化硫。\n4、“鸦片”(Opium):俗称“大烟”。源于罂粟植物，含有吗啡，可用于麻醉。\n5、“桔梗花”:又叫铃铛花、僧冠帽。其味苦、辛，性平，归肺经。"
  },
  "贵叔": {
    "Story": "贵叔\n男。头发乱蓬，胡子邋遢。看不出具体年纪。身形枯瘦，套一件灰色长衫。\n“我是‘法蓝庄’的总管，人是我杀的……”你念叨这些话。多年以来，你不断重复当年的噩梦，悔恨的痛苦随时准备吞噬你，你只能靠药物暂时摆脱。\n你本名【杜贵成】，家里世代是“法蓝庄”主人(主人姓孟）的总管。你曾去上海学医，想和几个朋友做一番事业,没想到十多年前(1900年)，你父亲【杜辉信】意外死亡，你回“法蓝庄”接任总管，却在第二年（1901年）成了杀人凶手——你被逮捕时，已经有了妻子和儿女。\n你被关押在上海的十多年里，每天都想念妻儿，却再没见过他们——直到不久前，你用“刀”挟持人质，从关押的地方逃出来，在“囚服”外穿上长袍，去老朋友家拿了钱和一些药物(“安眠药”和“药用鸦片”，你被关押时染上对这类药物的依赖)，有人帮你联系到你的儿子，约你们去一个“老地方”见面。\n(8月1日）你知道警察在到处找你，就藏身在驴车里逃出城，颠簸半日后才停下，你从车上下来，来到了离约定地点不远的“百里村”——这里只有一条入村的路，村北有一幢有露台的洋楼，背靠一片树林——你记起“法蓝庄”主人【孟老爷】当初在“百里村”有不少土地，在苏州还有字号“法朗”的商行，他有一批重要的东西藏在“百里村”。你被关得太久，机械般重复的日子让你忘了很多事——你现在最想找出这些重要的东西——它们肯定很值钱,你亏欠妻儿太多，如果能在见面前准备一些补偿就太好了。\n你看这时天色不早，就去村里“翡翠居”(酒馆）租了一间屋子住下。",
    "Script": "昨天(8月2日)下午\n你早起去村里搜寻，走了大半日，在“白霜亭”外遇到一个吸烟的人，跟他要了一根“洋火”(你打算吸食“药用鸦片”时点燃用)，你这时记起藏东西的地方在村北树林中，就马上过去。\n树林枝繁叶茂，你往里面没走多远，就看见树林深处升起滚滚黑烟，还有火光，一只“白色的鸟”从黑烟里冲出来，没飞多远就栽倒在树林外。你对火光感到恐惧，就转身往外跑——有个【短发女人】拦住你，问你出了什么事?你此时更加紧张，一面支支吾吾地想编一个合理的解释，一边把手伸进口袋里摸药——你怕自己的毛病（药瘾）突然发作。\n你感到身后有人，马上回头，看见一个【年轻男人】，挟持一个【长发姑娘】(他用手捂住姑娘的嘴，在地上拖行）从树林里出来——他们马上要撞到你，你受不了这种压迫感，立刻扶住【年轻男人】，看见他已经昏倒——你感到威胁消失，才冷静下来。\n【短发女人】扶起【长发姑娘】，你看【长发姑娘】脸色苍白，双眼紧闭，看样子像是中毒昏迷。一个【白净青年】跑来——他自称【姚仲义】，是【姚】家二少爷，【年轻男人】是他请来的【虞医师】，昏迷的【长发姑娘】是他的嫂子【陈均梦】【短发女人】叫【云凌】。\n【姚仲义】扶起【虞医师】，问你们出了什么事——你注意到【虞医师】的胳膊有伤——你这时的情绪变得非常愧疚，就自称【贵叔】，懂一些医术，可以帮忙。【姚仲义】请【云凌】把【陈均梦】扶进大宅一楼的一间干净的卧室（一楼旧屋)，他把【虞医师】送去二楼。\n你遇到大宅的女主人【红夫人】，她拿来药物，陪你一起去一楼旧屋。\n你给【陈均梦】诊断时，她悄悄醒来，但什么都没说。你告诉她，她的眼睛因熏染“硫类毒素”开始畏光、流泪，并出现“中毒性视功能障碍”，还有一些烧伤，但只要治疗及时，不会有后遗症(红夫人拿来的药里有“硼酸溶液”和“金霉素”——它们价格不昂贵，效果不错，此外你注意到还有一瓶“镇静剂”)。你调和药剂时，发觉容器不够，就掏出“写着‘安神’的药瓶”(装着你从老朋友家拿出来的安眠药)，用瓶盖调药，调好后看剩下的“硼酸溶液”和“金霉素”不多，就随手扔了。\n你帮【陈均梦】敷完药（你用安眠药瓶盖装调好的药，把没盖子的安眠药也留下来了)，叮嘱她过一个小时换药，几天不睁眼就没事了。【红夫人】称赞你的医术，请你一定要留下来，她丈夫现在卧病在床，希望你能去诊断一下。你对自己仍能救治人多少有些意外，这减轻了你内心的痛苦。你说先上楼看一下【虞医师】的情况，就去给她丈夫出诊。\n你拿着那瓶“镇静剂”上楼去看【虞医师】，他在你给他清理胳膊上的伤口时醒了，【姚仲义】给他端水，又不住地谢谢你，你悄悄把“镇静剂”掺入水里给【虞医师】喝下（虞医师给你危险的感觉，你一看他的脸就觉得很不安心)，看他沉沉睡去后，你向【姚仲义】说了【陈均梦】的情况。\n天黑时，【红夫人】带你去一楼主卧室，见到【姚】家的男主人【姚长寿】。【红夫人】帮你举灯，你看见【姚长寿】模样衰老，精神萎靡，肤色上出现“黄疸”，眼球的颜色也不正常。这时【姚仲义】扶着【陈均梦】进来,【姚长寿】突然激动，从床上挣扎起来说:“我的孟仁回来了……我看见他了……”\n【红夫人】手里的灯掉到地下，火苗蹿起来，【姚长寿】把他的手边的一个“手写的册子”撕开，扔进火里，你赶紧踩灭火。大家都没有说话，只有【姚长寿】盯着“烧坏的纸张”，喃喃自语:“我找到了……你休想抢走……”\n【陈均梦】哭了起来，你让【姚仲义】送她回去，记得今晚再换一次药，你本想问一下【姚长寿】生病的原因，却感到一阵疲劳（你觉得药瘾快发作了)，说明天继续诊断。【红夫人】安排你住进一楼客房，给了你房间钥匙。\n昨天(8月2日)晚上\n(22:00)你觉得【姚长寿】的病情和【陈均梦】相似，都是由“化学毒素”引起。你想确认【姚长寿】发病前,去过什么地方。\n(22:10)你让一位侍女去请【红夫人】，你去客厅等她。\n(22:40)【红夫人】来到客厅，你询问【姚长寿】病倒前是否去过村北树林?她说没有（红夫人回答前似乎在考虑什么)，然后【红夫人】一改之前的口吻，说明天早起【姚长寿】要见一位客人，就不麻烦你诊断了。\n(22:50)你感到奇怪，【红夫人】说去给丈夫拿食物，离开客厅。\n(23:00)你回到房里，感到疲劳，药物依赖让你非常难受。你脱下“囚服”，点燃“药用鸦片”吸食，陷入难言的安逸之中。\n( ? : ? )你无比放松，行为开始不受控制，缠绕在心头的往事也随之重现，你当初就是喊着“杀人偿命!”把对方杀死—你被囚禁的日子里，忘记了很多事，但始终记得杀人的那天……鲜血染红你的手，尸体在你面前倒下……\n( ? : ? )一阵敲门声把你惊醒，你让外面的人等一下，然后使劲拍打自己的脸，才恢复了一些知觉和理性。\n( ? : ? )你打开门看见【红夫人】，请她进屋。她问你去过厨房吗?你回答没有，然后你问她现在是几点?她说大概是“子时二刻”(23:30)，你才知道自己失神了好一会儿。【红夫人】离开后，你关上门。\n(00:40)你基本恢复了常态,打开窗户想透气时，见到窗外有一个死人!你看着手，仿佛昔日的血又再度染红它们，你非常恐慌，甚至想马上逃走。\n(01:00)你打开房门，看走廊上没有人，就悄悄走出大宅，来到自己房的窗外，借着月色，看见尸体挂着一条染血的“白围巾”。你无论如何都不能让尸体在自己窗外被发现——明天你就能见到亲生儿子了，你不能被怀疑——更何况你现在还是逃亡之身。\n(01:10)你用“白围巾”把尸体拖起，想扔到村北树林里，你刚拉到最东边的窗户底下(一楼主卧室窗外)，就听一个女人的声音问:“是你吗?”你赶紧抛下尸体跑回宅子。\n(01:20)你回房饮下“镇静剂”，借药力恢复平静，安心睡去……\n今天(8月3日)\n在梦里你看见儿子近在咫尺，却摸不到他，他的眼神陌生又可怕……指着你说“杀人凶手”……你从床上惊醒，才想起已经逃离了关押的地方……\n你来到客厅，看见很多人——尸体被发现了——首先发现尸体的【云凌】说昨晚没有离开村子的马车，真凶一定还藏身在这里……你必须熬过这一关，赶去“老地方”和亲生骨肉见面，你想到这里，心里涌起一股勇气。",
    "Relationship": "1、杜辉信:你的父亲，曾是“百里村”附近的“法蓝庄”的【杜老总管】，替【孟老爷】(“法蓝庄”主人，一位化学家）运一批东西藏进“百里村”，1900年因事故死在“法蓝庄”里。他生前最器重的助手【方乘山】在此后失踪。\n2、姚仲义:【姚长寿】的次子。\n3、姚长寿:“百里村”的大地主，他因“硫类毒素”引发病症。在你的记忆里，他居住的大宅、村北树林，还有苏州的“法朗商行”都是【孟】家的产业。\n4、红夫人:【姚长寿】的太太。\n5、虞医师:你看到他的脸就觉得不安。\n6、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、打听【姚长寿】的得病前去过哪里。\n2、你学医时，有一个姓【宋】的同学（宋笃诚)，实习时遇到过【姚长寿】这样的病症，他用“硼酸溶液”和“金霉素”来治疗，被老师骂了，但他仍坚持这样——你听说他现在去了上海的“闸北西医院”做医生。\n3、你年轻时，有一段时间非常反感父亲，你不接受家里的安排，为此和父亲产生嫌隙———你那时总想出去闯荡，甚至想靠学医来救国兴邦。\n4、你父亲【杜辉信】在去世前，曾找当官的朋友把一次塌方事故当作“意外”处理,你后来偶然听说塌方闹出人命……当时你父亲为【孟老爷】工作,此外【孟】家（法朗商行）在苏州的生意由【陈轻梧】照管，“百里村”的地租交由【姚长寿】收管。",
    "Purpose": "1、找出真凶。\n2、不让别人指认你是真凶。\n3、不让别人发现你是逃出来的。\n4、隐瞒你有药物依赖的情况（你吸食鸦片)。\n5、找出【孟】家在“百里村”藏的东西。\n6、找出【姚长寿】染病的原因。",
    "Ability": "你能辨认出以下药物的功能或用途\n1、“硼酸溶液”:无色澄明液体，消毒防腐药。用于皮肤、粘膜及伤口的消毒。长期反复应用，可能发生慢性中毒，其表现为乏力、厌食、皮疹、脱发等——硼酸虽然有毒,但稀释后可以洗眼消肿。\n2、“金霉素”:别名“氯四环素”。用于脓疱疮等化脓性皮肤病，也可用于治疗轻度小面积烧伤及溃疡面的感染。\n3、“硫磺”:别名“硫”。外观为淡黄色脆性结晶或粉末，不溶于水。可防治病虫害，燃烧时发出青色火焰，产生二氧化硫。\n4、“鸦片”(Opium):俗称“大烟”。源于罂粟植物，含有吗啡，可用于麻醉。\n5、“东莨菪碱”一种莨菪烷型生物碱。病人摄入含有这种成分的麻醉药剂后，会进入一种特殊的“镇静状态”，在无意识状态下能准确地回答问题。但对于精神病患者无效——因为精神病患者出现的幻听幻视和虚构记忆，是大脑引起，他们自身对此深信不疑。"
  },
  "陈均梦": {
    "Story": "陈均梦\n女。二十一岁。容貌秀丽，长发过腰，面色苍白不见血色，双目禁闭。鬓带白色桔梗花，身穿白衣。\n你生在苏州，从小被许配给“百里村”大地主【姚】家的大少爷【姚孟仁】,三年前（1911年)，你被迎娶过门，做了新娘。\n你父亲【陈轻梧】和【姚孟仁】的父亲【姚长寿】都曾为“法朗商行”的大老板【孟老爷】工作，你父亲主要负责【孟】家在苏州的业务—-—两家在那时定下娃娃亲。你和【姚孟仁】小时候第一次见面，彼此都戴着一个“黄金长生锁”(你的长生锁上面刻着“孟”字)。后来【孟老爷】家出了事，你父亲接手“法朗商行”在苏州的全部产业。\n你父亲对金钱格外看重——你小时候把娘给你的压岁钱（一锭银子)，送给外面的乞丐（娘经常告诉你，要帮助有困难的人)，仆人【陈市田】说你父亲大发雷霆，让他马上去要回来。\n你出嫁时,父亲给你一个任务——他让你查出当年【孟老爷】藏在“百里村”的东西是什么，藏在哪里，【姚长寿】找到没有——这件事绝不能告诉别人，连你的丈夫和公公都要隐瞒。\n你丈夫【姚孟仁】虽然生长在“百里村”，但他非常欣赏外面的进步思潮，常跟你高谈阔论“平等”和“自由”——不过他始终放不下大少爷的架子，对待仆人都是随意呵斥。\n【姚长寿】那时娶了新妻子【红夫人】,【姚孟仁】为此和他大吵。【姚孟仁】常对你说他早受够这个被“诅咒”的地主之家，让他留在这里还不如让他去死!你不知道该怎么劝他,没想到这话很快应验……\n新娘和新郎在婚后按习俗要回娘家（回门)，【姚孟仁】让你先坐马车出发,由你从娘家带来的侍女【陈安巧】陪同，没想到你回苏州后一直等到夜深，他都没有出现。你等了几天仍不见人，父亲就让【陈安巧】送你回“百里村”，你这才知道丈夫竟在你回门那天去世了!\n村北树林深处（从树林外进入那里的路，只有姚家的人才知道)，有一片泛黄的土地，中间盖了一座灰白色的二层洋馆，洋馆外墙上布满青藤。【姚孟仁】的坟墓建在洋馆东面，用砖石修筑，坟前的碑上刻着“姚家不肖子孟仁之墓”。\n洋馆正门被特制锁孔（扁口）的“大锁”(锁上有残存的法蓝绘饰）牢牢锁住，【姚长寿】让人拆开洋馆后墙，安排你住进去守孝，每天派人送饭——你从此就住在里面——因为洋馆一层的地板常有怪味，你在二层起居。\n送饭的工作由【陈安巧】负责，她还给你带来一个“木笼”，里面装着一白一灰两只信鸽——你认出这是父亲养的，他让你安心住在洋馆，说这里很可能就是藏宝贝的地方!你要是有什么发现，就立刻给他写信，用信鸽送回苏州。\n你住下后不久就发现了洋馆的怪异之处，这里没有蚊虫，连潮气都很少，你把这些都写下来，放飞信鸽送给父亲。父亲收到信后，把信鸽装进“木笼”，由【陈安巧】给你带进来，有时她把“木笼”挂在洋馆外的树上，你取回信鸽后留下空的“木笼”等她拿走。\n大约半个月前的一天晚上，你听到一层有动静，就提灯去看，见到有人在地板上到处摸索，你拿灯照亮时，他想逃走，却一脚踩在一块腐烂的木板上摔了下去，震起很多地板下的尘土，味道呛鼻。你捂住鼻子，看那人从坑里爬出来跑掉……你想把这事写信告诉父亲，却看见房里的“木笼”已经空了(你上午把信鸽都放飞了，忘记把空的“木笼”挂回到树林里)。\n你拿着“空木笼”出去，听见树林里传来小孩的惊叫声，你跑过去，见到一个顽童躲在树下，几条毒蛇正冲着他抬头吐信，你赶紧捡起一只树权过去驱赶毒蛇。毒蛇立刻四散，顽童看见你，反而没命地跑了…….\n你不知所措，提着“空木笼”回到洋馆门前，遇到【姚仲义】—-你告诉他刚才的事——你不知道毒蛇逃走的缘故。【姚仲义】向你保证，他会把这事查一个水落石出。你看他的神态如此认真，不禁笑了起来。",
    "Script": "昨天(8月2日）下午\n你今天才从树林里取回“木笼”中的白鸽。你把“木笼”仍留在树林里简单记下遇到顽童那天晚上的事，系到白鸽腿上，去阳台放飞。\n你看着白鸽在空中盘旋，不禁羡慕起来——你现在也被困在笼里，要等为夫守孝期满，才能开始自己的人生……你算了一下时间，还剩下不到一年。\n阳台下传来刺鼻的气味,你低头看见洋馆一层烧了起来,滚滚黑烟张牙舞爪，青色的火焰不断向二层蹿上来。白鸽努力穿过黑烟，向树林外飞去……身后的房间里很快被火势吞没，黑烟熏得你只能闭上眼睛，努力往高处爬去-你感到一阵晕眩，脚下没有站稳，从高处摔了下去……你落到地面前，感到一双有力的臂膀接住了你，你还没来得及看清是谁，就失去了意识。\n你醒过来，眼前模模糊糊，好像是你和【姚孟仁】在【姚】家大宅里曾经的卧室（一楼旧屋)。你见到眼前有人，却看不清模样，他自称【贵叔】，正在给你诊断。你非常害怕。【贵叔】说你的眼睛因熏染“硫类毒素”开始畏光、流泪，并出现“中毒性视功能障碍”，还有一些烧伤，但只要治疗及时，不会有后遗症。\n然后他给你敷药（你并不知道是什么药)，叮嘱你过一个小时换药，这几天不要睁眼就没事了。你听他说的恳切，才稍稍放心。\n你听到一个女人称赞【贵叔】的医术，然后他们把你留在一片漆黑里，你如同往常一样忍耐着孤独。时间过了很久，才有人跟你说话，像是【姚仲义】的声音，你请他扶你去主卧室见公公【姚长寿】，行儿媳之礼。\n你们来到一楼主卧室，你还没说话，就听见一个衰老的声音说道:“我的孟仁回来了……我看见他了……”你大吃一惊，这时有东西摔落，地面发出响声,你听见急促的呼吸声，还有衰老的声音:“我找到了……你休想抢走……”\n你不知这是真是假，又不能亲眼确认，急得流出泪来，然后你听到【贵叔】的声音，他让人送你回去，记得今晚再换一次药。【姚仲义】扶你回房，给你换了药，你问他丈夫的事情，他回答是他父亲病得厉害，开始说胡话了。\n昨天（8月2日）晚上\n（？：？）代表你不知道是几点。以下事件均以时间顺序排列。\n（？：？）你不能入睡，不断幻想奇迹发生，丈夫会突然回来。你一边回忆你们短暂的新婚生活，一边从床上起来，不断摸索，想从床边的抽屉里找出“黄金长生锁”——你在丈夫去世后就把它收在这里。\n（？：？）你突然摸到一个女人的手，你马上问是谁，却没有人回答。你再摸时，手已经不在了，你从抽屉里摸出“黄金长生锁”。\n（？：？）你听见有人进来，在你附近寻找什么，你紧紧攥住“黄金长生锁”,直到听见人出去，才松了一口气—-你这时发现自己的听觉比往常灵敏。\n（？：？）你听到窗外有“碰”的声响，从西边楼上传来。\n（？：？）西边楼上有人喊“姚仲义”的名字。\n（？：？）窗外传来“碰碰”的声响，比上次听到的要长一些，但你却听不出声响来自楼上什么方向\n（？：？）有东西摔落到东边地下。\n（？：？）你听到大门外有东西坠地的声响，心里再次涌起恐惧，把“黄金长生锁”戴上，暗中祈祷后，小心地摸着屋子，想出去找人问问发生了什么——你无法看见，只能凭着感觉和记忆，慢慢摸索，花了很长时间才摸到门口。\n（？：？）你来到走廊上，心里盼着能有丈夫的消息，突然一双结实的手扶住了你，你抓住他衣服，不禁问他:“是你吗?”对方回答:“是我，我这些年一直都没忘了你——苏州女孩……当年我在苏州见到你时，你就带着这个‘长生锁’……”你听他的声音低哑而激动，想起小时候和丈夫在苏州第一次见面的情景，他叫你“苏州女孩”。你的鼻子一酸，眼泪又流了下来，他立刻说:“谁要欺负你，我就要他的命!”你在婚后和他相处的时间很短，但他说一不二的脾气却从来没有变——他说完就扶你回到屋里，送你坐回床上。\n（？：？）你听到有脚步声，他的声音随之消失。【姚仲义】的声音出现在耳边,他问你眼睛怎么样了。你问他屋里还有什么人吗?他回答没有——你不相信，对他说:“我遇到你大哥了……”【姚仲义】突然说:“不可能!他已经死了——我亲眼看见了!”话音刚落，就有人跑出去，周围似乎还有另一个人的呼吸，但没有其他声响，也没人再和你说话。\n（？：？）大门外有“碰”的声响。\n（？：？）你听到有人在大门外对话，其中有女人的声音。\n（？：？）你听到窗外有声音，你摸到窗旁，对外问:“是你吗?”然后有东西摔到东边，一阵脚步声跑向大门。此后外面一片寂静，你怀着不安，摘下饰物休息。\n今天（8月3日)早上\n【陈安巧】一早来帮你换药，扶你去客厅。突然有人说发现一具尸体——因为昨晚没有离开村子的马车，真凶一定还藏身在这里。你不知道丈夫现在是不是就在大厅里，但你的直觉告诉你，他一定已经回来了…….",
    "Relationship": "1、姚孟仁:你的丈夫，【姚长寿】的长子，三年前（1911年）染疾去世。\n2、姚仲义:【姚孟仁】的弟弟，和你丈夫不是一个母亲生的，你在丈夫死后才见到他，此前他被送去京城读书。\n3、姚长寿:你的公公，也是你父亲【陈轻梧】当年的同事（他们当初的老板姓孟)，现在是“百里村”的大地主。他昨晚突然说你丈夫回来了，你又惊又喜，但【姚仲义】说他已经得病，说的全是病中的胡话。\n4、红夫人:【姚长寿】的继室，你丈夫出殡的那天，她没有去送葬。\n5、陈安巧:【陈市田】的女儿，比你大，按血缘是你的堂姐。她跟你一起来到“互里村”，留在大宅做侍女，负责给你送饭，暗中传递消息和送信鸽。她的父亲【陈市田】在找乞丐要银子后，你就再没见过他（你听说他偷了你父亲的东西)。6、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、你现在“看不见”，不能去“调查”，只能靠“回忆”和交谈来找出真相。\n2、你的直觉告诉你，你的丈夫回来了（虽然你看不到）。",
    "Purpose": "1、找出真凶。\n2、找出【姚孟仁】的下落。\n3、找出你住的洋馆失火的真相。\n4、隐瞒你是带着父亲的“任务”嫁过来的。\n5、找出你现在“暂时失明”的原因。\n6、找齐你全部的回忆。",
    "Ability": "当你听到或见到以下的关键词（你自己不能说出）时，你可以获得记忆片段。记忆的内容不能给其他人阅读，可以转述或编造。相对的，你不能使用【线索调查】动作。\n【撕开的地图】\n【武昌】\n【桔梗花】\n【特制弹夹手枪】\n【隧道】\n【阳台的栏杆】"
  },
  "陈安巧": {
    "Story": "陈安巧\n女。二十出头。低眉垂目，神情恭谨。身穿宽袖印花上衣，粗布粉色长裤。\n你生于苏州，和【陈均梦】是同族的堂姊妹，但她的父亲【陈轻梧】很有本事，利用给富商工作的机会发财，后来还接手富商的生意，成了“法朗商行”的大老板。你不争气的父亲【陈市田】则因为好赌欠债，只能带你投奔亲戚，当了【陈轻梧】家的仆人。\n一年冬天,【陈市田】喝多了酒，把十来岁的你拉到身边，带着酒气告诉你，他发现了【陈轻梧】的秘密:“这家伙有一张藏宝图，被老子撞见，就顺手拿了出来，可惜只有半张……”你看父亲小心翼翼地掏出“撕开的地图(上)”，觉得就是一张涂鸦。\n这时你已经是堂妹【陈均梦】的侍女，她出院子玩，你远远看着，外面有一个乞丐，你没敢过去，堂妹却拿出一锭银子给了乞丐!你告诉了父亲。\n父亲先叫堂妹回宅，然后出来喊乞丐交还银子。乞丐并不愿意，你父亲骂他卑鄙无耻，骗小孩的钱!乞丐把银子放到地上，趁你父亲弯腰去捡时，抄起一块青砖狠狠砸在他头上，一下，又一下……鲜血染红青砖，父亲倒在地上。你被吓得缩在墙角，说不出话。乞丐从父亲尸体上搜刮出钱和“撕开的地图（上)”，扬长而去。\n凶手走了很久，你才大哭起来，父亲的血流了一地……官府来人验尸后，做了悬赏公文，你只记得那乞丐下巴的胡子里有几根黄毛，是个青年，但这些对追凶毫无帮助，堂妹也根本说不出那人的样貌。【陈轻梧】当天发了一顿脾气后，这事也就不了了之。\n三年前（1911年)，堂妹嫁给“百里村”大地主【姚长寿】的长子【姚孟仁】,他们是娃娃亲，你作为陪房侍女跟去【姚】家。【姚孟仁】在婚礼前，要求新娘戴上“桔梗花”和“文竹”，你不知道是什么风俗，堂妹都照办了。\n堂妹婚后回门，【姚孟仁】让你陪她先回苏州，没想到你们回去后一直等到夜深，他都没出现，过了几天仍不见人。【陈轻梧】让你赶紧送堂妹回“百里村”，他塞给你一些银钱，让你回去后，看见什么情况都要立刻坐马车回来通知他-你们都没料到，【姚孟仁】已经在回门那天去世了!\n【姚长寿】说【姚孟仁】得了会传染的急病，死后立刻收殓入棺。堂妹脱下红装换上孝衣，从新娘子成了未亡人。【姚孟仁】的弟弟【姚仲义】也从上学的地方赶回来奔丧。\n【姚长寿】把【姚孟仁】的尸骨葬在村北树林深处(从树林外进入那里的路，只有姚家的人才知道，你那时是第一次跟着去):树林中有一片泛黄的土地，地上盖了一座灰白色的二层洋馆，洋馆外墙上布满青藤。【姚孟仁】的坟墓建在洋馆东面，用砖石修筑，坟前的碑上刻着“姚家不肖子孟仁之墓”。\n洋馆正门被特制锁孔（扁型锁孔）的“大锁”(锁上有残存的法蓝绘饰）牢牢锁住，【姚长寿】让人拆开洋馆后墙，安排【陈均梦】住进去守孝，又让你负责每天送饭——你怕迷路，在树上刻了“记号”。\n你趁【姚】家忙乱，雇马车回苏州，把事情禀告给【陈轻梧】，他听完来回踱步，不断念叨“树林”，“洋馆”，“姓方的”，最后他给你拿来赏钱和一个“木笼”，里面有一白一灰两只信鸽。他让你把信鸽交给【陈均梦】，让她安心住在洋馆——这里很可能就是藏宝贝的地方!她要是有什么发现，就立刻给他写信，用信鸽送回苏州。你都照做了。\n【陈轻梧】收到信后，把信鸽装进其他“木笼”，由你找机会带进来，有时你把“木笼”挂在洋馆外的树上,【陈均梦】取回信鸽后留下空的“木笼”，你拿走后藏在房里。\n此后你开始了两重身份的生活。一是【姚】家大宅的侍女，因为谨慎本分，受到【姚长寿】继室【红夫人】的信任，另一个则是【陈轻梧】和【陈均梦】的联系人,往来于苏州和“百里村”，负责传递消息和送信鸽——因此你下午会悄悄乘马车离开“百里村”。\n你不甘心这样的生活，你很羡慕【红夫人】,这时你知道二少爷【姚仲义】和去世的大少爷【姚孟仁】不是一个母亲生的，他的亲生母亲是大太太的陪嫁婢女，和你的身份一样。\n你从此有了一个大胆的想法,【红夫人】和【姚长寿】成亲后，并没有怀孕，【姚】家现在的继承人只剩下【姚仲义】,你虽然和他并不门当户对，但现在已经是民国了,只要他愿意娶你,你也能和【红夫人】一样。\n你唯一的烦恼是苦于没有机会。你常跟踪【姚仲义】,想找没人的时候和他说话，但他总是一个人去树林——你恰恰不能被他看到你在树林里做的事!\n你那时发现【姚长寿】每天晚上都会去树林里,你跟踪他，发现他去了洋馆外的坟墓,你非常害怕,赶紧跑回来。\n大约半个月前，你去树林回收，却没有看见“空木笼”(有时陈均梦会忘记把“空木笼”挂出来)，你只能晚上再去一次。你晚上在树林见到【姚长寿】，他从后面进了洋馆——你知道洋馆里这时只有【陈均梦】在。\n你在树林里等待，不久【姚长寿】跑出来，月光照在他的身上，竟然有些荧光。你不敢出声,看他跑进树林,突然响起小孩的惊叫声,你看到【陈均梦】拿着“空木笼”出来,【姚长寿】躲进树丛。\n你拿灯给【陈均梦】打信号,想不到【姚长寿】就在她身后，他已经看见了你，甚至想来抓你——好在这时小孩跑了，树林里有其他人说话的声响——【姚仲义】出现在树林里,你赶紧掐灭了烛火。\n你离开树林,还没回到大宅，就被【姚长寿】一把拉住。他浑身黄土，面目狰狞，让你发誓绝不能把今晚看到的说出去,否则他就让你永远留在树林里……你当时答应，想等天亮就逃回苏州,没想到第二天【姚长寿】突然病倒,【红夫人】请一位女西医【方医生】给他看病，你见到吃完药的【姚长寿】一动不动地坐在床上,连话都说不清楚,才放心留下来。\n你回苏州时没把这些事告诉【陈轻梧】,而是跟他讨要赏钱——你现在确信父亲死前说的“藏宝图”是真的，【陈轻梧】和【姚长寿】都在寻找——你要比他们都更早拿到!",
    "Script": "昨天（8月2日）下午\n你从苏州赶回来,看见【红夫人】和【方医生】在客厅聊天,就趁机去一楼主卧室，看【姚长寿】在睡觉，你翻找他的东西，从他的一本记录里,看到一张“撕开的地图(下)”，你非常欣喜，没想到这时【姚长寿】醒了，你赶紧放下东西,躲到装药的柜子后。\n这时你听到有人进来,还过来拿药，然后这人用很低的声音问【姚长寿】宝贝的事（女人的声音)——你只能听见【姚长寿】断断续续地提到“秘密”“失踪”。【姚长寿】激动起来:“你为什么要问他，你是谁?为什么要问他!”\n这时有人推门，你偷偷看去，见到一个头戴“黑爵士帽”，用“白围巾”挡住面容，还戴了一副“墨镜”的【神秘人】，却没看见说话的女人。【神秘人】走到【姚长寿】床前，【姚长寿】指着【神秘人】还没说话，就被【神秘人】捂住了嘴。\n你赶紧缩回头，听【神秘人】说:“你想不到我会回来吧……当初不可一世的姚长寿如今只能在床上苟延残喘，多可笑啊——我当初劝你，那些宝贝本来就是胡说八道，你，还有姓陈的，你们密谋的结果还不是一无所得……你已经得到这么多的土地,就该老老实实地安度晚年——年轻的妻子不错啊——你我的追求不同,我自有目标,不然早回来了……我其实知道宝贝是什么了——这对你来说，已经毫无用处了。”你听得又惊又喜，等屋里没有声音，你才探出头，看【姚长寿】已经躺在床上，就赶紧出来。\n你看见一个带着行李的【短发女人】从大门进来，她年纪二十出头，身穿浅色麂子皮衣，长裤皮靴,拿着一个用“青布”缠绕的长包裹。她说来找【徐伯清】。你不知道【姚】家有这样一个人，就带她去客厅，看见【红夫人】和【姚仲义】都在，旁边还有一个青年,【姚仲义】向【红夫人】介绍青年是【虞医师】。【姚仲义】听了【短发女人】的来意马上起身，带她上二楼。\n你不知道【姚仲义】和【短发女人】有什么关系，就悄悄跟着，看他们进了一间二楼客房（带露台的,中间的那间)。\n你回到一楼，大门外来了客人，你带他去一楼客厅见【红夫人】，你听到他们聊到出售村北树林。你去一楼旧屋内外(这里曾是姚孟仁和陈均梦的卧室)装作打扫，仍盯着楼梯方向。不一会儿【姚仲义】下楼去主卧室，他回楼上时，你看见【朱迪】偷偷跟在后面——这个人自称是姚家的亲戚，和红夫人关系不错，被红夫人留下，住在二楼客房。\n你这时要去树林拿“木笼”——为了不被人看见,你每次都从后门离开大宅，绕路过去——没想到树林深处升起滚滚黑烟，还有火光。你看见【神秘人】在树林边上捡起一只信鸽，从信鸽腿上的信简里抽出一张“纸条”，他看完后恶狠狠地把信鸽摔在地上（信鸽早已经死了，没有动弹)，他把“纸条”塞进头上的“黑爵士帽”里,向后门走来——你不知道发生了什么,怕被人撞见,就躲回下人房。\n昨天（8月2日）晚上\n(21:50）你来到屋顶天台上，眺望村北树林仍被黑烟笼罩，深处有零星的火光闪烁。\n(22:00）你听见有人命令【姚仲义】上来天台，你感到害怕，躲进杂类间(杂类间里面是空的)，把耳朵贴到门上。\n(22:10）你听到:“我……民国军人……要犯……云凌……让徐伯清见鬼去吧!”然后又听到:“……私通……你一个婢妾生的……我……有证据!”\n(22:30）你听见有人在喊“姚仲义”，紧跟着是“碰”的声响!你吓坏了，听见外面没有动静，赶紧跑出去，差点踩到一盘放在托盘上的“太湖银鱼”(红夫人的拿手菜)，你没敢看天台上发生了什么，就跑下去，\n(22:40）你躲回二楼下人房，心扑通扑通跳个不停。\n(23:00）你听到门外的阳台上有人说话，就打开门缝，看见【短发女人】端着一支“步枪”，在她对面是头戴“黑爵士帽”，用“白围巾”挡住面容，在晚上仍戴着“墨镜”的【神秘人】，【神秘人】手里也有一支“步枪”。你赶紧关上门。然后你听到“碰”的声响。\n(23:10）你打开一条门缝，看见自己门口的地上有一支“步枪”，你非常害怕，把“步枪”踢向楼梯口，然后躲进屋里，关紧房门。不久你听见阳台方向有东西摔落到地下，还有人说话，你没敢去看。\n(23:20）你再次打开门缝，看见阳台的“栏杆”不见了，【虞医师】站在阳台上—你突然想起来，你回苏州时，在“临池客栈”门口见过他，当时【姚仲义】去接他，他们离开后，【短发女人】从客栈里走出来——你赶紧回屋，没被他看到。\n(23:50）你听有人用“钥匙”开隔壁的储物室门拿东西，你等没有动静后才敢出来，看见储物室门口地上有一顶“黑爵士帽”，远处有个戴“白围巾”的人拿着“清洁工具”走进走廊西边尽头的客房。你不敢再看，强迫自己睡下。\n今天（8月3日）早上\n你听说【陈均梦】害了眼病，你去帮她换药，扶着她去客厅，【短发女人】发现了一具尸体——昨晚没有离开村子的马车，真凶一定还藏身在这里。\n你环视客厅里的人，不知道此时该相信谁……",
    "Relationship": "1、姚孟仁:【姚长寿】的长子，三年前去世。\n2、姚仲义:【姚长寿】的次子，你想利用他改变命运。\n3、姚长寿:“百里村”的大地主，和【陈轻梧】都在打一个宝藏的算盘。\n4、红夫人:【姚长寿】的继室，很信任你。\n5、陈均梦:你的堂妹，【姚孟仁】的遗孀，她在丈夫死后住在树林里的洋馆。\n6、其他人你现在并不认识。",
    "Performance": "以下“表现”，你在此阶段必须这样做，你需要隐瞒没有被别人发现的真相\n1、自从你目睹父亲死亡后，就非常怕见血—-你绝不会去“调查”尸体现场。\n2、询问为什么【陈均梦】会在大宅里，她的眼睛怎么了?\n3、你告诉大家【姚仲义】为人善良，对所有人都很友善。",
    "Purpose": "1、找出真凶。\n2、不让别人指认你是真凶。\n3、找出杀害你父亲的凶手。\n4、找出“宝藏”的真相和位置。\n5、隐瞒你给【陈均梦】传递消息和信鸽。",
    "Ability": ""
  }
}