{
  "翡翠居": [
    "当年范金魁当工头,带着李家兄弟给人干活,阿强怕累就没去,后来李家兄弟出事故下落不明。范金魁就带着刃子,说去找雇主的上司,要给李家兄弟讨一个公道回来,之后阿强就再没见过范金魁—直到范金魁的未婚妻发现了他的尸体。阿强是“翡翠居”的常客他当年差点被范金魁带去工作，如今想起来还一身冷汗",
    "大眼阿坤有个名叫立柱的朋友,十多年前被附近的别墅雇佣拉货。立柱来买酒时说那家人让他拉的东西气味很大很难闻,不多给钱他才不干！大眼阿坤还记得姚家大少爷曾让他们把一个名叫张得采的家贼抓走送官坐牢。大眼阿坤是“翡翠居”的常客他听说上海精神病院有病人逃走那医院的病人有的喜欢冒充医生",
    "“翡翠居”掌柜阿翠想起好见天前。她见到朱迪带一个外人去“白霜亭”。朱迪的态度非常恭敬。贵叔是前天来住宿的,昨天一早他就去村里到处走动。昨天下午,胡人玉来酒馆,他听说姚长寿娶乃红夫人,就摔碎了酒碗。阿翠是红夫人的妹妹，她记得当初姚长寿来骚扰姐姐，差点和姐姐未婚夫范金魁动手。",
    "阿达说他儿子绝对见了“鬼”。而且不止一个！先有一个“老头鬼”浑身发光,他儿子被吓得尖叫。这时有人过来,“老头鬼”躲进树丛,把毒蛇都吓出来,后来“女鬼”来了,“老头鬼”要从背后掐死她,他儿子看见有灯光就跑了。“老头鬼”也躲了回去。阿达是“翡翠居”的常客，他的儿子之前在树林里迷路，多亏姚二少爷去帮忙找回来。"
  ],
  "白霜亭": [
    "地上有几朵“桔梗花”，附近地穴涌出有刺鼻的滚滚黑烟，无法靠近调查。"
  ],
  "树林": [
    "死去的鸽子(足上的信筒是空的)，树林里都是刺鼻的滚滚黑烟，无法靠近调查。"
  ],
  "陈均梦的回忆": {
    "撕开的地图": "你小时候,见父亲把一张“撕开的地图”当宝贝,一次他叹气说:姚长寿那一半肯定画了位置。早知道需深活不过第三年,早就该去挖出来。你看见家仆陈市田偷走“撕开的地图”。他去索要你给乞丐的银子后,就再没见过他。记忆的内容不能给其他人阅读，可以转述或编造。",
    "武昌": "你丈夫姚孟仁在婚后不止一次提出要去武昌,还说出很多在清未大迎不道的话。公公姚长寿非常担心,生怕被外人听到。姚斋仁甚至在红夫人嫁过来前。去找她。如果她不愿意嫁。就借这个机会送她去武昌,然后留在那里。记忆的内客不能给其他人阅读，可以转述或编造。",
    "桔梗花": "你丈夫姚孟仁在婚礼上坚持让你戴上“桔梗花”。还有“文竹”。你很不理解。他说这是敏月姐说的。它们代表“永恒的爱”和“纯洁的心”。敏月姐是一个有主见、独立性很强的女性,可惜他不能亲手给敏月姐戴上。记忆的内容不能给其他人阅读，可以转述或编造。",
    "特制弹夹手枪": "你丈夫姚孟仁总是随身带着一把这样的手枪。他说这枪独一无二。而且大有来历:十多年前。有位唐先生带着女儿路过“百里村”住宿。遇到土匪,他带着大家抵抗。土匪都被赶走后。唐先生把这枪送给姚长寿。后来被姚孟仁要了过来。记忆的内容不能给其他人阅读，可以转述或编造。",
    "隧道": "你父亲收藏一张旧报纸,上面的新闻是“百里村”附近别墅里的杜老总管遇到地面塌方。意外摔伤致死。你父亲说那别墅地下八成有条隧道,当年“百里村”隧道里就发生过类似事故。被杜老总管掩盖真相,搞不好是有人去复仇。记忆的内客不能给其他人阅读，可以转述或编造。",
    "阳台的栏杆": "你文夫姚需仁提过他母亲徐夫人的一件秘密,他小时候亲眼看见他母亲在阳台的栏杆上做手脚。后来他母亲就非常怕黑。到死都不敢灭灯。你觉得文夫隐瞒了什么。问他他也不说。第三天他送你回娘家。那是你最后一次跟他说话。记忆的内容不能给其他人阅读，可以转述或编造。"
  },
  "客房（虞医师）": [
    "一支“特制弹夹手枪”★，弹夹内的子弹少了二发，在虞医师的客房的露合上发现。",
    "虞兄：京城一别至今已有三年。兄近况如何，甚是想念。近来吾家有一怪事，兄定有兴趣。可否来苏州一见，当面讨教。一封“姚仲义”写的“信”，收信的地址是，“北京阜成门内锦什坊街虞家”。"
  ],
  "下人房": [
    "一个“木笼”，里面有一根白色羽毛，在陈安巧的房内发现。"
  ],
  "阳台": [
    "一块“青布”，挂在折掉的栏杆边上，在二楼阳台发现。"
  ],
  "杂类间（天台）": [
    "“染血的抹布及其他清洁工具”，这些本应放在二楼的储物间里，在天台的杂类间内发现。"
  ],
  "客房（徐伯清）": [
    "在客房露台西边的围栏上，发现血迹,一直延伸到西边隔壁露台(朱迪客房的露台)。已经疑固“血迹”，注：露台的围栏不高，在徐伯清的客房的露台上发现。",
    "去年“江南制造局”丢失一批“快利步枪”，嫌疑人绰号“白头蛇”，已在上海某酒楼被捕。“白头蛇”供出有“内应”在“百里村”准备和绰号“金胡子”的土匪接头,进行军火交易。“白头蛇”持有“金胡子”的信物“半张地图”%,现将此物交予中华民国驻江南部队特派员徐伯清中尉,请立刻前往该地,彻查此事,抓捕“内应”和“金胡子”一份“机密任务”，由上海镇守使郑汝成委派，在徐伯清的客房内发现。",
    "一个“黄金长生锁”，后面刻着“孟”字，在徐伯清的客房内发现。"
  ],
  "客房（云凌）": [
    "一张手写的“字条”，“今晚子时,我在二楼阳台等你”，在云凌的客房内发现。",
    "一支“特制汉阳步枪”◎，漏夹(弹夹)内的子弹少了一发，在云凌的客房内发现。"
  ],
  "客房（胡人玉）": [
    "一个“牌位”，死者是李宽生和李广生兄弟，在胡人玉的客房内发现。",
    "“二百两黄金”，一个“法蓝饰物”（法蓝扁钥匙），在胡人玉的客房内发现。",
    "一支“马牌撸子”(手枪)*，弹夹内的子弹少了一发，在胡人玉的客房内发现。"
  ],
  "客房（朱迪）": [
    "一副“墨镜”，在朱迪的客房内发现。",
    "一串“钥匙”(楼上的备用钥匙），在朱迪的客房内发现。",
    "一盒“洋火”(火柴)，在朱迪的客房内发现。"
  ],
  "客房（方医生）": [
    "“撕开的地图(上)”(有褐色血迹），手绘在写信用纸上的地图，在方医生的客房内发现。",
    "敏月：我赚了一大笔钱，很快会来找你，然后娶你。张得采。一封“信”，很久以前写的，在方医生的客房内发现。",
    "护士长，方敏月，上海闸北西医院。一个“胸牌”，在方医生的客房内发现。"
  ],
  "一楼（旧屋）": [
    "“硼酸溶液”和“金霉素”，还剩下一些药剂就被扔掉在一楼的旧屋(陈均梦房)内发现。",
    "一个“黄金长生锁”，后面刻着“孟”字，在一楼的旧屋（陈均梦房）内发现。"
  ],
  "一楼（厨房）": [
    "“写着‘安神’的药瓶”，药瓶上没有说明在，一楼的厨房内发现。"
  ],
  "一楼（姚仲义房）": [
    "有人夜来，摔下后跑掉，小孩害怕我。均梦。一顶“爵士帽”，里面藏着一张纸条（见上），在一楼的姚仲义房内发现。"
  ],
  "一楼（贵叔房）": [
    "“镇静剂”空瓶，后面写着成分含有“东莨菪碱”，在一楼的贵叔房内发现。",
    "一个空的“纸包”，附近还有烧剩的灰烬，在一楼的贵叔房内发现。",
    "一件“条纹服”，一把锋利的“手术刀”，在一楼的贵叔房内发现。"
  ],
  "一楼（主卧室）": [
    "【老板】孟深。【老总管】杜信辉（已故）。【新总管】杜贵成。【总管助手】方乘山（已失踪）。【顾问】虞北辰，唐茂光（已离开）。【雇员】姚长寿（负责【百里村】地租），陈轻梧（负责苏州商铺）。一张烧坏的“名单”，1900年“法朗商行”的成员，在一楼的主卧室内发现。",
    "一支“快利步枪”◆，枪内没有子弹，在一楼的主卧室内发现。",
    "【我们三人都是给孟老爷工作的,他家管事的杜老总管却只信任姓方的,什么好事都交给他办,太可恨了……】【姓方的想把东西还回去,太傻了!我俩打死都不能让他这么做……】【这次不能回头了,但尸体怎么会失踪?难道他没死……】【……又来跟我说,他要去武昌,这是造反的罪名,全家都要杀头,他要敢去我就当他死了……】【我终于找到入口,必须在上面修一个东西来防止被她发现……】“烧坏的纸”，只能辨认出几行内容，在一楼的主卧室内发现。",
    "“撕开的地图（下）”， 被姚长寿收藏，在一楼的主卧室内发现。"
  ],
  "现场（尸体）": [
    "尸体位置在姚长寿和红夫人主卧室窗外，死者头上有摔伤(血液已经凝固)，脸上的神情非常震惊，胸口有一个8mm 的贯穿伤口。"
  ],
  "现场（血迹）": [
    "死者身上的“白围巾”沾了血，上面有一个9mm的小孔，地上还有已凝固的血迹。血迹先从玄关大门左侧开始一路延伸到贵叔房窗口外，再延伸到姚长寿和红夫人主卧室的窗口外，最终尸体所在地。"
  ],
  "现场（地面）": [
    "尸体身下有折断的“阳台的栏杆”，断口本身就曾接过一次，断口有一处新的弹孔痕迹。"
  ]
}