{
  "白穆": [
    "这本笔记断断续续，缺失了很多，有不少页都被撕掉了,笔记到了12月1日就中断了,笔记中很多像是人名的部分都被划烂了，就像是被尖锐的指甲划过无数遍一样根本看不出是什么字。以下是笔记的内容，“XX”表示看不清的地方：\n10月1日 晴\n今天是国庆节，是一个很好的假期，我决定开始写日记，算是记录我在真相高中的生活吧。明天XX约了我和XX一起出去玩，这让我有点不适应，在高二3班已经有1个月了，说起朋友，只有她们两个和XX了吧，虽然有点对不起她们两个，但我内心其实比较想跟XX一起出去玩，或许会有更多共同话题。\n10月2日 晴\n今天是国庆节的第二天，XX约了我和XX一起逛街游玩，我们还一起拍了合照，XX还开玩笑说这就当做是我们的闺蜜照吧，这让我有点不舒服。\n10月4日 阴\n昨天在图书馆看了一本书名字叫做《七夜》是个讲轮回的恐怖故事，题材很新频，但也仅此而己，倒不如说我对恐怖小说都没什么太大的兴趣，所以看了开头就没再看了，下次要去图书馆找一些更有趣的书才好。\n10月5日 雨\n今天拿到了拍的两张照片，总觉得拍得都不怎么好，不过这毕竟是友谊的记忆也就无所谓好不好看了。\n10月6日 阴\n今天看了一御恐怖电影，叫做笔仙，内容粗制滥造，前期用扩大的音量吓唬观众，结局却是女主角出现了幻觉导致了这一切，国产恐怖片果然不值得做任何期待，以后我大概不会再去看任何国产恐怖片了。\n10月7日 阴\n下星期学校要安排体检了，嗯，看来我应该生一场病请几天假才行。\n12月1日 晴\n该死的，是谁把这件事宣扬的全班都知道了?我要去问个清楚!\n白穆",
    "你（白穆）走近看，忽然注意到地上的血迹边缘似乎有个红色的字：“白”，字迹的主人似乎已经遭遇不测。"
  ],
  "皇甫青": [
    "你（皇甫青）拿出了口袋中的备忘录纸，仔细分辨那一行被各种线条涂抹掉的字，你最终看出了其中一个字的轮廓，那就是这句话的第一个字“蒋”！",
    "你 (皇甫青) 打开了录音笔的播放键，录音笔里传来了嘈杂的声音，由于杂音太多而且声音太小你根本听不清楚，你听到了好几个人尖叫的声音，这些声音里有男有女，录音的最后你清晰地听到了一个女声惊恐的喊道:“我知道了!多了一个!多了一个!!!”然后便是一声骨肉断裂的声音，录音结束。"
  ],
  "李萱萱": [
    "电脑桌旁摆放着一张相框照片，里面是你（李萱萱）和【谢雨晴】的合照，这张照片是国庆节拍的，照片上你在右边，【谢雨晴】在左边，有些奇怪的是，你与【谢雨晴】的中间隔着很大的一段空白位置。",
    "第一次见到它我就觉得它非常的特殊，像是珍宝一样吸引着我的视线，我开始想方设法的收集它的信息，像是个跟踪狂一样超随着它的脚步，它用过的东西我都会小心保存，它的存在比我以往所有的玩具更今我欣喜若狂直到某一天我修于偷窥到了它的秘密，现在回想起来仍能感觉到那一瞬间心灵上的快感，无比的愉悦，至高的欢愉，我对它欲罢不能，我要拥有它，将它变成我的所有物。可是它拒绝了，它居然敢拒绝我，该死的，看来它并不了解我，我要得到的东西就一定会得到，所以我把它的秘密重露给了XX，那张嘴巴一定会宣扬的人人皆知的，所以我不怕它不就范。我们约了晚上在天台见面，可是我失策了，它居然想跟我同归于尽，该死的，它疯了，它想把我的秘密也公布出去，这样两败俱伤无论对准都没有好处，我只能先唬住它让它暂时不要轻举妄动，之后再想办法让它闭嘴。之后发生的事让我始料未及，它居然从天台跳下来了!!!它居然因为这个事情就自杀?我快疯了，我到现在都忘不了那一幕，我刚离开教学楼它就这么重重的摔在我的面前!更可怕的事发生了，它的尸体不见了，在我眼前一瞬间就消失了，怎么会这样?更奇怪的是班级里居然没有人记得它的存在了，怎么回事?每个人都不记得有这么个人了，就连我，也慢慢的将要遗忘它的存在，它的容貌......它的声音它的名字......不行!我必须将这一切记下来我不能忘记，这记忆是我的珍宝，我绝对不能忘记!我不能忘记它的容貌，它的名字......哎?等等，它长什么样来着?不对......不对，快想起来，它......它......它叫什么来著?\n李萱萱",
    "你（李萱萱）注意到那只白皙的手掌中间似乎头着一张碎纸，你强忍着恐惧将那张碎纸拿了出来，碎纸上另写了三个字“不存在。“"
  ],
  "吕思琦": [
    "你（吕思琦）走到李老师的办公桌前随便翻翻，你打开了第一个抽屉，里面都是一些杂物，你注意到最下方似乎有一个信封，带着好奇你把那个信封拿了出来，信封上用很工整的字体写着“致--谢雨晴“打开信封，信的内容洋详洒洒写了一整页，都是表达了对【谢雨睛】的爱慕之情，落款是【白穆】，时间是2018年12月8日。",
    "你（吕思琦）低下头看去，发现课桌中有两张纸条，你小心翼翼的打开:\n纸条1:“男人婆，真恶心。”\n纸条2:“高二3班不欢迎你。“"
  ],
  "谢雨晴": [
    "当你（谢雨晴）打开书包隔层时以往爱看的小说却并没有放在里面，取而代之的是一本没有署名的日记本。这本日记并不是你的，那么会是谁放在你专门放小说的隔层里的呢?带着一些好奇，你打开了这本日记。\n12月6日\n我是谢雨晴，这是我的日记，记录着我身边发生的事情，如果你也是谢雨晴并且看到了这篇日记，那么我的猜想就是正确的，我可能陷入了一个非常恐怖的事件中。我真的不希望这篇日记还有下一页，如果有那么事情可能正在往坏的方何发展。\n12月9日\n我是谢雨晴，今天发生了一件非常恐怖的事情，那就是我看见了这本日记，以及12月6日的日记内容，字迹和我的一模一样，而且放在了只有我知道的书包隔层中，可是我对此居然没有任何一点印象，我的记忆好像出现了问题。\n12月10日\n我是谢雨晴，好吧，看来我失忆的事情是真的，我不记得我有写过那两页日记，但是这代表了什么?我忘了什么吗? 我现在真的得想问问12月6日的我，是不是发现了什么东西才会让那时的我想到写下这篇日记。\n12月18日\n我是谢雨晴!我终于知道我到底忘记了什么! 我忘记的是!高二3班全班同学的人数!我很害怕，我现在真的很害怕，班级里有34人，可是，原本班级里足足有40人啊! 我问了班很里所有人，他们都不认识XX和XX，明明昨天还一起讲过话的，今天居然就消失了! 而且我预感到我很快也会忘记她们的名字，没错，我也不是例外，是我比别人要“忘”的稍微晚一点才会察觉到这些! 此刻觉得这间教室死气沉沉，仿佛坟地一样，而我则是一个即将埋入坟墓却还剩最后一口气的活人。\n12月27日\n我是谢雨晴，我已经快要崩溃了，现在班级里的人数是30人，又少了4个，我看到了18日的我写的日记，上面记的人名都消失了，看样子消失的不仅是人，连他们的记忆，及存在过的所有证据包括名字也被一同消灭掉了，仿佛世界从来就没有这些人!我现在真的害怕极了，我怕什么时候就到我了，是的，我能感觉到，早晚就会轮到我，我现在握着笔的手不停的在颤抖，我或许该想想怎么才能不来学校上学。\n1月4日\n我是谢雨晴，我感觉到了，快要轮到我了，就快了，今天班级里还剩下25人，15个人就这么消失了，我必须自救，这本日记是我唯一的希望，我买了两只录音笔，一只贴身放在衣服的小口袋里，还有一只放在教室里，这能帮动我了解到我身上发生了什么事，教室里又发生了什么事。\n1月13日\n我是谢雨晴，怎么办! 我身上的录音笔不见了，到底去哪里了?虽然丢了一只录音笔，但是教空里还有另一只，你绝对无法想象我在那只录音笔里听到了什么，我听到了好多恐怖的声音，有惨叫，有哀嚎，有尖叫还有很多刺耳的哭声，还有一个人在我身边低语，那个人说:“死吧，你快点死吧，你快去死吧......”我快要疯了。\n2月19日\n我是谢雨晴，没想到寒假刚结束我就看到了这本日记，如果可以的话我真的不想知道这些，好吧，现在我又回到了这间教室，让我看看现在还剩下几个人，现在还剩......20人......\n谢雨晴",
    "你（谢雨睛）刚走进女厕所的隔间把门躺上后便听到了两个女生的交谈声:你知道吗? 李萱萱和李老师其实关不很不正常哦。什么不正常啊?他们不是父女吗?才没有那么简单，他们是父女没错，但是他们的感情可不是一般的父女哦。咦，你是说?真的假的，好恶心。我也是听别人私下里说的啦，隔壁班的人据说之前在午休的时候看到李萱萱偷吻李老师呢，正常的父女会这样吗，真恶心。"
  ],
  "姚青峰": [
    "等待的过程中，你（姚青峰）注意到隔间的墙板上有个小洞，从这里可以看到第五个隔间。",
    "你（姚青峰）好奇的将手机中的音频文件点开:“喂!我要报警!有人死了! 我看到了!”“请告知您的姓名和现在的位置。”“真相高中!在真相高中!我叫【姚青峰】我现在正在宿舍里!我和我的三个舍友都看到了，对面教学楼上有人从天台被推下去了!“”好的，请您待在房间里，锁好门窗等待我们的警务人员到来。”",
    "你（姚青峰）是个风水世家的少爷，你的爷爷是一位风水大师，凭借着给人相看风水的能力而在本市挣下了诺大的家业，你很小的时候就以此为傲，经常跟同学吹嘘但都被老师训诚被同学嘲讽，但你并不在意，随着渐渐长大你对爷爷的这一套学问越加的敬畏，知道的越多你心中就越是觉得爷爷深不可测，你的爷爷曾经对你说过，其实世界上真正的鬼魂很少，而且大部分都无法伤害活人，但有一种情况例外，那就是诅咒，一个人临死时强烈的怨念会诅咒某个人或是某个地方，又或者是某个时间，诅咒的形式十分多样化，而业受到诅咒的侵袭后人内心的执着或是阴暗面便会具现化成为恐怖的厉鬼前来索命，而鬼魂就是人内心的心魔，被鬼魂杀死的人其实都是死子自己或别人心魔化成的厉鬼。自己的心魔唯有自己才能消灭，直面心魔，将心中的阴暗面暴露在阳光下，然后借劝“通灵宝玉”的力量可以将心魔化成的厉鬼净化掉"
  ],
  "叶冷星": [
    "当你准备把书放好时，一张照片从你的书页中掉了出来，那是一张你的单人照，但是却给人很怪异的感觉，照片中的你站的位置似乎偏左了一些。",
    "你将床边的笔记本拿了起来，蓝色的笔记本封面上写着“蒋温灵”三个字。你打开了笔记，笔记内容缺失了很多页，其中像是人名的部分也被像是指甲一类的东西给划破了，根本看不清原来的内容。以下是笔记的内容，“XX”表示看不清的地方：\n10月1日 晴\n今天是国庆节，明天和XX还有XX有约,我非常开心，她们可是我最好的朋友，不对不对，应该说是闺蜜才对，一虽然跟我关系也很好,但是跟男生一起玩我还是觉得怪怪的。\n10月2日 晴\n开心，今天玩得很开心，我们还一起拍了闺蜜照，她们俩还买了一对四叶草戒指当作闺蜜对戒，因为戒指只有一对了，所以我就没买，虽然有点小失落，但总体来说今天过得还是很开心。\n10月3日 阴\n今天是跟XX有约，他想要去国书馆找一本比较稀有的书籍，所以拉上了我一起，好吧，反正我也没有什么事情，不过我还是很好奇为什么他没有约XX或者XX反而约了我，他回答说他看书的时候不喜欢那种叽叽喳喳的女孩子在旁边。看来她们俩被嫌弃了呢。我在玩手机的时候XX看到了我手机相册中和XX以及XX的合照，便要求也跟他合拍一张，没办法只能答应他了，这个男人怎么比女人还小心眼。\n10月4日 阴\n昨天在图书馆看了一本书名字叫做【七夜】，主角被困在一个无人的小镇中，小旗每晚都会发生光怪陆离的事情，而主角在每一晚都会被灵异事件杀死，但是到了白天又会复活，似乎是陷入了一个七夜的轮回诅咒之中,只有在七个晚上的时间内破除小镇的诅咒才能活下去，主角等于有七次生命一样呢，非常有意思.可惜没来得及看完结局，不过不管怎么说七次也有点太多了吧，像不死之身一样呢，换成我来写的话就写成三次，在恐惧中死亡三次才能真正解脱。\n10月5日 雨\n前两天的两张服片已经打印出来了，分别给了XX、XX还有XX，我很珍惜这两张服片，这代表着我在真相高中的友情。\n10月6日 阴\n今天看了一部国产恐怖电影，讲的是“笔仙”，如果有几个人一起玩的话可以问笔仙问题，也可以用笔仙写别人的名字诅咒别人,人至少要七个才行，这却电影最神奇的地方就是笔仙连鬼魂都可以诅咒，只要写上鬼魂生前的名字，笔仙就可以通过诅咒消灭掉鬼魂，这大概就是所谓的以毒攻毒吧。\n10月12日 阴\n奇怪，很奇怪，我总觉在哪里有只眼睛一直在看着我，这是谁的眼睛呢?\n10月13日晴\n那种感觉越来越强烈了，有什么人在注视着我，虽然看不到，但是我能感觉到，那目光中蕴含的恶意。\n11月21日 阴\n我经于看到了那只眼睛，从洞中看过来的那只眼睛，可是，这怎么可能呢?!!!\n11月25日 阴\n大家都开始疏远我了，目光中带着恶意，这是为什么?就连地们两个看我的眼神也充斥着仇视和鄙夷，不，这是为什么?XX虽然没有刻意疏运我，但是我能感觉到他看我的目光也变了。\n12月2日 雾\n我不接受藏胁!也不会妥协!晚上我会去天台赴约，当然我也不会是一个人，我约了XX跟我一起，现在唯一还把我当朋友的也就只有他了，他躲在旁边，如果那个人想对我动手的话他一定可以阻止的!"
  ],
  "某人": [
    "某人的记忆：“你们两个今天想吃什么呢?“”我想吃糖醋排骨。““那太甜了，妈妈我想吃蛋黄鸡翅。”“好好，那就都做。””你背后这样说她是不对的，她知道的话会多伤心你明白吗?“,“呵呵，少关心别人了，我可是知道的哦，你也是个可怜虫。”“一起去图书馆吗?”“我吗?我和你一起去是不是怪怪的? 你看其他人都是一对对的一起去图书馆看书。”“你这种样子难道想做我妈妈吗?别想抢夺爸爸对我的爱!你真让我恶心!”“你在说什么啊?我们不是朋友吗?““你住嘴，我和你不是朋友，如果再让我看到你和爸爸单独在一起，我一定会杀了你!““作为一个老师，你这么做不觉得羞耻吗?”“这用不着你操心，你考虑的怎么样了，答应还是不答应?”“你休想，我明天就向教务处举报你，你这样的人根本不配做老师!“"
  ]
}