{
  "第一幕": {
    "大天狗": {
      "Story": "你叫祭博明，是守护京都的天狗大人。\n一你要守护这片土地，还是守护她\n【守护的意义】\n从爱宕山上看下去的京都也仍是很大的一片，家族里的长辈们说，这是你们世代一直守护的地方，虽然不知道这是什么意思，但你仍然为了这个不知所谓的使命，努力向着成为大天狗而修行着。\n你的家族是负责守护京都、受到世俗敬畏的天狗一族，从出生开始你就居住在爱宕山上，家族每天都会受到来自俗世的供奉，年轻的天狗族人也会在各自分家的道场里训练，希望有朝一日可以去到【天域院】成为大天狗，成为大名。\n天狗这个族群的使命就是维护妖界的和平，守护整个妖界。天狗一族会按照实力划分为天狗、乌天狗、大天狗、大名。成为大天狗后会去天狗族的权利中心【天域院】中任职。天域院坐落在京都中心，是负责维护俗世安定、保护妖怪不受侵害的组织，乌天狗是协助大天狗的协办人员，大天狗是主要的执行人员，大名是掌管天域院的领导者们，统领所有的大天狗，也是每一个大天狗都想成为的巅峰。\n你的爸爸就是最高级别的大名之一，你也本应是下一任大名。但是你却是一个特别的存在，你从小被其他同辈的天狗欺负，为什么呢？因为你是人类和天狗的混血儿。\n他们总会当着你的面前辱骂你打你，说你是杂种。\n不过还好，你有一个一直支持鼓励你的哥哥。所以你一直很努力，努力地锻炼，努力地学习，很努力地想要证明自己也是可以当大名的天狗！\n虽然是人妖混血，但是通过努力，你和其他天狗是一样的，和哥哥一样，和爸爸一样。而且你的翅膀右边有一个月牙形上面有个圆形的奇怪胎记。你发现你的父亲也有一个一样的印记，哥哥却没有。你开心地认为这是你和父亲的血脉联系，你一定可以和父亲一样优秀。\n但是好像有些东西是注定无法改变的，例如天分“博明！你走神去哪里了！？”你听到浙一声呵斥惊了一下，又把手中的竹剑握紧了一分。\n说话的是哥哥祭山赐，是家族年轻一辈中最早成为大天狗的人，平日里对你很好，但只要在道场里训练的时候，他就会变得严厉。哥哥是一个出色的天狗，很有天分，已经成为一名合格的大天狗在天域院任职了。他没有你努力，但不到几年时间就已经成为大天狗，而你每日每夜地联系，每日每月地学习，到头来也只是一个一事无成的吊车尾。从道场出来去后，你走到了爱宕山上一个可以看到京都的林子里，你听长辈说京都是你们世代守护的地方，但你并不明白为什么要守护它，明明自己就已经很艰难了，还要去想着守护别人，不是很可笑嘛。\n你开始怀疑，怀疑自己是不是错了。努力也许是没有用的，有些东西在你生下来就已经决定好了。你开始想自暴自弃的时候，哥哥出现了，他与你说起了他的过往，让你知道了他并不是因为天分好才成为的大天狗，而是他付出了比没有天分的人更多的努力。哥哥跟你说：加油博明，你可以的，只要你足够的努力，一定能当上大名的。\n你一直在努力着并且相信着。相信着总有一天可以和哥哥，和爸爸站在同一个地方，得到全族人的认可，成为受人敬仰的大名，你暗暗地发誓。\n不过上天似乎没有听到你的发愿，连续几次你都没能通过天域院的测验，无奈之下你只好在其他乌天狗手下实习，希望这样可以多一些经验积累，参加下次测验。\n在你实习不久，你的父亲就接到了一个神秘的任务。你发现父亲接到这个任务后就总是很苦恼地把自己关在房间里。没过两天他就出去执行任务了。你从没想过那是你最后一次见到父亲。后来你听说京都附近的村落里，负责镇压富士山的大雪女突然失踪了，现场只留下了一根天狗的羽毛，据目击者称，带走大雪女的似乎是个天狗，而且从各方面的描述来看，这个掳人者就是你的父亲！\n可父亲带走大雪女又是为什么呢？父亲为什么不回家呢？没办法，组织只能把你父亲列为嫌疑最大的人，你和哥哥作为亲属只能避嫌，不可以插手这件案子，只能私下调查，但成效甚微。你私下曾经调查过，却从父亲的好友口中得知了一个惊人的真相，你父亲的任务竟然是抹杀那个大雪女！你不明白如此坚守正义的父亲，要守护京都所有生灵的父亲，怎么可能做这样的事！从此之后你从未间断寻找父亲或那只大雪女，但是收效甚微。\n在担任乌天狗助手的这段时间里，你遇到过很多案子。但每一件你都没有办法处理，不只是因为权利不够，还真的是因为自己没有能力。这让你的自信心备受打击。案件的无力，父亲的失踪，一度让你产生了放弃的念头。\n在一次执勤过程中，你无意间听见有人在讨论稻荷神山下，出现了一个狐狸旅馆，传说只要找到旅馆的人都能心想事成。你感觉这可能是一个机会，于是多方打听和走访，终于让你找到了它！\n那是一条绿荫遮蔽的山间小路，路口赫然立着一个巨大的红色鸟居，走进小道之后看到的沿途一路也都是大大小小的鸟居，而鸟居下方也有着各式各样栩栩如生的狐狸雕像。当走到了道路的尽头后，你看到了一只银白色得狐狸，正端坐在这里似乎在等待着你的到来。\n你跟随着狐狸来到了旅馆，老板娘【阿玉】是一只美艳的白色九尾狐，她领着你走进旅馆里参观了一番，你发现这里莫名的很亲切。你跟阿玉说了来这的原因。她听后把你带到了供奉稻荷神的神龛前。你在这许愿∶自己能凭借著努力顺利的成为大天狗。守护京都的正义和和平。许愿后神龛突然发光，然后在神龛前出现了一个御守，你拿起御守想要打开看看，却发现怎么都打不开。你不知道愿望能否实现，但你还是把这个御守放在了自己身上随身带着。\n后来你经常来这里吃饭喝酒，你发现旅馆内有很多大天狗在这里吃酒，但他们似乎从不付钱，只记账。阿玉对此很苦恼。你不愿与他们同流合污，每次来这里都只自己坐一个小桌，慢慢的吃喝。当然，你每次都会付钱。也许是稻荷神显灵，你的愿望竟然真的实现了。在你许愿没过多久，你就顺利的通过了乌天狗的考核。通过后你跑到旅馆又许了希望能成努力破案为大天狗的愿望。\n一来二去的你和阿玉姐也熟络了，常常会跟她一起喝酒，聊一些生活中的苦闷事情,阿玉姐也跟你说起了她的故乡和身世，原来她曾经在故乡有一个青梅竹马的未婚夫，谁料在她和青梅竹马订婚的当天，未婚夫却被人杀害了，她只知道当天有看到过一只镰鼬跑过，后来她就来到了狐狸旅馆。阿玉姐说完后郑重的拜托你，请你帮她调查她未婚夫死亡的真相。你点点头，承诺一定帮她找到凶手。\n最近你在旅馆吃饭时总能听到一句话：“请问客人，您觉得我做的东西好吃吗?如果不喜欢，能告诉我是哪里吗?”你知道这是阿玉姐新招的厨子风一郎，又在询问客人他的料理味道怎么样了。说实话，刚开始他的料理只能说一般，但是他对料理的认真是你很赞赏的。你认为只要足够努力坚持练习的话，他应该会成为一个好厨子。不过他对你并不怎么殷勤，似乎他对所有大天狗都不怎么喜欢。这让你有些费解。\n自从你经常来旅馆吃饭，偶尔也会住住后，你隐隐的觉得有一种神力加持使你神清气爽。一扫阴霾之后你信心大增的回到京都。面对之前堆积的旧案，也似乎在一瞬间找到了毛球的线头，全都处理好了。突出的工作能力使你备受上级的关注，竞然破格提升你为大天狗!你的愿望真的实现了!你这么多年的努力没有白费。唯一遗憾的应该就是你的父亲依然不知所踪。\n成为大天狗的那天，你满怀欢喜的去找哥哥，告诉他你通过努力终于成为和他一样的大天狗了!但是哥哥却一反常态的对你冷言相向，还说你不可能成为大名这样的话。\n也是在这一天，阿玉姐为庆祝你成为大天狗而举办的庆功宴上，阿玉姐和旅馆的客人都为你感到高兴，为你开心的举杯欢庆。\n这一天，你哭了。从那天后你慢慢变得孤僻，变得更用心的查案，希望可以调查到跟父亲有关的事情，也调查到了之前阿玉姐说的镰鼬案，是跟目前的民间妖怪组织【新苑组】有关，但他们的老大【滑头鬼】是一个厉害角色，在民间声望很高，暂时还动不了他。你越沉迷案子，就变得越孤僻。\n有一天，你照常来狐狸旅馆吃饭，坐下来点了一瓶酒，上来的时候你看到了那个酒瓶和酒杯在空中漂移!你出于好奇主动走过去看看是不是阿玉姐新学的什么法术，走近一看原来是一个小人偶托着酒壶走过来了，准确的说是一个很小的木偶。如果它能跳起来，估计就只能打到你的膝盖。\n你蹲下来仔细的看了看这个玩偶，做工非常精致，这时小人偶突然抬头看了看挡在她面前的你。你发现原来她不是一个玩偶，而是一个小人偶妖怪。她努力垫着脚，吃力的抱着跟她一般大小的酒瓶给你倒酒的样子，十分可爱。你轻轻地把她抱上了台子上，轻轻的说道∶你现在可以倒酒咯!她红着脸说了声谢谢后飞一般地跑走了。\n之后的每天你来狐狸旅馆喝酒的时候，总是那个小人偶来给你送酒，你渐渐和她熟悉了起来，你知道了她的名字，叫【优子】。她总是那么可爱，喜欢穿一身粉色的兔子和服，总是带着笑容。有一次优子突发奇想，想要和你比身高。你一时间愣住了，然后站了起来。她一步一啄的走到你旁边，用她小小的短手比着头和你的腿。恩，果然还没有到你的膝盖。\n她努力的仰起头，然后好奇的问：不知道天狗大人你看到的世界，会不会和我看到的不同呢?\n你笑着伸出双手将她抱了起来，放在了你的肩膀处对她说：这样，你看到的就和我一样了。\n说完后你张开翅膀，带着她直接飞上了天空。你带着优子离开了旅馆，飞入了云层之间，窜出云幕，在阳光明媚的天空中，俯瞰整个稻荷神山。翠绿的山峰上点缀着些许红色的鸟居，旁边神社红色的屋顶连成一片,多么美啊。你问优子喜欢这样的景色么?但优子却好像吓坏了，突然一动也不动，也不会说话了!你急忙降落回旅馆的院子。\n你着急的将她放下来，问她是不是吓到了，怎么不动了。她跟你解释原因，低着头，悄悄说︰【我的灵力太过低微了。一旦离开旅馆我就会变回一个不会动也不会说话的木偶。不过，虽然我不会动也不会说话，不能触碰春天的樱花。抚摸夏日的溪流，踏遍秋日的落叶，踩过冬日皑皑的白雪。但是我能看到这些美丽的景色已经很开心了，毕竟之前连看都是奢望的。】\n你若有所思的点了点头，心中已经有了一个想法。你带着这个想法回去之后，找出了住所能找到的，还看得过去的几块布，用你笨拙的手艺，想把它们缝成一个背包，觉得不能太硬，于是又加了很多绒布在里面，想着优子可可爱爱的样子和她的高度，在应该是她眼睛高度的位置做了两个洞。你缝了一夜，尽管还是有些歪歪扭扭的，但总算是完成啦!你想了想优子平时喜欢的样子，还给它加了一个樱花图案，但还是很丑......\n第二天，你再来旅馆的时候，拿出了这个樱花图案的背包。你有点局促的说∶优子，这是我送给你的背包，希望你可以躺进来试试。她打开背包钻了进去，虽然缝得歪歪扭扭，但是大小总算是刚刚好。\n接着你把背包合了起来，系在了胸前。你小心翼翼的飞了起来，开始在整个京都上空飞翔。你想让她看看下面灯火通明、宁静祥和的京都，想让她看看你一直守护着的东西。\n从这之后你经常带着这个樱花包和优子飞在天上，带她去看她从未看过的景色。可能是因为她一直待在你的胸口处吧，你的心也渐渐的离她越来越近。你知道优子的心愿，所以你也会从外面给她带很多小礼物，有时是一枝樱花，有时是一片枫叶，有时是一颗鹅卵石。每次你看到优子收到礼物开心的蹦起来的样子，你也跟着一起开心。\n【旅馆的大家】\n你和阿玉姐，风一郎。还有优子相处的越来越像一家人。你通过优子知道风一郎似乎对阿玉姐姐颇有好感，你也知道了旅馆就是优子想要守护的东西。旅馆对你来说也渐渐的更像是家一样。毕竟比起你那个失踪的父亲和早就去世的母亲还有对你冷眼相待的哥哥所组成的家来说，这里更加温暖，更加快乐，还有着你喜欢的人。\n最近旅馆又来了一个新成员。是一只红色的小狐狸。个子比优子高不了多少，毛茸茸的。这个小狐狸就像是个小太阳一样，永远都是笑嘻嘻的,见到你时她笑着介绍说∶我叫【小暖】!是来这里做见习神使的,请多关照啦~还递上一个饼干桶问你要不要吃爪爪饼干。你拿了一块饼干吃了，觉得从内心涌上来一阵温暖。但是优子似乎并不怎么喜欢这个小狐狸，跟你玩的时候说这个小狐狸来了之后就跟她住在了一个房间。她出现的太突然了，来旅馆一定是不怀好意，另有所图!你因为优子的关系和小暖走的也并不是很近。之后的日子优子跟你的话题就离不开小暖了。但是话锋却渐渐变了味。她会开心的跟你讲小暖每晚都挤在她的小床上跟她讲外面的世界，讲很多新奇有趣的事，说小暖的毛很软。很温暖，说小暖很努力，每次阿玉姐姐交代给她的任务都完成的特别好。你知道，优子已经从心里接受了小暖成为狐狸旅馆的一家人。你也拿出大哥哥的样子，给优子带礼物时偶尔也会带给小暖作为吃她爪爪饼干的回礼。你对小暖就像哥哥对妹妹一般，毕竟你也没有过妹妹，所以你也很宠她。当然，在你心里最重要的还是可爱的小优子。\n旅馆里偶尔还会见到那个头很长的妖怪，他就是新苑组的老大【滑头鬼】。据说他经常来这里躇吃蹭喝，还说什么要保护这里。这种行为和收保护费有什么区别!你很讨厌这个自称妖怪老大的人，在你眼里他就是混黑社会的混混头子罢了。这样的妖怪凭什么说保护。他只会惹是生非。不过前段时间你听优子说，他带了一个很奇怪的雪女住进了旅馆。据说这个雪女的头上自带了一朵乌云，看起来就很不开心。你很想去找这个雪女询问富士山雷女的事，\n既然都是雪女一族，应该会知道点什么吧?但是优子说这个雪女一住进来就用冰封住了自己的大门，谁也不让进，优子送饭都只能把饭放在门口。你也确实从没见她出来过，所以也一直没有机会询问她。\n旅馆每周休息日那天你都会去旅馆找优子玩。旅馆里的大家会聚在旅馆的休息厅中，一个矮桌，一床暖被，大家围在桌子边一起打妖怪间最流行的游戏《妖怪牌》。你不喜欢打牌,但优子很喜欢，所以每次你都在旁边看她玩。\n《妖怪牌》的牌中，都封着一些小妖怪的分身影子，每张牌都有不同属性，如果这牌和你自身的属性相同你还可以与牌里的妖怪建立联系，驱动同属性牌，甚至释放一点小小的符咒来恶搞下家。你是大天狗，是风属性的妖怪。能驱动风属性【姑获鸟】牌。优子是木偶娃娃，虽然她是木属性妖怪，但是妖怪牌中并没有木属性，她只能小小的驱动土属性的【山童】牌。不过她也不会给牌中下什么恶搞咒语，毕竞她只要可可爱爱的就好了。\n【正义的使命】\n近日你接到一起案子，京都远近闻名手工师父蛛大师离奇得死在了自己的八宝琉璃坊里,接到报案之后的你立马赶到了八宝琉璃坊，检查了八宝琉璃坊之后并没有发现什么特别线索，只是在调查了蛛大师人际关系后，意外的发现蛛大师最后接触的人，竟然是阿玉姐!\n阿玉姐虽然是嫌疑最大的，但是好在初步鉴定的死亡时间和她的不在场证明是吻合，所以阿玉姐应该不会是凶手，不然真不知道自己该怎么办了，毕竟当天，阿玉姐是带着优子一起去的。\n而且还有一个很可疑的人!【新苑组】的老大滑头鬼。当天你在查案时他带着手下硬要闯入，要不是你拦着的话，只怕是现场都会被他破坏掉。滑头鬼一定跟这件事有关。当天你们俩发生了争吵，他气冲冲的带着手下走了。但你却开始怀疑，蜘蛛老人有可能是知道什么事，被灭口了\n虽然这起案件还未结束，但对你也没有太大的影响。你带着蜘蛛老人的尸体回到天御院,将尸体交给同事验尸，偶然间你听到你的同事在聊天。说京都地区的主神，【稻荷神大人】过几日要从神域下来。亲自选一个神使。而且稻荷神大人会满足新神使一个愿望!也就是说，如果你能成为新神侍的话，就能请稻荷神大人给优子她想要的自由了!虽然你不知道稻荷神大人选神使的条件是什么，但你却打定主意一定会努力争取这个机会!\n你赶忙飞到旅馆想告诉优子这个好消息。你却从天上发现旅馆的后门处。有一只狼妖倒在了那里。你立马飞下去查看什么情况。发现狼妖已经失血过多死了。\n你检查了狼妖的尸体，初步断定死因是胸口处的穿刺伤，凶器初步判断是一柄3寸左右长的双面尖刃，伤口是自下而上的口子。\n如果时间够得话。你肯定可以找到凶手。大致方向已经有了，或者立刻将案子上报到院里，立案侦查。这本就是大天狗的职责。可当你拿起千里传音器准备拨通上级电话时却犹豫了，过两天稻荷神大人就要下界来狐狸旅馆了，如果这个时候爆出旅馆发生命案，旅馆肯定会被暂时查封，如果稻荷神大人因此不来了，那帮优子实现自由就不行了。更何况这是优子想要保护的旅馆，她一定不想旅馆发生这种事。\n你放下了手中的千里传音器，将尸体拖到了湖边的石头堆里藏了起来，然后把调查到的资料和线索保存在天御院的大天狗查案专用app【妖怪大百科】上，决定等选召活动结束后再详细调查。\n",
      "Script": "【清晨的阳光】\n今天一大早你就醒了。天还没亮你就到了旅馆。清晨的旅馆很安静，大家似乎都还没有起床。你小声的走到大厅，发现平时热闹的大厅中静静无声，倒也别有雅致。\n来到大厅后你发现在桌子上放了一套崭新的妖怪牌。你心里想着之前找人打听稻荷神大人喜欢打妖怪牌，你也恶补了打牌的规则，想给自己加几分胜算。你拿起这套牌看了看，然后又按着规则将它分成8份放好。正想模拟着打一把，阿玉姐姐和风一郎就一起来到了大厅.你看到后就没在动牌，让它保持分好的状态。你心想着，反正一会也要发牌。过了会有一个有些陌生的身影来到大厅，是那个雪女。你听优子提起过这个奇怪的雪女，但不知为何她径直坐在了你的旁边。你看了她一眼，突然想起你父亲和雪女失踪的案件，想着总算有机会问她了。你正想开口询问，那个讨厌的滑头鬼就走了进来。他跟每个人都打了招呼，看了你一眼后他坐在了你的另一边。没人讲话，整个大厅安静的可怕。桌子上放着分好的妖怪牌。可是并没有人想开始。随着一阵奔跑声，你看到红色的小暖拖着你的优子跑了过来。看到优子的瞬间你多想跟她打招呼，摸摸她的小脑袋。可是她看了你一眼后却坐到了你的对面，一时无言。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "【愿望？还是守护】\n你没想到居然发生了这样的事，京都地区的主神大人竟然死在了你的面前，你还说要守护京都，事到如今却连最重要的神明大人都没守护好。\n听着那神使所说。这个旅馆一定要被毁掉，你当时在优子的眼睛里就看到了绝望和心碎。是啊,这是优子拼尽全力想要守护的地方，这有她的家人。也是你的家人。\n事到如今你该守护什么?\n优子。一定要保护好的优子。一定要帮她保护好旅馆，这是她的家。优子只有你。做她的后盾，做她的力量。\n优子和狐狸旅馆。还有整个京都的安危，都要拜托你了,祭博明!\n",
      "Ability": ""
    },
    "滑头鬼": {
      "Story": "早已忘却你的名字，因为所有人都尊称你【滑头鬼大人】\n一你的身边围着无数的妖怪，可你却一直孤独，直到你找到了那里。\n【少年的孤独】\n在京都附近的一个贫民窟里是，你的记忆开始的地方，这里住的妖全是不愿融入人类社会，反感人类的。这些妖因为对人类的敌视。被京都的执法组织——【天御院】的大天狗们赶到了这不见阳光的破败巷子里苟活着。你听邻里说你是被人丢在这条巷子的，当时丢下你的女人似乎在被什么人追赶，把你藏在了垃圾桶里就跑了。你被好心的邻居们一口一口的养着。倒是也平安长大。吃百家饭的孩子又能有什么未来呢?长大的你也不再好意思去邻里蹭饭了。在这贫民窟里谁都不容易。为了生存，你学会了偷东西。一开始只是些食物，后来就变成了财物。直到有一次你偷东西被发现了。不巧的是你偷的人是这贫民窟的混混头子。他抓住你后准备把你往死了揍。无奈之下你只能动手反击。没想到你天生就有战斗的天赋。那个小妖没打过你。恨恨的跑走了。\n之后你就再也不偷偷摸摸的了，开始正大光明的去抢，你专门去抢那些混混，靠着不要命的狠劲和天生的战斗天赋。没过多久你就成了贫民窟的老大。你接济邻里。照顾跟你一样的孤儿。日子也算充实。但是那些曾经养育你的邻里对于现在的你却变得客气和害怕。随着你的年龄渐长。你不甘心只在这贫民窟里。你有更大的目标，你想去京都。想给这些妖们一个好的生活环境，想让他们像你儿时那样与你亲近。你听说在京都有一个组织叫【新苑组】,只要你有本事就会接纳你。给你机会。所以你打算去京都寻找这个组织闯荡。\n虽然你一腔热血。但没人引荐。你找不到进入【新苑组】的方式。某天，你听闻在京都稻荷神社旁的深山里有一家狐狸旅馆，那里供奉着稻荷神给妖怪们参拜。只要你用心祈祷,就能实现你的愿望。于是你抱着碰运气的心态就来到这家旅馆。向稻荷神许愿∶自己能顺利找到并加入【新苑组】，在组织中打出自己的天地。许愿后神龛突然发光，然后在神龛前出现了一个御守，你拿起御守想要打开却发现怎么都打不开。你不知道你的愿望能否实现。但你还是把这个御守放在了自己身上随身带着。旅店的老板娘是一只白色的九尾狐狸。她听到你的祈祷说，她正巧认识人能引荐你加入那个组织。你惊喜万分，感谢了老板娘后根据老板娘提供给你的地址，找到了这个组织。你展示自己的战斗天赋和实力后顺利的成为组织里的一名小弟。\n虽然你只是一名小弟，但因为你拼命，底子又好。在组织中一路晋升。直到有一天，组织的老大要亲自召见你。看看最近组织内最耀眼的新星是怎么一号人物。你万分雀跃。这就是你一直等待的机会l可是见到老大那一刻。你和老大都愣住了。你发现【新苑组】的老大，居然也是一只滑头鬼!因为滑头鬼这类妖怪在整个妖界都不多见，开且大生是做头领的料。老大问起了你的身世。你说起了你在贫民窟的往事。\n老大听完后万分激动，他从那个高高在上的位置上颤颤的走下来仔细的端详了你许久，又看了看你的手腕。那里有你出生时就有的一个红色的小胎记。他看到胎记后热泪盈黾的将你抱住，说:\"儿啊。是我这个当爹的没用，才让你吃了这么多的苦啊...\"你愣住了，你怎么都想不到这个京都所有妖怪的大统领居然是自己的父亲。他跟你讲述了当年你的母亲在刚生下你不久后，你们母子就在外出时被仇家掳走，从此杳无音讯。他花了大半生寻找你们却一无所获。\n之后你就留在了父亲身边做他的左膀右臂。没过太久父亲就对你说他现在年事已高，看着自己的儿子如此优秀，决定把【新苑组】老大的位置传给你。他就此隐退，想要专心去寻找你的母亲。就这样，你成为了整个京都妖界的统领，维系妖界的安定。\n【青年的孤独】\n你的父亲隐退后不久就外出了，也不经常与你联系。你在京都买了一个大院子，将以前的邻里兄弟都接了过来住在一起。你完成了你最初的目标。大家在这里其乐融融的生活着，喝酒打牌好不快活。只是你却再也找不回当初的那种感觉，你只觉得自己的位置越来越高,离他们越来越远。他们曾经总会叫你【小滑头】，可如今无论岁数。哪怕是曾经养你很久的婶婶见了你也要对你行个礼，称你为【滑头鬼大人】。你知道，你回不去了。那个年少的岁月。\n你的组织下设有多种部门。其中有一个暗杀部门。里面的杀手大多都是镰鼬。其中最厉害的杀手是一只镰鼬，名叫风太郎，他是整个京都最厉害的杀手，任务从未失败过。因为你与他年纪相仿，所以关系很好，超越过上下属的关系。反而更像兄弟。你知道他并不是很喜欢杀戮，他这个京都第一杀手的业余爱好。居然是做料理。不得不说，他也确实做得一手好菜。就连他的妻子都是被他这手好手艺骗来的。\n一天。你的一个负责情报的手下来通报。说京都附近最近恐生事端。两个狐妖村发生了一些争斗，其中一个村的村长还雇了杀手去暗杀对方村落长老的独子。作为维护妖界安定的统领。你不能让这样的事情发生，你怕会引发两个狐村的战争。所以你派风太郎去保护那个狐狸村长老的儿子，走之前风太郎欲言又止，你知道他的妻子刚怀有身孕。所以宽慰他。说等他回来就放他个长假在家好好陪老婆。\n可是足足过了一个月都不见风太郎回来。你怕他出了什么意外便派了一个人去查看。这个探子回报说那个狐狸村长老的儿子被杀害了，风太郎也不见踪迹。不过两个狐狸村并没有发生战争。你派了很多人去寻找，但连风太郎的妻于也个见踪影。在他家只发现了一个纸条,\n上面写的∶老大。无论这次任务是否成功，我都要隐退了。对不住了老大。不能和你一起并肩战斗了，原谅我。看到纸条的你突然感受到前所未有的孤独感。唯一一个与自己并肩，可以称兄道弟一起饮酒战斗的兄弟也走了。你又是一个人了。\n【溺水的孤独】\n你在许愿后经常去狐狸旅馆吃饭，你承诺老板娘说用自己老大的身份保护旅馆安全。也就一直没付过饭钱，明目张胆的蹭吃蹭喝。而狐狸旅店原来的老板娘晋升去神域当神使，现在的老板娘是一只新的九尾狐，名叫【阿玉】。阿玉也是你看着从旅店的侍女一步一步当上了旅店的老板娘。所以对阿玉的感情还更深一些，阿玉就像你的一个妹妹。看着成长的妹妹。现如今哪怕你经常来蹭饭阿玉也就是笑骂你两句，但筷子照摆。\n近日你听闻富士山的雪女失踪了。京都附近的富士山其实是一个活火山，而生活在富士山的雪女一直用大雪封印火山。不让火山爆发危害京都。而雪女一族一直有一个诅咒，雪女一生都无法遇到真心对她们的人。她们只会被伤害。因为只有这样雪女的法力才会更加强大,雪量才足够封印火山。作为妖界老大的你深知此事的严重性，立刻动身前往富士山调查。\n在去往富士山的路上，你看到了一只小雪女。头顶满是乌云，一边踢着石头一边说∶杀死世界上所有的男人。你一看便明白了，这小雪女也受到了伤害，不知被哪个男人欺骗了。你肯定不能让她杀死所有男人，毕竟你还不想引发人妖大战，看着这个危险的小雪女，你决定帮她驱散那些乌云。解开心结。你在这只雪女身上感受到了和你相同的气息，那是一种溺水的孤独感。你心想着。你救不了自己，但你想帮这个小雪女。这可能就是同病相怜的惺惺相惜吧。\n你上前问到\"你是富士山上的雪女吗?\"她看着你冰冷的说\"那是我妈妈。她失踪了，我这次下山就是想找到我的妈妈。\"你听完后对她伸出了一只手，\"我是京都的妖怪统领。滑头鬼大人!此次专程来调查富士山雪女失踪事件的。既然她是你的母亲。你愿意帮我调查吗?\"她犹豫半晌后冲你点了点头，并没有理会你伸出的手，只是对你说她调查了，据说当年掳走她母亲的是一个背生黑翅的妖怪，翅膀上还有个月牙，上面有一个圆的胎记。\n你把手尴尬的收回。继续说道，\"雪女失踪了怎么这富士山还是皑皑白雪啊。看来小雪女灵力也很强大嘛!\"你看着他头上的乌云，想伸手去推走它，手刚碰到-一个角，就被冻的缩了回来。\"这是啥啊。你头上这玩意能消散不?\"她边向前走边冷冷的回答\"不能\"。你追了上去问到\"那你能开心点吗?\"她看了你一眼。说到\"不能!\"\"那你能笑一下吗?\"\"不能!\"\n你尴尬的咳嗽了一下，继续说到\"好吧!那你可要跟紧我!我们去京都，那儿是我的地盘,到处都是我的兄弟，你跟不紧，受欺负了我可不管喔l\"她看着你的样子，好气又好笑。和你打了声招呼，转身回富士山上下了两年都不会融化的雪，下山后，你们踏上了去往京都的路。\n路上你都看着她头上的乌云，一直问她\"你的乌云怎么形成的啊。乌云能消散吗?\"\"你能开心点吗?\"\"你能笑一下吗?\"而她却懒得理你，终于到达了京都。你带她到了一个大院子里,让她在这住下。你院子里的妖怪还从未见过你和哪个女妖怪这么亲近过，都欢呼着打趣你,你也懒得解释，就说让他们带着雪姬一起多玩玩，她心情不好。可是过了好多天，你在院子的树上晒太阳的时候发现，其他人都在喝酒打牌欢声笑语。她却像个格格不入的幽魂一样,顶着头上的乌云飘来飘去的。从来不理其他人。似乎她头上的乌云更加浓密了，你无奈。却更加觉得她像你。你也更想帮她。\n有天你发现组织门口有一只镰鼬。还摆了一个旋风刃的姿势。你记得旋风刃是风太郎的独门绝技。你以为是风太郎回来了，激动地喊着他的名字，可当这只镰助转过来你才发现.眼前这只镰鼬跟风太郎长得很相似，但是却比风太郎年轻太多了。你连忙询问他是谁，他说他叫【风一郎】，想投奔这里做一个杀手。你问他是否认识风太郎。他惊讶说那是他的父亲。\n你问他风太郎现在在哪，他说父亲在老家开了一家料理店，天天在厨房削土豆。村里的其他人都是职业杀手。可他的父亲只教他做厨子。你听后想了想，突然明白了风太郎当年的不辞而别。你也理解了他所选择的和放弃的。你告诉眼前的少年他父亲的辉煌事迹。告诉他,你的父亲所做出的选择是非常需要勇气的。少年似乎很惊讶，完全不敢相信自己的父亲曾经是京都第一杀手。你对他说。既然想做杀手就留在这吧。只见他犹豫了一下，突然说，算了，也许做个厨子也不错呢。说完后辞别你便离开了。你觉得这少年倒是有几分当年风太郎的心性。\n但让你没想到的是。之后你去狐狸旅馆蹭饭。却看到这个少年在狐狸旅馆做厨子。他看到你也很惊讶，阿玉倒是见怪不怪，说来尝尝。我新招的厨子手艺怎么样。你吃了些，有点遗憾。这手艺当真赶不上当年风太郎手艺的十分之一，只是刀工还不错。于是你到厨房对风一郎笑道。小伙子。以后的路还长呢，你以为厨子就好做啦，哈哈哈。继续努力吧。不过毕竟是兄弟的儿子，还是要照顾，之后你就更加频繁的去狐狸旅馆蹭饭。美名其曰:看看他有没有长进。\n狐狸旅馆给你的感觉不同。在这里你不再是那个高高在上的妖界统领。而是一个哥哥,一个长辈。在这里你能短暂的忘却那种孤独的感觉。这时你突然想起另一个人，那个跟你一样孤独的小雪女。如果带她来住一住，她会不会开心一点?\n你赶紧回去对雪姬说\"我带你去稻荷神社祈个愿。散个心呀。\"她还是冰冷冷了说了句\"不去。\"你想了想，怎么才能骗她去呢?毕竟你之前已经查到并告诉她。背生黑翅的妖怪就是大天狗。于是你接着说\"稻荷神社旁有个狐狸旅馆。那里有很多大天狗。你可以住在那里看能不能遇到带走你妈妈的大天狗。\"听到有可能找到妈妈的下落。她立马答应了。你们来到了狐狸旅馆,阿玉给她安排在了后院的一个房间。你拉着她去神龛许愿，说这边许愿很员。她一脸无奈的做了祈祷。可是她祈祷之后就立刻回了房，还用冰把所有门窗全都用冰封上，不让任何人进出。\n狐狸旅店有一个侍女叫【优子】，是一个只有几十厘米的人偶娃娃，跳起来只能打到你的膝盖。你觉得这人偶娃娃很是可爱，就经常逗她玩。可她似乎不怎么喜欢你，跟你并不亲近。不过最近还新来了一只红色的小狐狸，名字叫【小暖】，她很喜欢吃一种爪爪形状的饼干，每次见到你都会请你吃饼干，你看着她就跟看小女儿一样，又可爱又温暖。你经常会带她出去玩，放风筝啊采花啊抓虫子，在一起玩的非常开心。你还经常给她带小礼物。好吃的。\n你看天真善良的小暖。突然想到雪姬。不知道小暖能不能温暖雪姬呢?于是你一脸郑重的拜托小暖。请她去给雪女送饼干吃，因为雪姬一个人很孤单。小暖若有所思的点点头。说∶滑头鬼叔叔你拜托我的事。我一定会做到的!你很希望小暖能够温暖雪姬。而你也会努力。\n你有一个忘年交叫【蜘蛛老人】，他在俗世开了一个八宝琉璃坊。他是这些年你唯一交心的朋友。他还亲自为你打造了一把锋利无比的名刀名叫鬼丸。这也是你最爱的刀。你有事没事会去找蜘蛛老人下棋喝酒，谈天说地。\n近日你手下的狼妖一族的首领跑来找你。说有要事相报。狼妖一族虽然很忠诚。战力也很强。但是他们智商不高。你作为他们的统领也很是苦恼。因为他们无论大事小事都要来找你定夺。这小狼很紧张的说他们狼妖一族的至宝【妖珠】丢失了。那颗妖珠蕴含着最纯正的狼族妖力。是守护整个狼妖的宝贝。但前两日却有一个小偷偷走了这个宝贝。你思索了下，此事不宜声张，若让其他种族知道此事。趁机找狼妖一族的麻烦可不好。所以你下命令让来报告的这只小狼先去追踪一下小偷的踪迹。这小狼一脸郑重其事领命而去，你也把这件事记在了心上。\n【孤独的解药】\n最近有一只大天狗找到你。你一向讨厌大天狗，但这个大天狗却有些不一样，他说他是现在的大名的儿子，他是最有希望成为下一任大名的大天狗。他也讨厌自己父亲的一些作风,想要与你合作。因为他有一个弟弟，最近升的特别快。可能会威胁到自己的位置。希望你能帮助他除掉自己的弟弟，你从他那得知他的弟弟羽毛上有一个胎记，他描述的胎记与雪姬告诉你的掳走她妈妈的大天狗有相同的符号，于是你便把这件事放在了心上。\n近日你的小弟突然来报告说八宝琉璃坊的蜘蛛老人被人杀害了，你激动的要去看看情况,但在门口一只大天狗拦住了你的去路。你发现它的翅膀上就有那个胎记。你说你是京都妖界的老大。要去送朋友最后一程，凭什么不能进。他却说你算什么妖界的老大，无非就是个混混头子。说他是负责这个案件的警察，不允许你进去破坏现场。你对他心怀恨意，派人暗中调查这件事，你的手下告诉你最后见到蜘蛛老人的是狐狸旅店的老板阿玉，你是相信阿玉的，但蜘蛛老人对你也是很重要的朋友。纠结半天。你还是派了狼族的一只小狼去调查阿玉最后见到老人都发生了什么。\n你照例去看望雪姬。你发现她头上的乌云最近有所消减。小雪女告诉你她找到了她母亲的消息。听说她母亲因为精神失常，冰封了富士山周围的好几个村落。天御院派了个有胎记的大天狗前去消灭雪女，而那只有胎记的大天狗也经常来狐狸旅馆。还与那个人偶娃娃优子走得很近。雪姬似乎刚刚哭过，哽咽着说她一定要杀了这个大天狗为母亲报仇。你看着她,一本正经的问到，\"杀了他你头上的乌云能消散吗?\"她含泪点了点头，你继续问到\"那你会开心点吗\"，她哭着说\"会\"。你看着她坚定的说到:\"那我就帮你。一起杀了这只大天狗!”\n可是怎么才能杀了他呢?雪姬提议说∶旅馆里大家经常会一起打妖怪牌。而大天狗从来不参与，那么打起牌一定会是新手，不知道能不能利用这个点。你告诉雪姬。前几日偶然听小暖嘟囔过说不久后稻荷神大人会来到狐狸旅馆，选择一位新的神使服侍他。大家都聚在一起,到时组织一场牌局，一定会很好下手。\n你经常打妖怪牌。这是你院子里的妖怪们最喜欢的牌类游戏。妖怪牌的牌中都封着一些可爱的小妖怪的分身影子，每张牌都有不同的属性。如果这牌和你自身的属性相同你还可以与牌建立联系，驱动同属性的牌。甚至释放一点小小的符咒来恶搞下大家。通过妖怪牌你也了解到这些妖怪牌可是大有内涵的。虽然只有五种妖怪属性，但是这些牌可都是有真实灵力的。妖怪都可以驱动跟自己属性相同的牌。比如滑头鬼是雷属性妖怪，你可以驱动雷系的赤舌牌。你打妖怪牌从未输过，是因为滑头鬼一族天生的领导能力使妖怪牌中所有妖怪都会听从你的命令,所以你可以驱动所有的牌并在其中下咒。\n雪姬说完后你看着她。认真的说到: \"你都不出门,平时也不打牌。你也不会打啊?这样吧，你跟我学。我打妖怪牌从来没输过!\"雪姬想了想，用法力捏了一个小雪人。放在了你的衣袖里，她通过这个小雪人跟着你学打妖怪牌，你从来没有输过，但是小雪人会化,每次只能学两局，两局后，你就会拍着桌子说。\"不打了不打了，你们这群菜鸡，回去好好练练再来和我打。\"\n就这样过了几个星期，你觉得雪女学得差不多了。晚上，你来找雪姬并对她说∶明天就是稻荷神大人来的日子。你准备好了吗?雪女默默地说∶我早就，准备好了。\n",
      "Script": "【清晨的阳光】\n今天你很早就起了床。偷偷跑到雪姬的房间外面。透过冰封的窗户看着里面。没人的时候她很自在。慵懒的梳着自己的长发。你看她收拾好出了房门，你也在门口踌躇了一下，接着也走进了大厅。\n来到大厅后你发现大家基本已经都坐在大厅内了。桌上还放着妖怪牌，看起来已经洗好分好了，但是大家却并没有开始打牌的意思。你觉得气氛有些过于凝重。所以打着哈哈和每个人打了招呼。接着你看了雪姬一眼。果然你们计划的一样，她坐在了大天狗的一侧。你也晃悠着坐到了大天狗的另一边将大天狗夹在你们中间。这就是你们制定好的计划。过了一会，火红的小暧拉着人偶娃娃优子也进来了。大家坐好后，一时无言。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "【孤独？还是遵守诺言】\n你没想到这和你最初的计划相去甚远。不但大天狗没有死，反而死了个最不应该死的。再怎么说这稻荷神也是京都地区的主神大人，无论如何这事是无法善终了。\n关键是现在的情况，雪女成了最大的嫌疑人，她是最后一个给神明大人递牌的人，而且你们也确实有计划对牌动手脚。你不确定稻荷神大人的死亡与你俩是否有关系。但是你知道你在你的所有手牌中都下了弑妖咒，你原本计划猜对牌后退牌给大天狗，而这牌中的弑妖咒会立刻要了他的命。但是你猜错了。你没有机会递牌给他。你又不想伤害小暖，所以才把大天狗给你的那张没有咒的姑获鸟给了小暖。所以稻荷神的死与你是没有关系的。\n但是雪女怎么办?你还说好要帮她驱散乌云，要让她变得快乐，可如今这种情况，连保护她都变成了一件极其困难的事。可是即使是这样，就真的不去管这个可怜的小家伙了吗。\n而且刚才那两个神使也说了。无论如何这个旅馆都要被毁掉。可这是你唯一逃避孤独的地方，你在这白吃白喝了这么久，也承诺了如果旅馆出了事。你一定会保护好大家。\n你可是整个京都妖怪们的老大啊。滑头鬼大人，你是否要遵守承诺。守护好狐狸旅馆呢?\n",
      "Ability": ""
    },
    "九尾狐": {
      "Story": "你叫阿玉，是狐狸旅馆的老板娘\n——明明是困住你的地方。你却越来越舍不得离开\n【真挚的爱恋】\n你是一只白色的九尾狐，出生在离京都很远的山村里。你们村里全是白色的狐狸,而你是这个村最漂亮的小狐狸。你最好的朋友。也是青梅竹马一起长大的，他叫【阿狐】，是族长的儿子，也是从小你们的父母就觉得如果你们在一起应该会很合适。对于这件事你们彼此也一直心照不宣。\n可能是因为你心里向往热闹的生活。所以你-直很羡慕有兄弟姐妹陪伴的家庭。你很喜欢小孩子，经常跑出去和村子里的小狐狸玩耍。你心里一直期待着快快长大，和阿狐成亲，再生一只可爱的小狐狸。然而你们狐狸怀孕要怀很久才能生宝宝，于是你私下找到阿狐。和他商量着尽快订婚。或者成亲前就偷食禁果，等到婚后。你们就可以很快拥有自己的宝宝了。阿狐当然是十分愿意了。你们趁着父母外出探亲时，一起翻云覆雨。不久。你就觉得自己的身体有些异样，根据你对村里其他狐阿姨的观察，暗自欣喜自己应该是怀了小狐狸了。你每天感受着肚子里的小心跳，想到马上要有自己的宝宝了，每天都过的很幸福。\n你跟阿狐的婚期如期安排着，订婚的日子终于到了，你要去阿狐家举行订婚宴。去的路上你看到了只脸上有疤的镰融一闪而过。你在心里犯了嘀咕，在村庄里这么久。你连别的颜色的狐狸都没见过，怎么会有这种动物存在呢?而且它来的方向还是阿狐家，你赶紧跑过去,却发现阿狐的父母跪在地上哭，而阿狐却倒在了血泊中。\n突如其来的灾难让你失魂落魄，你回了家，把自己关在家里三天三夜，父亲趴在你的门口，担心的对着门里说到\"还是把肚子里的打了吧，阿狐都不在了，还好你们没结婚，这件事就别传出去了，咱们都不说，以后还有机会的。\"你哭的嗓子都哑掉了，。用尽了力气对门外的父亲说到。\"不行，我要把我孩子生下来。我跟阿狐青梅竹马这么多年，我不能做这种无情无义的事情。\"你的父母拗不过你。只得同意了。过了几年。你把孩子生了下来，那是一个超级可爱，白白的软软的小狐狸，你叫她小小白。小小白从小就听话懂事。你心里想着，以后就这么陪伴着女儿长大,和父母女儿一起平淡的生活着,也算是幸福了。\n你知道你们狐妖村是有一个使命的。在京都。有一位主神大人，【稻荷神】。传说他的前身是稻米，因为人们虔诚的向种下的稻米祈祷。希望自己来年能够丰收。这种力量滋养出了叫稻米妖的妖怪，但是他们是善良的。随着人们的夙愿越来越强烈心也慢慢虔诚。渐渐地把稻米当成一种信仰,人们的信仰汇聚成力量。稻米妖就变成了神，成为了稻荷神，后来搬进神域去居住。\n稻荷神就是京都地区供奉的主神。他有一个特性。听说和蔼可亲的他哪都好，就是需要很多的侍者去服侍他。因为是稻米的原因。胖胖的他。有圆圆的肚子，圆圆的脸，还喜欢毛茸茸的动物。所以他的侍者都是狐狸和狸猫。\n也是因为这样的原因，整个京都地区的狐狸。无论是村落还是家族。他们都以能成为稻荷神的使者为梦想和目标，对于所有狐狸而言这是一个非常光荣伟大的任务。你只要成为了神的使者，跟着神进入神域生活。你就可以一跃从妖变成神了!你们村是给稻荷神做【扇扇神使】的。你曾经也幻想过，如果有一天能选上你做神使就好了。你小时候也为此修行过很久,只不过现在你有了孩子。也就没去修行了。\n小小白大概一岁多的时候，村子里来了一个神使，他来选下一任扇扇神使的候选人。被挑中的候选去要去京都一个叫狐狸旅馆的地方修行。你并不想去，你现在有了小小白，只想和女儿一起生活。可谁知鬼使神差的就挑中了你。可能是因为你长得最好看，毛色最光亮。你根本不想去。只能跟村长商量∶我能不能不去?我得把女儿养大啊，她还这么小。离了妈妈怎么办?村长板着脸的对你说∶如果因此惹恼了神使，惹得稻荷神大人不快的话，明年村里收成不行，你负责么?村里饿死人你负责么?这么光荣的事你还敢不去。你就是想让父母饿死，让整个村子的人都饿死是吗?如果你担心这个孩子，那就交给我们养啊?我们当然不介意。你一听这样的连着哄骗带威胁的话。看来只能去了。\n可你实在放心不下小小白，就对神使大人求情，希望能带着女儿一同前往。神使大人笑着对你说，\"你想什么呢，去做神使还要拖家带口吗?\"你又求情到,\"我能不能经常回来看看她?\"神使又对你说，\"不要和我讲条件了。除非你当上神使。想做什么随你去，修行过程中,你就给我老老实实的待在旅馆里。哪也别想去!\"你继续问到能不能偶尔回去看看她。连最后这点要求也被拒绝了。没办法，你只能独自前往狐狸旅馆。\n【努力的目标】\n来到了狐狸旅馆之后，你清楚了扇扇神使的修行方式。需要从最基础的侍女做起。每天的修行就是打扫卫生，接待客人。上菜送酒等。如果做的出色就能当上老板娘。当上老板娘之后。稻荷神大人会亲自来到旅馆检查修行的成果，够格了才能被挑选上去当神使。于是你拼命地工作，别人擦一遍地，你擦十遍。你怕当不上神使就要一直留在这里修行。所以非常拼命地干活。\n当时的老板娘也是一个九尾狐。她看着你就觉得特别欣慰，温柔地对你说，\"阿玉，我相信以后你就是我的接班人了。我会好好培养你的。\"她对你特别好。你们旅馆经常会有一个头特别长的妖怪来蹭饭，旅馆的大家都叫他【滑头鬼大人】。他经常很拽地对老板娘说∶老板娘啊。你这以后有啥事就找我。我平竟是京都的老大对不对?都包在我身上，我保护你。这顿饭，我就不和你客气了啊！老板娘每次都会笑嘻嘻地给他摆上筷子。轻声细语的说到\"大人你吃你吃!\"但是你每次看着他，都在好奇他为什么吃饭不给钱。不过他对你也挺好的，经常关心的问\"小阿玉啊，你今天有没有努力呀，看，这是我从外面给你带的糖，你快拿去吃!\"其实你都当妈妈了，但在滑头鬼大人的眼里，他永远把你当小孩子看。\n渐渐地你发现这个人其实也不坏。每次见到他就会叫他滑头鬼哥哥，你们的关系一直非常好。后来老板娘就被挑走了，你也顺理成章地做了狐狸旅馆的老板娘。你很开心，暗暗盘算着再熬几年自己差不多也就能回家了。你想起以前刚来的时候，你就在神龛前许过愿∶希望你能早点当上老板娘被稻荷神大人挑选成为神使。能让你早点回家和女儿团聚。许愿后神龛突然发光，然后在神龛前出现了一个御守，你拿起御种想要打开却发现怎么都打不开。你不知道你的愿望能否实现。但你还是把这个御守放在了自己身上随身带着。\n果然没过多久你便成为了老板娘。你觉得许愿还挺灵的。后来你当老板娘之后。滑头鬼大人就更加频繁的来旅馆了，一坐就是一下午，和你喝酒庆祝。欣慰地对你说。\"真厉害，真不错。小阿玉我就知道你有能力可以当上老板娘的! \"但你当老板娘后没多久，你们旅馆的厨师辞职回家了。没办法你只能自己先下厨做饭顶一段时间，看看能不能找到新厨子，但是你做饭却不怎么好吃，只有章鱼烧还拿的出手。\n有一天,旅馆来了一个陌生的客人。是一只镰鼬。你看见镰鼬气就不打一处来，你现在被困在这都是因为这些镰鼬!不然你和阿狐还有小小白一家三口肯定幸福的生活着。那个镰鼬对你说。\"老板娘啊。我肚子饿了。有饭吃吗?\"你没好气的对他说，\"点!\"你把菜单扔到他面前。他点了好几个菜。问能做吗，你都嫌弃地说∶不能!直到他最后小心翼翼的问∶那…章鱼烧能做么?你正想继续拒绝他,但想了想毕竞还要做生意呢,还是没好气的去厨房做章鱼烧了。\n厨房的你越想越气。故意加了各种调料。做的特别难吃。做好后你就端出去给他吃,镰鼬吃了一口,默默看了你一眼，然后就吃完了。你还想他是不是傻了。这么难吃居然吃完了。但他却委屈的看着你说到∶老板娘。就你这手艺还开店啊?他居然嘲讽你!气得你'啪'的一拍桌子∶不吃滚!他被你吓了一跳。呆呆的望着你。你想了想。虽然你讨厌镰鼬。但至少眼前这个小镰鼬是无辜的，阿狐也不是他杀的啊。这样似乎确实有点过了。于是你缓了一口气，说到∶我家厨师辞职了。你要吃就吃，要觉得不好吃这个钱就算了。镰鼬眨眨眼睛说∶其实...挺好吃的。对了，你这能许愿吗?\n你带着他去神龛许愿，听到他对稻荷神大人许愿说希望能让他成为京都第一杀手。你心里默默地生气，镰鼬果然没一个好东西!他许愿后问你道∶老板娘。你这个知道京都哪里能做杀手吗?你原本不想理他，但你看着他有点傻的单纯眼神。想到了滑头鬼大人。滑头鬼大人可是整个京都妖怪的统领。它有一个【新苑组】。应该会有机会吧，你心一软。给他写了地址,介绍他过去了。\n可是谁知过了两天。那镰鼬又回来了，回来之后找到你说。老板娘\"你这还缺厨子吗?你看我行吗?\"你疑惑的看着他，不知他这是搞哪一出。他看你不接话忙问∶你是不是看不起我,我刀工可好了!然后自己拿着土豆使了一套旋风刀法，把土豆削得干净极了。你看他刀工还司以，正好你做饭也做烦了。就答应了让他留下试试。你也知道了这只小镰鼬的名字，叫【风一郎】。\n但没过多久你才发现。他料理的水平也就比你强了一点点，只是刀工很好而已。但是他很努力，每天都在练习做料理。而且他还经常来问你。\"老板娘，你今晚想吃点什么?我熬了红豆汤。你想不想喝?\"其实你也知道你只不过因为当年的事，对镰鼬这个种族有偏见而已。慢慢熟悉后你发现风一郎其实是个很努力上进的阳光大男孩。也就对他很温柔了很多，偶尔会帮他做套新衣服，买双新鞋，收拾下房间。毕竟共同生活在这个旅馆，也算是一家人了。\n旅馆里经常有一群大天狗聚餐喝酒，大天狗隶属于【天御院】。他们是神域的神明大人钦点的正义使者，守护京都的平安。但他们这帮家伙天天在这吃喝却从不给钱，只记账。毕竟是公务人员，你也不能闭门谢客。你也拿着帐本去天御院要过帐，可他们也推三阻四，你也拿他们没办法。\n但是有一只天狗不一样，这天狗叫【祭博明】。他还是一只普通的天狗时就来过旅馆。还是个少年的他特别有礼貌。第一次见你时问︰请问,这儿可以许愿吗?你也知道了，原来天狗是分等级的，有天狗、乌天狗、大天狗、大名。大名是天御院最高级别的存在。这乌天狗就是没有正式权利的协办。你听到这只小天狗许愿说到,\"希望能请您保佑我，有一天能努力成为乌天狗，然后成为大天狗!\"这小天狗他还挺可爱。毕竞大部分人向神许愿,都是希望走捷径。\n后来他也经常来旅馆吃饭，但他从不跟那些大天狗一起喝酒。每次都是一个人坐一个小桌，慢慢的吃喝。吃完之后也会付钱。有一天他兴高采烈地找到你。对你说他当上乌天狗了!可以帮大天狗他们一起办案子了,可以守护京都了!你从心底为他高兴，给他准备了一顿丰盛的大餐，和他一起庆祝。\n后来又过了两三年，他已经长很高了，而且还有一双黑色的大翅膀。他走进旅馆对你说他被破格提升成大天狗了，还破了好几个大案子。听到这些你也很高兴，看着他一步步凭借自己的努力当上了大天狗，你拿出了一瓶你珍藏多年的好酒说到∶来来来咱们庆祝一下!吃着喝着大家都很开心。你郑重的对他说∶你现在也成了大天狗，我委托你一个案子吧!你把阿狐的事原原本本的告诉了他，希望他能帮你调查阿狐的死。大天狗说到，\"行。你放心。阿玉姐姐，你对我这么好，我一定会想尽全力帮你找到凶手。\"\n日子就这么过去了，你也越来越思念小小白。在京都的一个巷子中有一间八宝琉璃坊,老板是一个蜘蛛老人。他是一个手工匠人，帮妖怪打造一些法器什么的。他还给你做过梳子镜子等一些小东西。而八宝琉璃坊也是一个信件中转站。你通过他来跟你的父母传递信件，从信里知道你知道小小白哪天会爬了，哪天会喊妈妈了。她长大后会奶声奶气的问妈妈去哪儿了。妈妈什么时候回来。每次读信时你都会潸然泪下。你已经走了四年了，也不知小小白长大了多少。\n有一天你去送信的时候，路过了一个垃圾桶。你发现垃圾桶有很多怨气积在上面，你过去把垃圾桶打开，发现里面有一个20厘米左右的破损的人偶娃娃,她的脸是花的,身上掉漆,衣服也是破的，身体上面有很多怨气。你心知如果把这个娃娃留在这里，过不了多久就会变成一个诅咒娃娃的。于是把她带到了蜘蛛老人那，请老人看看能不能把这个娃娃修复。蜘蛛老人不愧是京都第一手工匠人，随手一修就把她变的跟新的一样。你看着娃娃精致可爱的样子。准备把她送给女儿。当你拿起她后发现这个小木偶中竟有丝妖力。好像不是普通的木偶。你决定先把她带回旅馆。\n回到旅馆以后。这个小人偶竟奇迹般的动了起来，不但会动还会讲话，她甜甜的说\"谢谢你，好心的大姐姐。我叫【优子】，是一个被人抛弃的人偶娃娃，不过我也没想到在这旅馆里我居然可以动起来。\"你可能是因为她的灵力太弱了。而旅馆是离神域最近的地方，灵力很充沛，所以她能在这里自由活动。你将她收留了下来。让她叫你阿玉姐姐。你安排了一个房间给她住。因为她很小，一般的家具都用不了，你还专门让风一郎给她打造了迷你版的家具。从那之后她就住了下来，成为了新的家人。\n【烟花下的约定】\n住下之后，优子就变得忙碌了起来，可能是想感谢你的收留，她一定要给你帮忙。你只能让她学着给客人上菜倒酒。但是她实在太小了，跟酒瓶差不多大小。上菜倒酒对她来说都很吃力。时不时还会蹭掉胳膊腿的漆，你很心疼，劝她不要帮忙了，可她却倔强的坚持一定要帮你做事。虽然你叫她优子妹妹。但你感觉她就像自己的女儿一样。你也经常给她做小和服，梳头发，你们也越来越亲密。风一郎也对优子很好，经常给她熬甜汤。做迷你的蛋包饭。你们就像真正的一家三口一般。后来因为渐渐的接触。你发现风一郎对你和优子都很细心很温柔，渐渐的你对他也有种说不清道不明的感觉，但你还是选择无视了这份小小的悸动。\n有一天风一郎突然跟你说，京都附近要开烟火大会了。你想不想去看看去?说着还递上了两张游园票。你看着风一郎真挚的眼神，点头答应了。烟火大会当天。你从衣柜里拿出了最漂亮的和服，收拾得当，来到旅馆门口和风一郎汇合。早就等在旅馆门口的风一郎看到如此美丽的你竟然呆住了。愣了半晌突然低着头不敢看你，轻轻说了句∶阿玉...你今天...好漂亮啊。你轻轻的笑了一下，拍了拍他的肩说∶别愣着了。烟火快开始了，出发吧~\n你跟着他来到山下的祭典上，人来人往。小贩们努力的吆喝着。你从没参加过这么热闹的祭典。有点不知所措。风一郎似乎看出了你的窘迫。拉着你挨个逛着。你们一起买了苹果糖，玩了捞金鱼。还买了妖怪面具。玩了很久后，你们跟着人群来到山坡上准备看烟火。当绚烂的烟火升到半空中炸裂开来。风一郎突然转过头问你︰阿玉。你想让我一直做饭给你吃吗?你打趣道∶怎么?你要辞职吗?\n他红着脸看着你，深吸一口气后大喊道∶阿玉!我喜欢你!你愿意和我在一起吗!看着他红成柿子的脸庞在烟火的照耀下微微闪着光，这时候你才突然发现，你的心里其实早就对风一郎种下了名为心动的小种子，但因为他是一只镰鼬。阿狐又死于镰鼬之手，而你的家乡还有小小白，所以你从没让这里小小的种子发过芽。可不知从什么时候。你心里的这个种子却早已生根发芽。开出了花。但这时你却没办法就这样直率的承认自己的心意。因为你心里还有一个坎。两相纠结之下。你对他说，\"郎。我和你做个约定吧。如果有一天所有人都夸你做的料理好吃，我就答应你。\"听了你的话后他两眼放光，就好像找到了努力的方向，他重重的点头道∶阿玉，你看着吧，我一定会达成和你的约定!\n自从烟火大会回来之后，风一郎的厨房便彻夜亮着灯火。他比平时更加努力的研究做菜,每一个客人都被他骚扰。每来一个客人他就上去问人家。您觉得今天的料理好吃吗?料理水平当然不是一下就能提升的,但他也不气馁，他觉得努力一定会有收获。你也在心里告诉自己,如果他真的为你努力改变。不妨放下心里的芥蒂，试着跟他在一起。毕竟他也是一个很努力的值得托付一生的人。如果他没做到。那就说明缘分没到。就这么过下去也好。\n大天狗祭博明似乎也发现了风一郎对你的变化，偶尔还会打趣你，但你发现他最近来旅馆的目的可没那么单纯。不知什么时候起他和优子走得很近。经常带优子出去玩。你开始有点担心，毕竟优子出去后不能动，也不能说话但是优子每次回来都很开心，在你眼里祭博明也是个靠谱的小伙子。你也就放心了。\n【强烈的思念】\n最近有一只红色的小狐狸突然出现在你门口,看到你以后噗嗤一声跪在你面前说到\"老板娘。你能不能收留我在你这里做侍女。我想在你这里修行,我的梦想是成为稻荷神大人的使者!我会很努力的!让我做什么都可以!。\"你看着她的样子。想到了小小白，她现在应该也有这么大吧，可是你再回忆自己孩子的样子，却发现她的长相在你脑海里已经模糊了，毕竟已经有七八年都没见她了\"好。我给你机会，留在我这里，看看你的决心吧\"。你看着小狐狸总会想起自己的女儿，就把她留下了。\n你让这只叫【小暖】的小红狐狸和优子住在一起。因为她也不高。也就八十厘米左右。两个都是小小的，住在一起也倒方便。但是优子刚开始好像不太喜欢她。不过后来两个人关系反而好的不得了。小暖特别努力。你安排她擦个地。她擦十遍还打个蜡。跟你当年特别像。你有时候和她说∶其实你不用做这么多的。你已经做的很好了。她反而会更加坚定的回答你,\"不行，这是我的修行。而且这是阿玉姐姐给我的任务。阿玉姐姐你对我这么好，我当然要报答你!。\"\n你很欣慰能够遇见这么懂事的小狐狸，对她也格外关心。她有一个爱好就是吃爪爪饼干，那是用她自己的小爪爪印的饼干，她常常见到你就问。\"阿玉姐姐，吃爪爪饼干吗?\"每次吃到饼干的时候你都觉得打从心里有一丝温暖。小暖就像个小太阳一样，可以温暖身边的每个人。你对她格外的好，在你眼中她就像你的第二个女儿，你将所有亏欠小小白的好都给与了小暖。\n小暖和风一郎。滑头鬼大人，大天狗祭博明还有小优子的关系都非常好。她做好小饼干就分给每个人吃。偶尔你也会想，狐狸旅馆就是你的第二个家。这里都是你没有血缘关系的亲人。要是以后你回家了，一定会舍不得他们吧。如果到时候能把风一郎，优子和小暖都带回家就好了。一家人就是要在一起啊。可是优子离开狐狸旅馆就会变成小木偶，这让你也很纠结。\n滑头鬼大人自从风一郎来做厨师之后，来蹭饭得更频繁了，从三天两头变成天天来蹭。有十天他带来了一个客人住店，这个客人是个雪女。她的头上自带一朵乌云。走到哪儿飘到哪，而且这雪女看着就很不开心，阴沉沉的。住进来之后就把门冰封住了，谁也不能进出，就算吃饭。也只要优子把饭送到门口。你也邀请过她几次一起喝酒赏花，每次都被冷冰冰的拒绝。你也释然。如果她想一个人待着,那就不打扰她了吧.\n滑头鬼大人经常带着小暖出去玩。小暖都很开心。后来小暖不知为何。每天都去敲雪女的门。但雪女从不开门。你发现小暖的小爪子上都是伤口和冻疮，应该是敲那扇冰门敲的。你很心疼地劝她不要再去敲门了。小暖却瞪着水汪汪的眼睛看着你说∶雪女本来一个人就很难过。我要是不敲门谁还能去找她呢。你心疼地摸着小暖的头，小心地帮她处理手上的伤口。\n【小小白，等妈妈】\n近日有一个神使从神域下来了。来到旅馆歇脚，晚上和你聊天。说他终于要退休了，在天上给稻荷神扇了500年的扇子，终于可以回家了！你一听立刻急了∶不是说当上神使就能回家吗?他喝了一口水，不屑的说\"那是神使，又不是神!哪能说回家就回家!你上去只是当神职而已，给稻荷神扇扇子。要任职满五百年才能退休。\"你一下就愣住了，五百年?那你还能见到女儿吗?这跟你的计划可完全不一样。不行，你不能让这种事发生。\n你想了半天。只有一个办法了!那个神使说过段时间稻荷神大人会下来选新神使。到时候把他...把他杀死，就可以回家了。狐狸旅馆有一个禁制。每一个来修行的候补都不能离开这里太远，必须得定时定点得回来。如果能杀了稻荷神大人。禁制就能解除了，这一切就结束了。你被你自己这个念头吓了一跳!弑神可是大罪.可是，可是你太想念你的女儿了，尤其是小暖来了之后，你更思念小小白了。你要回家！把这些年缺失的母爱补偿给她。陪她长大。你偷偷去问神使大人，稻荷神大人喜欢什么?你想趁机讨他的欢心。神使说∶你别提了。那个胖子最近喜欢上你们最近打的什么妖怪牌，天天拉着我们打，还输不起，一输就生气。我们就得让着他。\n妖怪牌?那不就是旅馆里大家最喜欢玩的游戏吗!旅馆每周的休息日你们都会聚在一起打妖怪牌。这是妖界最为流行的牌类游戏。你很喜欢打妖怪牌，因为每次打妖怪牌的时候，一家人都会聚在一起，围在暖桌的旁边，嬉笑怒骂的感觉特别温暖。《妖怪牌》的牌中都封着一些可爱的小妖怪的分身影子。每张牌有不同的属性。如果这牌和你自身的属性相同你还可以与牌建立联系，驱动同属性的牌，甚至释放一点小小的符咒来恶搞下大家。狐狸是火属性的妖怪，你可以驱动火属性的座敷童子这张牌，你修行多年。妖力比较强，但你却很少放符咒恶搞别人，毕竟那些都是你的家人。最近滑头鬼大人也经常跟你们一起打牌，但是他每次都赢，但他每次只打两把。打完就说你们太菜了，让你们好好练一下。\n思来想去，不如等稻荷神下来的时候组织一场牌局。趁机在妖怪牌中动手脚的话成功的几率一定很大!可是你并不会什么弑神的法咒，更何况如果用旅馆那套旧牌的话，肯定很容易被人怀疑吧。想了半天，你终于想到了一个办法，去求求蜘蛛老人吧。如果是他的话。一定会有办法的。毕竟你们也是这么多年的老朋友了，他应该会帮忙吧.\n风一郎发现你似乎有心事。拉住你问\"阿玉你这两天怎么了?是不是有什么心事。\"你不知道该怎么开口，只能搪塞了过去。可他却追着你一定要问个明白。你想了想。叫他晚上来你的房间。晚上你准备了两瓶烧酒，等他进来后直接放在面前说∶先干了吧。风一郎二话不说就喝完了。你借着酒劲儿红着眼睛对他说\"郎，我跟你说实话，我不是不喜欢你。也不是不想接受你。只是。我还有个女儿在家乡。我的青梅竹马死了，只有我的父母在照顾我的女儿。你对我的心意我明白，可是我被困在这个旅馆里。不能回家。不能见我的女儿。过段时间还要去神域给稻荷神扇五百年的扇子!对不起，我要回家，所以我可能要做件很危险的事。过两天稻荷神大人来，我就会实行我的计划!我不想牵连你走。你走的远远的，最好把优子和小暖也带着一起走!\"\n他一听立刻打断了你。走过来一把将你抱住说∶你要做这么危险的事我还不陪着你。那算个男人吗?有什么事我们两个人一起扛，你要弑神我陪你弑神!你放心，我一定会让你回家的，你要相信我。\"这句话彻底打动了你，你在心底认定了这个岁数不大的男孩。是一个真正值得依靠的男人。但现在并不是你侬我侬的好时机。你轻轻把头靠在他肩膀上说∶可是约定还是约定，你还是让所有人都说你做饭好吃我才答应你哦。他坚定地说∶好。你相信我。我答应你的都会做到!\n虽然风一郎做了承诺，可以依靠，但你并不想真的牵连他。万一你出了什么事。他还可以照顾旅馆和两个小家伙。所以你并没有把你的计划告知给他。你正准备去找蜘蛛老人。刚好看到优子的左胳膊又掉漆了，正好给优子补个漆。你带着优子去了俗世。把她放在门口。你进去找到蜘蛛老人说明了你的来意。蜘蛛老人看着你说∶阿玉，你为什么要做这么危险的事情!你怕他不答应，扑通一声就跪下了，哭着讲述了你对女儿的思念。\n蜘蛛老人叹了口气说︰行吧，阿玉，我答应你。我可以帮你做一套新牌，但是不能让别人轻易怀疑到你。对吧?不如我在这套牌的每一张牌里都下一个沉睡的弑神咒。等轮到你打牌前。你就启动你手上的任意一张牌中的弑神咒。等你唤醒这牌中的法咒之后。这张牌就会像一个病毒的母体一样，当它接触到下一家的手牌时，那些被它接触过的牌中的弑神咒就统统会被唤醒。接着你的下家无论打出什么牌给下家，那张牌中已经启动的弑神咒就会接着唤醒所有被接触过的牌中那些沉睡的咒。就这样一家一家的传下去。所有手牌中的弑神咒都会被唤醒。但是你的妖力不够，没办法启动弑神咒。你必须去要去找一颗蕴含强大妖力的妖珠，打牌前捏碎这颗妖珠临时增强你的妖力，你可以启动弑神咒了。\n你按着蜘蛛老人的指示找了一天一夜，潜入狼妖一族，在他们那找到了一颗看起来脏兮兮的珠子，虽然这颗灰扑扑的珠子看起来毫不起眼。但你可以明显的感受到其中蕴含强大的土属性妖力。你带着这颗妖珠回到八宝琉璃坊，蜘蛛老人把补好漆的优子和下好了咒的一套新牌交给你，又给你一个盒子将珍贵的妖珠存放起来。他叮嘱你一定要小心行事。你郑重的道谢后回到了旅馆。\n这几天你的内心满是纠结，明明马上就可以回家了，可你却突然特别舍不得旅馆。毕竞这也是你住了这么长时间的家。你在旅馆的四处转悠着。你想记住这里的每一砖每一瓦。结果偶然间你发现有一个身影闪而过，很快，你没追上，你看背影，似乎是一个陌生的狼妖。可是旅馆并没有这个客人。为什么会有个狼妖在旅馆，你很担心过两天会出什么意外,但是箭在弦上不得不发。\n",
      "Script": "【清晨的阳光】\n今天的你很早便起来了。今天对你来说是很特别的一天。计划是否能够成功全看今日。你选了一件黑色的和服穿上，将长发绾了起来，仔细收拾好后从衣柜中的盒子里拿出了早已准备好的妖珠。昨天晚上你已经趁没人时将平时大家所用的那套旧牌收在了抽屉里，将那套你准备好的新牌放在了平时打牌的桌子上。\n你收拾好出门。风一郎已经在门口等你了。他轻轻牵着你的手，和你一起来到了大厅。你没想到大天狗竟然比你们还早的来到这里。你和风一郎坐下后，你发现桌上的这套牌已经被洗好分成了8份，你记得昨晚你是一整摞放好的，你担心出变故变仔细观察了下，确实是你准备好的那套牌。你安下心来。过了一会那个很少出现的雪女居然破天荒的从房间出来来到了大厅，她也不说话，只是静静的坐在了大天狗的旁边。没过多久滑头鬼哥哥也来了。他和每个人打了个招呼就坐在了大天狗的另一边。\n最后随着走廊传来哒哒哒的奔跑声，小暖拉着一脸没睡醒的优子也跑了过来。小暖坐在了滑头鬼和你中间，优子却好像有什么心事，看了半天坐在了风一郎和雪女中间，一时无言。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "【回家？可是他们呢】\n得偿所愿,稻荷神大人死了。\n你在打牌前偷偷捏碎了妖珠，用妖力唤醒了你打出去的那张山童中的弒神咒。弑神咒并不会对妖造成伤害。按着你的计划，那张山童会唤醒一郎手中所有牌里的弑神咒。而他无论打什么牌。都会在唤醒优子手中的牌，就这样打下去，到了稻荷神大人那里，他的手牌中的弑神咒一定都已经被成功唤醒了。你的计划成功了，只要不被别人发现你的所作所为。你就可以顺利的离开了。\n你可以回家了。可是...\n那个狐狸和狸猫说，要毁了旅馆旅馆没了。小暖怎么办?优子怎么办?大家...\n你可是狐狸旅馆的老板娘啊。哪怕要回家。在离开之前,请保护这里，保护这里的家人们吧。\n阿玉,拜托你了。\n",
      "Ability": ""
    },
    "镰鼬": {
      "Story": "你叫风一郎，是狐狸旅馆的大厨\n——自己想要的，究竟是什么呢？\n【父亲的意志】\n你是一只镰鼬，叫风一郎。你出生在一个偏远的镰鼬山村，与其说是村子不如说更像是个暗杀组织，村里所有的成年镰鼬都是做暗杀的职业杀手，所有的小镰鼬就会在家等着爸爸妈妈回来。回来后他们的父母就会教小镰鼬如何做杀手。大家每天都是打打杀杀的。唯独你的父亲是这个村中最特殊的存在。他是一个不同寻常的镰鼬。他在一个全是杀手的镰鼬村里,开了个料理店。别人的爸爸每天都去打打杀杀的时候。你的父亲每天就蹲在厨房里削土豆，别的小朋友每天都等着爸爸回来，兴高采烈地说\"爸爸！你今天做了什么特别厉害的任务?\"而你爸爸就只会问你\"今儿的土豆削了没?还有20个土豆削完！\"\n你不能理解你的父亲，其实你父亲第一次教你削土豆的时候。你还是很开心的。你感觉这项工作很好玩。但是后来你发现你跟你的伙伴们格格不入，他们都是聊︰我今天学了哪个武功招式。或是学会了哪个杀人手法。慢慢下去你就不再敢和他们说话了。再后来你的小伙伴知道了你的真实情况就开始排挤你。嘲笑你说∶\"哼!你?今天削了几个土豆阿?萝卜削了没?渐渐地你也不愿意出门跟他们玩了。同时你也没有朋友了。你更不想天天跟着父亲蹲在房间里削土豆……你很难过，你跟妈妈说∶\"妈妈!为什么爸爸他不能像别人的爸爸一样出去浴血奋战?是不是爸爸很懦弱，他就是胆子小吧，不敢出去打打杀杀的，只敢躲在咱家小厨房里! \"妈妈听到这里只是笑笑，摸摸你的头告诉你:\"一郎。你要理解你的爸爸。他这么做都是因为他爱你，爱这个家。他不像你说的那样。他是很伟大的。\"你心想，才不是呢!我爸就是一个无能的镰鼬!你根本不稀罕这样的爸爸!别人的爸爸在你心中都有一个高大伟岸的形象。尤其是其他小朋友说，京都有一个第一杀手，也是一只镰鼬。它是整个镰鼬族的光荣。\n这个谜一般的第一杀手成为了你心中的偶像。你多希望那样的人才是你的父亲。终于在又一次被小伙伴嘲笑后，你忍不住跑去跟你父亲说∶\"你能不能教教我怎么杀人?教我点杀人的功夫什么的?是不是父亲你就是胆小鬼，或者你根本不会那些厉害的功夫!\"你的父亲很生气，一脸严厉的对你说∶\"你给我好好练习削土豆!杀人杀人，你知道杀人意味着什么吗!\"这次和父亲的争吵彻底激化了你们之间的矛盾，你一气之下离家出走，心想着大不了到京都去找那个第一杀手去，我给他当儿子!实在不行当个徒弟去也好!反正你不想继续窝囊地在这个破厨房待着整天只能削土豆了!\n走之前你想到了父亲的那个宝贝盒子。他一直都特别珍惜，说不定里面装的是什么武功秘籍。但是爸爸胆子小不敢练?你偷偷的把这个盒子带在身上，头也不回的前往了京都。路上你想试着打开这个盒子，但是它是个密码锁。你尝试输入过父母的结婚纪念日。生日之类的,但就是打不开这个盒子。到了京都之后，你才发现。京都比你的家乡大太多了!那是你从没见过的繁华。你这时才意识到你根本没什么准备。也没有什么周全的求师之路。只能暂时先找个落脚点。你多方打听后来到了位于稻荷神山中一家有名的妖怪旅馆【狐狸旅馆】。接待你的是一只特别漂亮的白色九尾狐老板娘。你从来没有见到过这么漂亮的人，虽然你从小只见过镰鼬。但是最美的镰鼬也不如老板娘的一根狐狸尾巴毛，你一瞬间就看呆了，略微有些磕巴的说:\"老板娘啊。我肚子饿了，有饭吃吗?\"老板娘似乎心情不太好。把菜单甩在你面前冷声道:\"点!\"你就紧张地坐下开始点菜。点一个。\"没有l\"点一个。\"不行!\"你很奇怪老板娘怎么对你态度这么差，老板娘脾气这么不好吗?但你也没敢说话，因为老板娘很漂亮，你最后无奈的看着菜单上最后一道菜说∶“章鱼烧能做么?”\n老板娘犹豫了一下，说道:\"行吧!等着l\"说完就转身进了厨房。过了一会。她端着一盘章鱼烧出来了。总共有三颗，你吃了一颗，这味道。别说你爸的手艺，连你的手艺都不如!你正想吐槽，发现她正看着你。你心想∶算了。肚子饿。就把这剩下的两个章鱼烧也吃了。吃完之后你就看着这个老板娘。\"你这手艺是咋开的店阿?你其实就想问问她。但是老板娘似乎觉得你在嘲讽她。啪!一拍桌子∶\"爱吃吃!不吃就滚！\"你太委屈了。老板娘看你这个样子。觉得自己可能真的略微有些过分，就又说:\"我们厨师前两天辞职了，我又不太会做饭。你要觉得做不好吃。你就别付钱了。这话一说你就觉得也不能怪人家，这么漂亮的人也不应该是做饭的人啊!\n你立马说道:\"哎呀。没事儿没事儿。我吃饱了。结账吧!\"然后你就问老板娘∶\"你这能许愿吗?\"狐狸旅馆除了吃饭、住宿以外。它还有一个功能，就是向稻荷神大人许愿，稻荷神大人是整个京都地区的主神大人。老板娘说:\"行，我这许愿还挺灵的。你来试试!\"她带着你来到里间的神盒前，神龛里的稻荷神大人的雕像是一个大胖子，圆肚子、圆脸、戴个高帽子。你双手合十许愿到\"请保佑我成为京都第一杀手!\"许愿后神龛突然发光，然后在神龛前出现了一个御守，你拿起御守想要打开却发现怎么都打不开。你不知道你的愿望就能能否实现，但你还是把这个御守放在了自己身上随身带着。\"噗呲！哈哈哈哈·\"你身后的老板娘笑出了声。你转身问老板娘，\"你知道京都哪里有招杀手的吗?\"老板娘看着你想了想，\"我还真知道!\"她给你写了个地址，说这有一个头很长的妖怪。叫做【滑头鬼大人】。你去投奔他吧。\n【心底的期望】\n你很高兴地道了谢，离开狐狸旅馆来到了老板娘地址里的地方。这儿是一个很大的院子,大门上挂着【新苑组】的牌子。院子里有很多妖怪，你找了半天也没能找到头那么长的妖怪,只能找到了一个头稍微短一点的妖怪问他说∶\"你是滑头鬼大人么?\"他看了你一眼说:\"我不是！我是这里的二把手，你找我们当家干嘛?\"你回答道:\"我是狐旅馆的老板娘介绍来的。我来这应聘杀手!\"这个二把手上下打量了你一番道:\"你会点什么招式阿?你凭什么功夫来应聘杀手啊?\"你心想着∶我只会削土豆阿，我要是说我会削土豆，会不会把我派去厨房去干活做菜啊!\n还好你们家削土豆并不像普通人家削土豆，因为镰鼬家族属于风系，风系的妖怪是使用风刃。虽然你的风刃都是用来削土豆。这时你心中突生一个妙计，将面前这个妖怪想象成一个土豆，把他当成土豆来削不就好了?!你刚刚架起你的假姿势，就听身后有人喊:\"风太郎～“哎?风太郎这是你爸的名字阿!京都这么大地方竟然有人认识你爸?你一扭头看到了一个头那么那么长的妖怪一他一定就是滑头鬼大人!你回头对他说∶\"你找我爸干嘛呀?你认识我爸吗?滑头鬼大人笑眯眯道∶\"你是风太郎的儿子阿!来来来来!跟我进来坐。\"说着将你带进了里间安排你坐下。坐下后滑头鬼大人问道:\"你爸这么多年过的怎么样阿?当年不辞而别,我一直很关心他呢。\"哦?原来父亲以前是在京都做厨师阿?怪不得手艺还可以。你就问他说∶\"大人。我父亲以前是在您···您府上做厨师嘛?\"\n滑头鬼大人看着你笑了∶\"哈哈哈哈哈!厨师?你爸以前可是整个京都第一杀手，你知道吗?你爸做杀手那么多年从来就没失手过，暗杀任务执行的漂漂亮亮的,逮谁杀谁阿，削人跟削土豆一样，你爸做厨师是不是有点委屈?\"你惊讶的说道∶\"你确定说是我爸吗?风太郎?京都第一杀手?\"滑头鬼大人说道:\"对呀。你跟你父亲那是一个模子刻出来的\"你根本不敢相信，喃喃道:\"不可能阿，我爹现在开个小料理店。天天蹲在厨房里削土豆，削的背都佝偻着，他看着也不像是做杀手的样子阿。而且胆子特别小。我们村只有他一个镰鼬做了厨子。\"滑头鬼大人沉思了半天,问∶“你多少岁阿?\"你就告诉大人\"十六七岁呀\"。\n大人若有所思道:\"那我知道了…我跟你说小子!当年我派你爸去执行一个任务，是去一个偏远的狐妖村中。当时我收到线报。说有两个狐妖村的内斗一触即发。据说隔壁红狐村还雇了杀手去刺杀白狐村的族长儿子。为了阻止战争的发生，我赶紧派风太郎也就是你的父亲去保护那个族长的儿子。可是我等了很多天你父亲却一直没回来。我只能重新派了一个手下去看。打探完他回来告诉我，白狐村的族长儿子死了，但是白红狐两族也没发生大规模的冲突事件，两个族落相安无事。我一直以为你爹是不是失手了，不好意思回来，觉得第一杀手的面子抹不开。但是一算你这个岁数。你父母那段时间才新婚不久。应该是你母亲有了身孕,你父亲干脆趁此机会金盘洗手。毕竟做杀手是一件很危险的事情，说不定哪天就出了意外。你的父亲为了给你和你的母亲一个安稳的生活，放弃了自己的名声和地位。还有京都的大宅子和田地,偷偷带着你母亲回到镰鼬村开个料理店。别说!你爸做杀手的时候就很喜欢做料理，他选择这种平静的生活。选择给你这种安稳的生活，你要理解他。你的父亲真的很伟大。\"\n你听完滑头鬼大人的一番话，心里突然出现了父亲的形象，然后啪!就跟你心中的京都第一杀手的形象合在了一起。父亲他并不是一个窝素胆小的镰鼬?你拿起那个盒子，你突然猜到了一个密码。那是你父亲第一次教你拿起菜刀的日子!输入密码后盒子真的打开了。盒子里面,是一本《料理大全》。\"第1页∶照烧饭的做法，第2页∶杂鱼汤，第3页∶厚蛋烧.越往后翻越难。最后几页是怀石料理的流程与做法介绍\"原来这这才是你父亲一直收藏了很久的宝贝，他想将这个盒子给你，想让你学料理。他是不希望你的未来太过于危险。\n你开始思考，你真的很讨厌做料理吗?好像也不是，你刚开始学习刀功的时候是快乐的。只是后来因为小朋友排挤你，发现你跟大家都不一样。你才想成为杀手，可是你真的喜欢做杀手吗?你也不知道，你甚至连如何做一个杀手都不知道。你突然不知道，你真正想要的。是什么呢?这时滑头鬼大人问你:\"你来京都干什么?”你边想就边顺嘴说:“我是想来投奔您这里做个杀手…”大人说:“那你留在我这，我让人带带你。教你怎么做杀手如何?”你心里更乱了。你觉得你冤枉了父亲这么久。虽然只是在心里。但是。不如试试看，跟父亲和解,去试试看父亲想让你选择的道路是不是你所想要的?不如....你就把这本书从第一页开始学到最后一页。当你全部学会的时候觉得自己真的不喜欢做料理。再追求你自己喜欢的道路也不迟啊。毕竟你才十几岁。还很年轻。如果到时候发现自己认同父亲的想法。就回去好好地跟父亲认个错。对吧?终于你好像想明白了。你就拍桌子你就起!“大人，我觉得也许做个厨子也挺好的，我想去试试，告辞大人!”你谢过大人后转身离开了【新苑组】。\n你走出去之后才发现:“你能去哪做个厨子呢?想了半天一一狐狸旅馆阿!那里不是缺一个厨子吗?”你快步来到旅馆找到老板娘问道:“老板娘!你这缺厨子么不是﹖你看我行不行?”老板娘笑着说道:“你不是要做杀手么?你怎么又要回来当厨子?这才过了一天,你这怎么变这么快?”你担心她不招你。赶忙说:“你是不是看不起我？你等着!”说着你就去厨房拿了个土豆过来削，风刃在你手里来回变换,你一个旋风削土豆法就削出了一个非常完美的土豆。老板娘这边看的目瞪口呆:“好刀工啊!你就留在我这旅馆当个厨子吧!”\n【旅馆的大家】\n你就这样在旅馆住了下来，你心想以后也要跟老板娘同处于一个屋檐下，还是要跟她搞好关系，于是你经常会去问老板娘。“你今天想吃点啥?”“你想不想喝个红豆汤?”一来一去你知道了老板娘的名字，叫【阿玉】。过了一段时间你发现阿玉的脾气也不是那么坏,她可能只是前段时间心情不好吧。她渐渐地对你温柔了很多，偶尔会帮你做套新衣服。买双新鞋，收拾下房间。毕竟共同生活在这个旅馆。也算是一家人了。阿玉真的挺好的，人长得又漂亮。又贤惠，当时的你还没想那么多，只是阿玉让你想起了温柔的母亲。自从你做了狐狸旅馆的大厨，你发现滑头鬼大人竟然经常来狐狸旅馆蹭饭吃!堂堂妖怪的老大竟然吃饭不掏钱!而且当他发现你在旅馆任职后蹭饭的频率从一周两三次变成了每天都来!\n有一次你就听到他对阿玉讲:“阿玉，你知道我是京都的老大对吧?有我罩着你。以后你们旅馆出了什么事情都别担心，我就也蹭你这一顿饭。是不是?”但是阿玉每次都笑嘻嘻的给他多摆双筷子。毕竟阿玉是老板娘，你也不好说什么。你只能每次故意给他做上一份不是那么好吃的料理，想通过这种方式逼得他不来。但是滑头鬼大人的脸皮也是真厚，无论你做的多么不好吃，他都会对你说:“不错!还可以阿!小子。继续努力!”\n但是你和阿玉也有共同讨厌的对象。就是经常成群结队来旅馆吃喝的大天狗们。大天狗隶属【天御院】，是守护整个京都的组织。但他们吃喝从来不付钱，只记账。阿玉去要过几次钱还碰了壁。但是公家的人也不能闭门谢客，这让阿玉很苦恼。\n有一天阿玉出门去了市区，回来的时候带了一个人偶娃娃。30厘米左右，跳起来也才只能打到你的膝盖，而且这个小人偶竞然会动，还会说话!原来她是个小妖怪。只是灵力很弱。她说她叫优子。优子因为无处可去，所以也留在了旅馆里。你看着她小小的一只，很可爱。天天跟在你屁股后面“风一郎哥哥～风一郎哥哥~”一声声地叫你。你也是独生子，没有兄弟姐妹，你从心底把小优子当成了你的妹妹。你猜小孩子都喜欢喝甜汤，你就经常给优子做一些红豆沙的甜品。她吃的特别开心。阿玉不久前还拜托你给忧子做一套特制的家具。毕竟正常的床那么高。优子怎么能爬上去?你的刀功十分了得。也会一些木工的手艺。你给优子做了一套符合她身高的迷你家具。你们一家三口幸福的生活在旅馆里。虽然优子很小，但是因为你和阿玉对她特别好，她自然想为旅馆出份力。帮助你们做事。所以优子经常帮忙给客人上菜倒酒，但因为身高原因，她就上菜需要拿头顶着盘子。抱个酒瓶给客人倒酒。酒瓶都跟她一样高。虽然她也因此经常蹭掉漆，但她还是很努力地去做。\n【烟花下的约定】\n在旅馆的生活平静幸福。在这种相处的过程中，你也对阿玉有了不一样的感情，她的一颦一笑都牵动着你的心绪，偶然间你看到山下贴着即将举行烟火大会的告示。你偷偷买好了两张游园票。决定趁这个机会向阿玉表达你的心意。你紧张的邀请阿玉说:\"阿玉，你想不想跟我去看烟火大会阿?”没想到阿玉竟然欣然答应了!烟火大会当天你早早的在旅馆门口等着她。阿玉出现的时候你惊呆了。阿玉穿了一件你从来没有见过的漂亮和服。盛装打扮的出现在你的面前。你一时间竟呆住了。轻轻说了句:阿玉…你今天…好漂亮啊。她轻轻的笑了下,拍了拍你的肩说∶别愣着了，烟火怏开始了。出发吧”\n你带着她来到山下的祭典上。人来人往。小贩们努力的吆喝着。你看阿玉有点不知所措。你轻轻拉着她挨个小摊逛着。你们一纪买了苹果糖。玩了捞金鱼。还买了妖怪面具。玩了很久后，你们跟着人群来到山坡上准备看烟火。当绚烂的烟火升到半空中炸裂开来，你鼓足勇气突然转过头问阿玉∶阿玉。你想让我一直做饭给你吃吗?阿玉笑着问道∶怎么?你要辞职吗?你红着脸看着她,深吸一口气后大喊道∶阿玉!我喜欢你!你愿意和我在一起吗!阿玉看着你的眼睛。认真思考了许久后说\"一郎，我和你做个约定吧，如果有一天所有人都夸你做的料理好吃，我就答应你。\"听了她的话后你两眼放光。你其实并不是很会做料理。只是刀功比较好。你是来到旅馆之后才开始从料理大全的第一页开始学做料理。但是料理这种东西并不是一蹴而就的,所以你做的料理现在也只是很一般的水平。\"你突然间似乎找到了人生的目标和方向,你重重的点头道∶阿玉，你看着吧，我一定会达成和你的约定!\n你回去之后开始彻夜地待在厨房练习，再也没有灭过灯。天天就像疯魔了一般练爸爸那本书上的料理。而且你现在只要是个客人吃过你的料理之后，你就抓住他们问:\"客人，你觉得我现在做料理好吃吗?\"但是你的基础水平就毕竟不高，任何目标不是一旦制定立马就可以完成的，成长总是需要过程。所以也会有客人向你提建议\"不够咸阿·太淡了火候不够阿“虽然每次问客人。客人们都会提出一些不大不小的问题。但是你并不气馁。给自己打气∶没关系，慢慢来。总会越做越好的，只要努力，我总能成为料理第一人。有一天阿玉总会和我在一起的!\n最近有一只天狗跟小优子走的特别近，你发现优子对这只天狗也不错，但是你一想起那群混蛋天狗，你就实在没办法放下对天狗的偏见。你每次看到这只天狗带着优子出去玩你就想优子说,\"你不要跟天狗走的这么近，他们都是群爱赖账的王八蛋!\"但是优子每次跟他出去玩回来都特别开心。你也只好每次都把话吞了回去。你妹妹和他一起玩很开心，你还能阻止不成?所以你每次都只能紧盯着他，看着他带着优子出去玩，都会催促他早点带优子回来，但是每次他也按约定把优子平安的带回来。你即使不快也无可奈何。\n有一天你们旅馆门口出现了一只红色的小狐狸，矮矮的。她跪在门口请求阿玉收留她,说想留在这里修行。阿玉将她留了下来。你发现阿玉对这只红色小狐狸特别好，甚至比对优子还好。阿玉安排小暖和优子住在一个房间。毕竟一个30厘米、一个80厘米，也差不多大,用小家具也比较方便。小狐狸见到你时甜甜的对你说∶风一郎哥哥，我叫【小暖】。以后请多指教啦~对了，你要不要吃爪爪饼干?那是一种小爪与形状的饼干，小小一个很可爱。吃完后打从心里涌上来一阵暖意。\n虽然优子刚开始似乎不是很喜欢小暖，但是后来也逐渐接受了她。阿玉喜欢她对她好,你也爱屋及乌，你养成了同样一个习惯，每天问完阿玉想吃什么饭，就会去问优子想吃什么零嘴，最后还要跑去问问小暖想喝什么甜汤。每次给优子做好吃的时候也会顺带给小暖做上一份，你知道小暖喜欢吃饼干。你就总在外出采买的时候。给小暖买上很多口味的饼干给她吃，但她最喜欢的还是爪爪饼干。这种饼干在外面买不到。是用小暖自己的小爪子去做的,你每次就帮她做。她那么矮也做不了其他工作。你都是把面胚切成小块，到最后一步时把她抱到椅子上，让她去在胚子上印上自己的小爪爪印，最后再放到烤炉里烤。反正优子一个妹姝也是妹妹，再来一个小暖，不过是多一个妹妹。一家四口也挺好的。是不是?\n你们一家四口就在狐狸旅馆幸福平淡地生活着，有一天滑头鬼大人带了一个新的客人住了进来，是一个奇怪的雪女。她的头上自带一朵乌云，整个人在乌云下面走着，一脸的不开心。她一住进来就把房间门都冰封了起来不让任何人进去。阿玉邀请过雪女几次但都被拒绝了，她只让把饭送到门口，但是你还是按着惯例每次送完饭之后就去敲门问她:\"你觉得今天的饭怎么样?\"但雪女只会冷冰冰地回答一句:\"难吃。滚!\"\n你依旧每天来问她这个饭吃起来怎么样，但是她也依旧只说一句话\"难吃，滚! \"你有一天终于受不了，你问她吃起来怎么样，她还是那句话，你想让她说说到底哪里不好吃了。她却不会在理你。你越来越急。甚至拿菜刀想劈开她的冰门进去跟她理论。奈何冰门太厚。你只在冰门上留下了两道浅浅的印子。雪女还在房间里面嘲笑你。\"就是不好吃，你问那么多干什么?就是难吃!\"你讨厌极了这个雪女，他简直就是你追求阿玉道路上最大的阻碍!\n【最重要的人】\n最近这几天。你发现阿玉的心情特别的不好。之前平日里总是乐呵呵地关心客人。最近却总是心不在焉，又或者和雪女一样把自己锁在房间里。你就一直在想阿玉到底为什么不开心呢…可能是因为前两天有一个稻荷神大人的神使，下来到狐狸旅馆住了两天，走了之后阿玉就开始心情不好了。你去问阿玉。阿玉却愁眉苦脸地搪塞了你。你坚持不懈的问她很多次,终于有一天阿玉跟你说∶\"风一郎。你晚上来我房间一趟吧。\"你突然有点激动!晚上!阿玉的房间!到了晚上你来到阿玉的房间。阿玉什么都没说。只是拿出两瓶烧酒放在你面前,说∶干了。\n喝完后阿玉红着睑看着你说:\"一郎。其实我不是不喜欢你。也不是不接受你。只是因为我小时候有个青梅竹马，我很喜欢他。家里也定了亲。但是婚还没结成。他就被人给杀了。但是我怀了孕，有了孩子。我还是坚持把孩子生了下来。我的女儿很可爱很听话，但是我被迫离开了她。我已经有10多年没有见到过我的女儿和父母了。我是被迫困在狐狸旅馆的。我日日夜夜期盼能够回家，但是我回不去，我被这里的禁制控制了。所以我只能冒一次险，我已经想明白了，过几天稻荷神大人会来旅馆挑选下一任神使，我会趁着空档。把大人留在这个地方。\"\n你心想∶稻荷神?那可是整个京都地区的主神大人，把他杀了。谁还能活?但是你并没有把你的想法告诉阿玉。阿玉说:\"风一郎。你是一个好人。我们相处了这么长时间也生活了这么多年了,我不想牵连你。你走吧l你就远远的离开这里，最好你还能把小暖和优子一起带走。留我一个人在这就行了，你就别再担心我了。\"你听完后激动地冲过去将她抱在了怀里说∶\"你要做这么危险的事儿，你赶我走合适吗?我跟你说的那些话，你觉得我是在逗你玩的吗?我走了。我还是个男人吗?我告诉你阿玉，你无论做什么我都会陪着你，你要是弑神我就陪着你一起弑神!我一定会让你回家的，你相信我。\"阿玉红着脸轻轻靠在你的肩上说∶\"可是，约定还是约定哦，你还是要让所有人都觉得你做饭好吃我才答应你\"你坚定的望着她∶\"你相信我!答应你的我一定会做到!你明白,此时的你们已经心意相通，但现在并不是你侬我侬的好时机。\n离开房间之后你冷静的想了想，绝对不能让阿玉弑神。她要是真杀了一个神。她一定是回不去家的，她肯定会抓到天上去受审的。没办法·\"我来帮她把这个神干掉，让阿玉回家。我来做这个英雄，我心目中不是有个大英雄梦吗?这就是我的机会!\"你就这样跟自己说，你一定要阻止阿玉动手，这件事只能你来。你不知道阿玉的计划是什么，但是你发现阿玉似乎偷偷去俗世做了一套新的妖怪牌。难道和妖怪牌有关?说起妖怪牌你在熟悉不过了，不就是旅馆里大家最喜欢玩的游戏吗!旅馆每周的休息日你们都会聚在一起打妖怪牌。这是妖界最为流行的牌类游戏。\n你很喜欢打妖怪牌，因为每次打妖怪牌的时候。一家人都会聚在一起，围在暖桌的旁边,嬉笑怒骂的感觉特别温暖。因为暖桌优子够不着。你还为优子专门做了一个小凳子给她打牌用。《妖怪牌》的牌中都封着一些可爱的小妖怪的分身影子。每张牌都有不同的属性。如果这牌和你自身的属性相同你还可以与牌建立联系。驱动同属性的牌。甚至释放一点小小的符咒来恶搞下大家。镰鼬是风属性的妖怪，你可以驱动风属性的【姑获鸟】这张牌，你却很少放符咒恶搞别人，毕竟那些都是你的家人。最近滑头鬼大人也经常跟你们一起打牌。但是他每次都赢，但他每次只打两把。打完就说你们太菜了，让你们好好练一下。你私心想着，到时候你就坐在阿玉的下家。无论阿玉打什么牌。你都把她的牌给她拦住。不让她的牌传下去。然后让她出不了牌。到时你找机会出一张姑获鸟，在里面下个能弑神的咒语就好了。\n【杀人的瞬间】\n前几天凌晨你正在练习刀工,优子突然急冲冲地跑过来找你说∶\"哥哥!我干坏事了!我今天在阿玉姐姐的房间睡着了，等我醒来的时候我发现有一个陌生的狼妖在阿玉姐的房间乱翻东西。我就把他给杀了，但是我拖不动尸体！\"你心想小优子这么小的个子，跳起来只能戳人膝盖，怎么可能还杀人?你安抚优子道:\"你可能是做恶梦了。是不是最近压力大了?要不要喝点红豆汤?\"忧子却着急地说道:\"不行!哥哥!你跟我来一起过来!\"她使劲儿扯着你的衣服，把你扯到阿玉房间旁边的一个角落里，但是那里却什么都没有。你准备把她抱起来说∶\"是做噩梦了吧?什么都没有嘛l走!哥哥带你出去吃点什么吧!\"\n优子急了:\"不是的，风一郎哥哥!我跟你说。前段时间姐姐带我去找八宝琉璃坊的蜘蛛老人。就是专门给我补漆植发的那位手工艺人I那天姐姐带我去了之后就把我放在门口，然后她进去跟蜘蛛老人说了些什么，我看阿玉姐姐跪下了还哭了。然后姐姐就出去了。去了好久,姐姐好像让蜘蛛老人做什么东西，结果做的时候我就听到蜘蛛老人在自言自语说什么。这可是弑神的大罪什么的!还有什么虽然跟阿玉这么多年交情但是还是要对不起她了……·我觉得很害怕。阿玉姐姐回来后蜘蛛老人就给姐姐递了个什么东西。我们就一起回来了。我今天在睡觉的时候就看见那个狼妖翻了几遍姐姐的房间,肯定是在找这个东西,我就想把他杀了…你觉得优子说的前半段话可能是真的。但后边的肯定是因为压力大了，你原本想这件事就这样过去。但是你越想越不对劲。\n阿玉的计划一定和这个蜘蛛老人有关。蜘蛛老人万一真的把阿玉供出去怎么办呢?不行!你回到厨房，在你的料理台上随便抽了一把又窄又细的菜刀，揣上刀就动身去了俗世。你来到了八宝琉璃坊，进门就看到了一个蜘蛛老人。你张口问道:\"你说!你是不是前段时间帮阿玉做过东西?你有没有告诉别人?\"蜘蛛老人问道:\"你谁阿?\"\"你甭管我是谁1你要是敢把这件事情告诉给别人。我告诉你我一定杀了你!\"你亮出了你带来的菜刀。\"你个臭镰鼬还想杀我?我告诉你，你有空在这里跟我逼逼赖赖。不如赶紧回家阻止阿玉去干这种事。你有没有想过后果?你还是劝劝阿玉不要这么做了。\"你一听，这狗屁蜘蛛老人肯定会偷偷告诉别人!你想都没想就发动旋风刃驱使菜刀就砍了上去，一个会伤害到阿玉的人。你丝毫没有手软。只是你低头看到了手中的菜刀和流出的紫色鲜血，你突然很害怕。拿着刀赶紧跑回了旅馆。回到房间后赶忙把刀上的血冲干净，将刀随手丢在了料理台上。\n你在心中不住的想着︰这是你第一次杀人…杀人的感觉真不好…自己以前还想做杀手。做什么杀手?你点也不喜欢杀人的感觉可是怎么办呢?为了阿玉你没有别的选择·如果能回到从前的生活多好，那种平静幸福的生活。可惜··回不去了··\n",
      "Script": "【清晨的阳光】\n今天你一起床就去了阿玉的房间，你知道今天是最重要的一天。今天，稻荷神大人会下来挑选新的神使，今天也是阿玉要实行她计划的日子。你早早的在阿玉的门口等着她。等她收拾好后你就轻轻的牵着她来到了大厅。你没想到大天狗竟然比你们还早的来到这里。\n你和阿玉坐下后你发现桌上的这套牌已经被洗好分成了8份。但你们谁也没有玩的打算。过了一会那个很少出现的雪女居然破天荒的从房间出来来到了大厅，她也不说话。只是静静的坐在了大天狗的旁边。没过多久滑头鬼也来了。他和每个人打了个招呼就坐在了大天狗的另一边。\n最后随着走廊传来哒哒哒的奔跑声，小暖拉着一脸没睡醒的优子也跑了过来。小暖坐在了滑头鬼和你中间。优子却好像有什么心事。看了半天坐在了风一郎和雪女中间。一时无言。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "【命运？只做自己的选择】\n稻荷神大人死了。如你所计划的一般。你拦住了阿玉打出来的山童，并把这张牌打了出去。之后你再打出的那张姑获鸟中下了一个弑神的风刃咒。弑神咒并不会伤害妖怪，你也不知道是不是你的这张姑获鸟传到了他的手上导致他的死亡。也不知道阿玉的计划究竟是什么,会不会她还做了别的准备，稻荷神的死亡究竟和阿玉有没有关系。但是至少现在，阿玉可以回家了，你做到了。\n可是刚才那两个神使说，要毁了狐狸旅馆?你早就把这当成了你的第二个家。这个家里有你喜欢的女人和两个需要保护的妹妹。你是狐狸旅馆里唯一的男人。是这个家的支柱啊。\n优子离开了狐狸旅馆就不会说话也不会动了,小暖也会失去最重要的家。而你...还没完成和阿玉的约定啊!\n不能让旅馆被毁掉!一定要保护这里!\n风一郎，拜托你了，请一定保护好狐狸旅馆吧!你可是这里的大厨啊!\n",
      "Ability": ""
    },
    "小狐狸": {
      "Story": "你叫小暖，是一个没有家人的红狐狸\n——你会记住你遇见的每一个温暖的人\n【第一个家？】\n你出生在京都地区的一个偏远城镇。你不记得家是哪里了，从小生下来就没有家人。你一直都是孤单的在世间生活，对于你出生的地方也没有太多眷恋。不记得也正常。你有一个梦想，就是给自己找到一个家。于是你就找啊找。走了很多地方，但是大家怎么会接受陌生的过客成为家人呢。有的人态度恶劣。动辄出言打骂赶走你也是常态。饥寒交迫之下。你晕倒在了一户人门口，最后昏迷前你看到的屋内透出的温暖烛光。等你醒来时，在你眼前的是一对狐狸夫妻，满目的焦急神色。看到你醒来他们似乎很开心。咦?好温暖的人啊，从未有过的关心不禁让你湿了眼眶，更令你开心的事他们的颜色跟你一样都是红的。或许你可以拥有家人了?\n这个家还有一个红狐狸小妹妹。叫【小萌】。水汪汪的眼睛也充斥着对你这个姐姐的好奇，狐狸夫妻你说∶\"既然没有家人那就留在我家吧，颠沛流离这么久一定很孤单吧，我们收留你，以后就把我们当成你的家人吧。那我们都是红狐一族。以后你就是我们的女儿!\"一瞬间，你的泪水再也忍不住地流了下来，像是在宣泄自己多年的委屈。后来你就在这生活了下来。他们对你跟对自己的女儿是一样的好。把你当亲生的一样。从未有半分偏袒。在他们温暖的宠爱之下，你跟妹妹的关系也像亲生一般毫无隔阂。同吃同睡。村里人都说你们像连体婴儿一样，去哪儿都不分开。\n后来你知道这个家是有一个使命的。在京都。有一位主神大人——【稻荷神】。传说他的前身是稻米。因为人们虔诚的向种下的稻米祈祷。希望自己来年能够丰收。这种力量滋养出了叫稻米妖的妖怪，但是他们是善良的。随着人们的夙愿越来越强烈心也慢慢虔诚，渐渐地把稻米当成一种信仰，人们的信仰汇聚成力量。稻米妖就变成了神，成为了稻荷神，后来搬进神域去居住。\n稻荷神就是京都地区供奉的主神。他有一个特性。听说和蔼可亲的他哪都好，就是需要很多的侍者去服侍他。因为是稻米的原因，胖胖的他。有圆圆的肚子，圆圆的脸。还喜欢毛茸茸的动物。所以他的侍者都是狐狸和狸猫。\n也是因为这样的原因，整个京都地区的狐狸。无论是村落还是家族。他们都以能成为稻荷神的使者为梦想和目标。对于所有狐狸而言这是一个非常光荣伟大的任务。你只要成为了神的使者。跟着神进入神域生活。你就可以一跃从妖变成神了!你现在的家族是给稻荷神作侍衣神使的，专门为稻荷神大人侍奉穿衣。这是家族传承的使命。所以你开始跟着妹妹小萌一起修行，学习如何做一个好的侍衣神使。妹妹的梦想是成为稻荷神大人的侍者。'\n为不想和妹妹分开。这个家的使命便是你的使命。你也把成为神使当成了自己的目标和梦想。和妹妹一起努力修行并肩前行。你非常的努力。等待着神使的选择。过了五年你们一家人等来了神使。经过紧张的选拔后。神使大人选中了妹妹小萌。当然了，你一开始就知道妹妹可以成功,毕竟她一直为此努力。你觉得她多年的愿望终于要实现了!其实也不算实现了,她要先去做神使候补。在京都的稻禾神社修行。当妹妹走后一个人在家的你。少了欢声笑语,你对妹妹的思念愈演愈烈。你开始意识到。和妹妹共进退的你。梦想也是成为神使。你想去她身边!\n既然家里已经没有机会了，不如再去外面找找。稻荷神大人除了穿衣服他还得吃饭吧,得穿鞋吧，得扇扇子吧，他需要很多人去服侍他。不是非要做侍衣神使啊!你决定去别的狐村试试。说不定会有别的机会。下定决心后你就辞别了父母准备踏上旅程。对于你的决定，他们一开始充满了担心，但是最终还是选择支持了你。他们给你带满了一路上的食物和充足的钱财。不让你受委屈。不舍得送你踏上了追梦之旅。\n【第二个家？】\n一路上你找了很多的狐妖家族和狐妖村落。它们无一例外的都拒绝了你。他们都很排外，说他们自己的名额都不够。为什么要让给你?你很失望。也很失落!这段时间让你想起了之前\n独自流浪的生活。但是每当你摸了摸包里的食物，温暖的感觉让你变得坚强起来。最终你遇到了一家人。他们很友善。告诉你虽然他们没有合适的名额。因为他们家确实只有一个女儿,需要把名额留给她，但是山的那边有一个小村落，人丁稀薄。他们也需要按时的去选出一个候选，你可以去那里试试看。你很开心。终于有办法了!你拿出了你随身携带的饼干送给他们表达谢意。这饼干是你跟妹妹以前一起学着做的。其实是你的养母烤的，你和妹妹只需要在上面按小爪印就可以了。所以你和小萌一起给这个饼干起名叫爪爪饼干。妹妹非常喜欢吃这个饼干，你也非常喜欢吃。你觉得这个饼干是家人的爱与温暖的凝聚。所以你也总是用爪爪饼干去表达你的善意和爱意。你一路吃的也就没剩几个了。但你还是从所剩不多的饼干中拿了几个说:\"请你们吃爪爪饼干，这是我自己做的。谢谢你们!\"道了谢就踏上了旅程。\n你跋山涉水来到了这个很偏远的村子。跟村长说明了来意，村长一听，便将你留在了村里，决定给你机会。你发现这个村落都是白狐。但是他们并不排外。说\"正好我们没有适龄的小狐狸了。你就留在我们这，我们村有一对老夫妻。他们岁数也大了。独自带着他们的小孙女生活，不如你就去跟他们住在一起修行，还能顺便照顾他们下。\"你非常开心，觉得自己离妹妹和梦想又进了一步。\n这一路都是温暖的人啊，老夫妻非常友善。他们对你就跟养父母对你一样好，把你像是当亲生女儿那样对待，让你更加的感恩。这个家的小孙女很可爱。它叫【小小白】，浑身上下就都是白白的，毛茸茸的，只有一两岁。但是每天就流着哈喇子\"小暖姐姐～小暖姐姐～一\"奶声奶气的叫你陪她玩。在等待机会的时间里。你每天都做着自己力所能及的事情。包揽家务，带着小小白做爪爪饼干。你负责烤饼干，小小白负责按爪爪印。就像你和妹妹一样温馨。\n你在这里生活修行了五六年，这个村子传承的使命是做稻荷神大人的扇扇神使。你也努力练习了很久。虽然你在这过得温馨快乐。但你一直没有见有神使下来选人。你开始着急了,你怕妹姝已经当神使了，可你连个候补都还没混上，两个人又错过了。于是你就跑去问村长什么时候才会来选人?村长说:\"你这么着急吗,我们20年才选一次哎。上次是你来之前不久,人家才选了一批。\"你一听就急了。那可怎么办。还要等十几年?!你等不住了。你想不然再去\n别的地方试试看吧，虽然不舍你的第二个家，但是还是跟老夫妻告了别。你怕他们伤心多想就解释道\"虽然我在这里生活得很幸福。这里就像我的第二个家一样，但是我还有我的梦想和我的妹妹，我必须要向前进”\n老夫妻很舍不得。小小白更不舍得你了，窝在你怀里，喊着姐姐你不要走。你摸摸她的头，给了她罐饼干，跟她说\"这罐爪爪饼干你要慢慢的吃。等你吃完的时候姐姐就回来看你。\"你们一起生活这么多年也建立了深厚的情谊。老夫妻依依不舍的对你说道\"孩子，你要一路小心，如果这么着急想当神使的话。可以去京都试试看，我们的女儿是上一批被选去的，她现在应该已经有了点成就。我给你个地址。你去投奔她。到她那儿之后你让她收留你。在她那儿修行，说不定你还能更快一点。\"这简直是意外之喜。你觉得这几年的努力没有白费，你拿着这个地址，带上爪爪饼干,告辞了老夫妻和小小白,前往了京都。\n【这，是家啊】\n经过一路波折你终于到达了京都。你根据地址上的目的地。来到了【狐狸旅馆】的门口,你在门口犹豫了半天。觉得如果直接告诉她。说是小小白的爷爷奶奶推荐你来的。就好像走后门似的。你不想这样。你想要凭自己的努力先试试看!毕竞也在白狐村修行了扇扇侍者这么多年，自己也不差I下定决心的你敲开了狐狸旅馆的门。接待你的是一位白色的九尾狐。叫【阿玉】，是这里的老板娘。你扑通一声。就跪在她面前行礼道:\"老板娘。你能不能收留我在你这里做侍女。我想在你这里修行。我的梦想是成为稻荷神大人的使者!我会很努力的!让我做什么都可以!。\"老板娘看着你看了很久。然后点点头轻笑说\"好。我给你机会，留在我这里。看看你的决心吧\"。\n你成功的留下了。老板娘告诉你。旅馆里供奉着稻荷神大人的神龛。许愿特别灵。你跑去看着憨态可掬的稻荷神大人的石像，双手合十许愿到∶希望小暖可以有一个最温暖的家，能和妹妹并肩而行成为神使。能实现梦想!许愿后神龛突然发光。然后在神龛前出现了一个御守，你拿起御守想要打开却发现怎么都打不开。你不知道你的愿望能否实现，但你还是把这个御守放在了自己身上随身带着。\n老板娘安排你跟一个人偶娃娃住在一起,这个人偶就20厘米那么高。因为她房间的家具全部都是特制的。很迷你。不占地方。所以她的房间还空了很大的地方。你跟她住在一起，刚刚好。住下后，你发现这个叫【优子】的人偶娃娃好像并不是特别喜欢你。对你有所防备似的。你想着自己以后要和她住一起，怎么可以关系不好呢!而且她明明这么可爱，看着就奶声奶气的。你盘算着既然她比你来得早。那就喊她一声姐姐吧。你拿出随身携带的饼干桶递给她问\"忧子姐姐～你要不要吃爪爪饼干?～\"优子戒备心很强，拒绝你的饼干，而且晚上睡觉的时候看着你睡着才睡。\n每天都这样，你看着优子巴掌大的小脸上都熬出黑眼圈啦。决定不能这么继续下去了!要攻略优子!所以你就开始在每天晚上睡觉前跟她说,\"我跟你讲，优子姐姐。我啊，游历了很多地方，有好多风景和很特别的故事哦!\"看她来了兴趣你就把你见过的风景。遇到的人都讲给她听。你发现优子渐渐的也不那么提防你了。还喊你一声小暖妹妹，也愿意吃你的爪爪饼干了。你很开心。\n阿玉在你住进来之后。给你安排的工作都是擦地。收拾房间，这样简单地工作。你觉得无论交给自己什么工作好好认真做就是了!这也是修行的一部分!你总是干劲满满，一个地擦10遍，还打个蜡。她让你打扫卫生呢，你就把房间都给刷一遍。你总是超额的完成阿玉布置给你的任务。有时候阿玉都看不下去了。对你说。\"小暖。你不需要做这么多遍的。你已经做得很好了。\"你回道:\"不行。这是我的修行。而且这是阿玉姐姐给我的任务。阿玉姐姐你对我这么好。我当然要报答你!\"\n毕竟自从你来了之后。阿玉姐姐对你特别体贴。比养父母或者狐村的老夫妻对你还要好。每天都晒着太阳给你梳耳朵、尾巴毛。还让厨师【风一郎】哥哥给你做很多你喜欢喝的甜汤，给你做新和服。你呢，就是别人对你多好。你都会加倍还回去。毕竟自己经历了太多孤独。所以阿玉姐姐对你的好让你从心底里觉得温暖。你对阿玉姐姐的喜爱从饼干上就看得出来~!你每天见到阿玉姐姐都会问∶姐姐你吃爪爪饼干吗?阿玉姐姐总是宠溺的笑着接过~\n饼干总会吃完的，所以你总是会去厨房找风一郎哥哥做饼干，他是一只镰鼬。风一郎哥哥是一个看起来就很阳光的大男孩。而且他好像喜欢阿玉姐姐。当然了，你还小。这种心思你并不明白。只是觉得风一郎哥哥对阿玉姐姐特别好。当他看到阿玉姐姐对你特别好的时候,他也对你格外照顾。他知道你喜欢吃甜汤。就三天两头叫你来厨房偷偷给你和优子一起做芋圆吃。他知道你喜欢吃饼干。就经常趁外出采买的时候给你买很多的饼干吃。你最喜欢的还是爪爪饼干，他也因为你还小。不是很会揉面为原由。把面给你和好切好。你只需要在上面印小爪印。他帮你把饼干烤好，从此你就有好多好多吃不完的爪爪饼干，每天你的小饼干桶都是满满当当的。\n从你来到这里以后。狐狸旅馆的每个人都对你非常友善，不但友善，还让你觉得那个曾经孤单的自己，从心底里变得温暖了起来。他们你变得更加幸福了。这种幸福跟之前你在其他的两个家里的幸福不一样。之前的家庭即使再好。偶尔你还是会有种自己是外人的感觉,心底里的自卑让你还是有些许隔阂。但狐狸旅馆不一样。每个人都没有血缘关系，但是每个人又好像是真正的家人一样。相互关心关爱。或者说这就像是你梦想中真正想寻找的那个家一样。是你的灵魂归宿。是家啊。\n你开始动摇自己的初心，开始逃避想去给稻荷神大人做使者的梦想。因为你舍不得这个地方。你舍不得离开这里，舍不得你现在的\"家人\"。还好姝妹小萌就在你隔壁的稻荷神社里修行，虽然你不能去看她，因为修行都是独立的，而且要受到限制，不能互相走动。但你觉得妹妹还在那里努力的修行。你怎么能就这么筒单轻易的放弃和妹妹的约定，所以你还是把成为神使当做你的梦想！\n【我的，家人们】\n在旅馆的日子越来越长，你也越来越熟悉这里的工作和生活。你也认识了旅馆的客人们。有一批【天御院】的大天狗大人们经常来这里吃酒。但这些大天狗在这里喝酒吃饭。从来都不给钱，赊账。阿玉姐姐很苦恼这些人。而且阿玉姐姐去要过账，这个【天御院】从来都不给阿玉姐姐结帐。推三阻四的。你很奇怪。天御院明明守护京都的存在，为什么这些天狗过来吃饭不给钱呢?\n所以你也不喜欢大天狗。但是有一只大天狗除外。因为这只大天狗，跟优子走得特很近,他经常带优子出去玩。既然是优子的好朋友。那也是你的好朋友。你经常看到他，为了表达善意你也会问他:\"天狗哥哥要不要吃饼干?\"之前他并不会和你有太多交流。但后来不知为何，可能是他吃过你的饼干之后吧，他会在给优子带礼物的同时给你回礼，他有时候会折一枝樱花或者带一片枫叶。或者是一颗漂亮的鹅卵石。\n旅馆还有一个头很长的妖怪——【滑头鬼大人】。你管他叫叔叔。因为他岁数很大，听说他很厉害，是整个京都妖怪的老大。但这个滑头鬼叔叔很奇怪。一把岁数了还总来蹭吃蹭喝，也从来不给钱。不过虽然他不给钱，但是阿玉姐姐却不恼。还是给他吃。而且滑头鬼叔叔对谁都是和蔼可亲的样子。因为阿玉姐姐对他不错。你当然要对他友善，所以你也经常会拿爪爪饼干给他吃!问他:\"滑头鬼叔叔。你要不要吃爪爪饼干l\"他看着你笑得眼睛都眯成缝了，就摸摸你红色的小脑袋说，小暖，来。叔叔带你出去玩。他就带着你到院子里去放风筝,去看花。去捉虫子。你和他出去玩也总是很开心。像长辈，又像朋友。\n你觉得狐狸旅馆像是有魔力一样，每个在这里的人都友善又开心。直到有一天滑头鬼叔叔带来了一个客人。滑头鬼叔叔说她是个雪女。叫【雪姬】。但是她好奇怪，头上顶个乌云,还会下雪1她一脸不开心皱着眉头。进了房间就把自己的门用冰封住。阿玉姐姐叫她好多次吃饭喝酒，她都不出来。你有点担忧。她这么不开心。自己还冰封起来!不是更难受了吗!\n有天滑头鬼叔叔带你出去玩,你正在抓蝴蝶的时候,滑头鬼叔叔突然一脸郑重的对你说∶小暖。滑头鬼叔叔想拜托你一件事。我一直觉得小暖就像一个小太阳。你和你的爪爪饼干温暖了我们所有人。你看那个雪姬，其实她很孤独。你可不可以也试试看送饼干给她吃?你思考了半天，滑头鬼叔叔对你一直很好，这是他第一次拜托你。而且你也确实很担心这个愁眉苦脸的雪姬。你郑重其事的点点头应了下来。\n之后你就每天去找她。用小爪爪拍门。叫她出来玩。她从来都不回应你。你还是坚持不懈的敲门。可是门上都是冰，你的手生了冻疮，裂了很多小口子，阿玉姐姐心疼你。叫你不要去了，但你还是坚持每天去拍门。边敲门边大声的喊。\"雪姬雪姬，外边的蔷薇花开了，可漂亮了，你出来看看吧!\"。\"雪姬，今晚天上全是星星，你快出来看啊!\"。\"雪姬。刚出炉的新鲜的爪爪饼干，快出来吃啊!\"起初她不理你，可是你每天都会去。每天都会有咚咚的敲门,终于有一天，雪姬忍受不了了。开门冲着你说\"你烦不烦啊!真的很吵耶,你可不可以别敲了!-说完。你抬头看着面前的雪姬。黑色的长发。雪白的肌肤，长得像个瓷娃娃一样好看。你笑嘻嘻的从身后掏出一块小饼干伸到她面前。小声地说∶\"雪姬。吃小饼干嘛，刚出炉的，可香了，你尝尝。\"\n她看着你的眼神闪过一丝异样。你发现她眼睛里闪闪的，好像有星星一样。这时你发现她头上的乌云似乎散开了一点。她让了让身子邀请你进屋，你发现她整个房间都是冰封的,好像来到了冰雪世界。你冷的搓着手，红彤彤的脸蛋对着他笑，\"我叫小暖。我看你啊总是一个人在房间里。一个人多孤单啊。我可以每天来找你玩吗?\"她看着你。突然轻轻笑了起来。她笑起来更好看了，眼睛弯弯的。她摸着你的头。说\"可以啊。我叫雪姬，谢谢你的饼干，很好吃。\"你把一整袋饼干塞到了她怀里\"雪姬。这些饼干都给你。你能告诉我你为什么不开心吗，你可以和我说说吗\"，雪姬认真的看着你。把她母亲从她很小失踪。后来她被男人欺骗的事都告诉了你。你听完后握着她的手，认真的说\"雪姬，我告诉你啊，我可得好好和你聊聊天了。你别难过，其实我也没有父母。但是我从小就遇到了好多有趣的人……\"对着雪姬说了许久，好像有倾诉也有安慰。\n从这天起你每天都会带着小饼干来找她。而她也会每天给你开门。听你聊经历的有趣的人和故事。有天你带着新开的樱花来找她。她正跟你一起吃着爪爪饼干，你突然闪着眼睛对她说∶\"雪姬。我可以做你的朋友吗?虽然我有家人。但我还从没有拥有过朋友。我想我们这样。应该就是朋友了吧?*雪姬思考了很久。她似乎也不知道什么才是朋友。可是现在，你每天都在期待着去找雪姬。期待给她的爪爪饼干，期待送她小的礼物。这...就是朋友吧?你期待的看着雪姬。直到她轻轻的点点头说∶'那我们。就是好朋友了…对吗?\"她刚说完。你就冲进了她的怀里。\"太好啦!小暖有好朋友啦'拥抱的感觉…好温暖啊。可是雪姬的怀里...好冷哦。\n成为朋友后你和她的关系越来越亲密。有时候她也会给你准备小点心，她会给你讲她遇到的故事。后来你发现，每天你找她的时候，门都是自己开着的。虽然雪姬还只是坐在房间里，但你觉得雪姬好像是在欢迎你，在等着你。有一天你去给客人送饭。来晚了，在拐角的时候你就发现有一个小脑袋，从她房间里伸了出来。探头探脑的，好像在找什么。但是看到你的时候又缩回去了。你知道是雪姬看你没来。再找你。你赶紧跑到她的房间。发现她虽然还是那么高冷的坐着，但嘴角好像挂了一丝笑意。随着你跟她友情的逐渐深厚，你发现雪姬头上的乌云比你第一次见的时候消散了一些。你觉得可能她的乌云不能彻底消失还有一部分是因为她妈妈失踪了。你总在心里想着，要为你最好的朋友做点什么。要是能帮她找到妈妈就好了。\n你就在这个旅馆里这么幸福的生活着，有朋友、有家人、有姐姐、有哥哥…你们旅馆的每一周都会有一天休息日，这个休息日你们都会聚在一起打妖怪牌。这是妖界最为流行的牌类游戏。你很喜欢打妖怪牌。因为每次打妖怪牌的时候，一家人都会聚在一起。围在暖桌的旁边。嬉笑怒骂的感觉特别温暖，这就是你想要的家的样子。虽然你很喜欢打妖怪牌，但是你打得不好。《妖怪牌》的牌中都封着一些可爱的小妖怪的分身影子。每张牌都有不同的属性，如果这牌和你自身的属性相同你还可以与牌建立联系，驱动同属性的牌，甚至释放一点小小的符咒来恶搞下大家。狐狸是火属性的妖怪，你可以驱动火属性的座敷童子这张牌。但是因为你法力真的挺弱。所以你打牌也就不怎么地。\n最近滑头鬼叔叔也加入了你们的牌局。每周都来看你们打牌，但是他每次只打两把，每把他都赢，从来没输过。但是打完两把他把牌一扔就走了，还说什么∶你们太菜了，再练练吧。虽然他嫌弃你们菜，但他每周都会跑来和你们打牌。\n最近你觉得旅馆里的气氛好像不太对。自从前段时候有一个退役的神使下来与阿玉姐姐聊了一晚上后，阿玉姐姐就开始愁眉苦脸的，也不知道是怎么回事。你去问她发生了什么。她却说你还小，不用管那么多。后来风一郎哥哥也开始跟着阿玉姐姐不开心。皱着眉头。做的甜汤都没以前那么甜了。接着你发现优子最近睡觉的时候左手似乎不太舒服，你问过她,她就支支吾吾的说，是给客人端盘子的时候受伤了，你很关心她，想帮她找找药，但你又想起来她是个木偶人，有什么药是有用的呢。最令你难受的是雪姬。她不在给你开门了，你去了好几次，她都说最近有事。让你暂时别去找她。你很担心。还是每天去敲门。她虽然每天态度很好，但还是拒绝说你别来了。我过段时间再找你玩。你就觉得很奇怪，好像旅馆里有什么不好的事情要发生了。\n这几天你听来吃酒的客人讲。过两天到稻荷神大人好像要来旅馆。选下一任神使了。你\n突然很犹豫很纠结，你知道他能选的除了你就是阿玉姐姐，如果阿玉姐姐去做了神使，她就要离开旅馆了。当然你觉得现在的你无论是接替阿玉姐姐承担起当老板娘的责任。还是去给稻荷神大人当神使你都能够胜任。可是你总感觉这个家会少了点什么。如果你自己去当神使的话。虽然可以离妹妹更近一些，可是你就要离开旅馆离开大家了。你一想到要离开就很难过，你不知道到底该怎么办。想了很久你决定去找阿玉姐姐聊聊。看看阿玉姐姐怎么想。\n你前往阿玉姐姐的房间，想去找她聊一聊。可是你在她的房间的拐角处被什么东西给绊倒了，你低头一看，是一个狼妖躺在地上。你很奇怪。难道是客人喝醉了吗?但你没见过这个客人。你上前想摇醒他。但是发现怎么都摇不醒。你仔细查看，发现这个客人居然死了!!\n你没见过死人，吓坏了。慌忙的想该怎么办?明天稻荷神就来了，如果现在把这件事情通报给大天狗的话。会不会把旅馆给封锁了?如果封锁了。大家都得离开这里，那不行!你使出\n吃奶的力气想把他藏起来。因为你才的身高也不到一米。而这个健壮的狼妖却有1米8，你费了老大劲。终于从走廊把他拖到了后院门口，你实在是拖不动了。你只能把他先丢在这，至少离阿玉姐姐的房间远一点。\n你很害怕狼妖被别人发现，也很害怕明天稻荷神大人不会来。但因为这个插曲。你也没能找阿玉姐姐好好聊聊天。你自己也没想明白。你到底想留在旅馆和大家在一起，还是和妹妹一起成为神使。可能这两件事对你来说都同样重要吧。\n但无论如何这个旅馆对你来说都是最重要的家。无论离开还是留下，你都会保护这里，保护这里的每一个人。\n",
      "Script": "【清晨的阳光】\n今天你的心情又纠结又兴奋，小脸皱成一团的站在衣柜前挑和服。优子刚睡醒，揉揉眼睛问你怎么了,你惊讶的对她说,今天稻荷神大人就要来旅馆了!听说是亲自下来挑选神使呢!\n你还在纠结穿什么。优子却随手穿上了她最喜欢的那件小兔子和服。你赶忙让她穿的更加正式一点。她被你嚷的无奈，只能从衣柜里取出平时不怎么穿的华丽款套上，慢吞吞的梳\n妆后被你急匆匆的拉到了旅馆的大厅。\n来到大厅后你才发现大家已经都坐在大厅内了，桌上还放着妖怪牌，看起来已经洗好分好了，但是大家却并没有开始打牌的意思。阿玉姐姐和风一郎哥哥脸色凝重，滑头鬼大人也正襟危坐，大天狗大人今天居然也在。雪姬居然也破天荒的出现在大厅里。你发现她看到你时表情明显发生了变化，欲言又止的样子让你有很多想要问她的问题。\n你略微考虑了一下，还是坐在了阿玉姐姐和滑头鬼叔叔旁边。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "【家？决不能被毁掉】\n你从未想过会发生这样的事，你追随了半生的梦想，妹妹的梦想\n京都的主神稻荷神大人就这样死在了你的面前。这是你第一次亲眼见到他。却也是最后一次。\n缓过神后你突然想起那两个神使所说的话，旅馆必须要被毁灭?这可是你来之不易的家,这里有你最爱的家人们，还有你最好的朋友!你突然明确了自己的心意。那就是拯救旅馆。保护家人。\n你不能让这里被毁掉。你一定要拯救这里，守护旅馆和你爱的人们！！！\n小暖。你可是狐狸旅馆的小太阳啊。温暖每一个人的小太阳。\n加油吧!小暖!\n",
      "Ability": ""
    },
    "小人偶": {
      "Story": "你叫优子，是一个被遗弃的人偶娃娃\n——你永远都会记得你来到狐狸旅馆的那天，从那开始，你的命运彻底改写。\n【怨念的娃娃】\n你出生在一个远离京都俗世的村庄之中。这个村庄有一位非常有名的人偶匠人，他制作的人偶都精致华丽。栩栩如生。许多人慕名而来，花高价购买人偶当做艺术品珍藏或送人。你也是这个匠人制作的人偶之一，你与那些不同的是。你格外的灵动，仿佛下一秒就能活过来。你是那个匠人最为骄傲的作品。他把你摆在家里最显眼的位置。让他的夫人每日为你清扫，还做了许多漂亮的衣服。你以为你不会像其他人偶那样被人接走。会在这个家一直住下去。但命运还是无情的嘲笑了你的美好幻想。\n那天一个戴着眼镜的斯文男人来到你家选购人偶。左挑右捡之下似乎都不满意。直到他看到被摆放在最上面的你。他双眼发光。双膝跪拜匠人希望可以把你带走。你看到老匠人犹豫了。很不舍的样子。这时这个男子从包里掏出了一叠花花绿绿的纸递给了老匠人。老匠人沉吟片刻，伸手接过那沓纸……之后你就随着眼镜男离开了你出生的地方。\n他带着你坐进一个大铁箱子。过了不知道多久，从铁箱子出来后又坐小铁箱，虽然一路波折，但眼镜男对你格外珍惜，小心翼翼的把你捧在怀里。最后你跟着他来到了一座漂亮的宅子里。宅子里有一个温柔漂亮的女人。她接过你。轻轻的把你擦拭干净。然后摆放在一个透明的大柜子里。之后你就在这住下。\n在这的生活似乎没什么不好，女人经常会打开柜子擦拭你。也会给你换衣服，梳头发。不知过了多久，你看到女人的肚子突然变得大了起来，男人也小心翼翼的呵护着女人。比对你还要小心。这段时间也没有人在打理你。你精致的和服上落了灰。头发也有点毛糙。又过了一段时间，你发现女人的肚子变小了，但她怀里出现了一个小肉球。你看男人和女人极尽宠爱那个小东西。你看着他从地上爬到蹒跚学步到呀呀学话。女人把全部的精力都给了这个小东西。男人每次回来也是陪着小东西玩耍。他们不再怎么管你，只是偶尔会帮你禅禅灰。\n那小东西长大了。在地上跑来跑去，。是个可爱的女孩。她指着柜子里的你向女人撒娇，女人把你拿出来递给了小女孩，还叮嘱她要小心对待。不过小女孩似乎很喜欢你。会每天给你梳头发。抱着你睡觉。经你做新衣服。虽然你从来没有这么亲密的和人接触。但这感觉也不坏。\n直到你看到女人的肚子又大了起来，你发现小女孩似乎不是很开心，但是一段时间后女人又抱回来了一个肉丸子，小女孩就像当初的你一样，被冷落。被忽视。男人和女人的注意力和精力大多数都给了那个新的小东西。小女孩只能抱着你默默地哭。你想安慰她，但你既不会动。也不会说话。只能默默地陪着她。\n那个小东西逐渐长大了，是个小男孩。混世魔王一样的性格。什么东西都被他破坏。乱丢。他看上了小女孩怀中的你，小女孩不愿意。哭着找女人，女人却只是轻声安慰。出门买了个漂亮的芭比人偶给小女孩。小女孩十分不舍的把你交给了女人。女人把你给了小男孩。小男孩把你的衣服扯坏。拿剪刀把你的头发剪得参差不齐，直到男人回来。看到男孩这样对你后他训了男孩几句，把你拿来给女人。女人修补了你的衣服。把你放进了阁楼的柜子里。\n你呆在暗无天日灰尘满布的阁楼里不知过了多少年月，你睑上漂亮的妆已经消失。头发纠缠在一起，衣服也都褪了色。有天终于有人打开了阁楼，你看到小男孩小女孩都长大了，那对夫妻也头发花白。他们收拾着家里的东西。似乎要搬家了。女人拿起你看了看。皱了下眉头就递给了男人。男人看你这样叹了口气。并没有带走你。他们就这样离开了。后来有人来收拾这里的垃圾，连同你一起丢在了门口的垃圾箱里。你从没想过有一天你会变成这样，又脏又破。被人丢弃。丢在恶昊的垃圾桶里。你的怨气也越积越重。\n【命运的遇见】\n就在你即将变成一个诅咒娃娃的时候。一双漂亮的手将你从垃圾桶里捡了出来。你看着眼前漂亮的女子，感受到她身上跟你一样的气息，也是个妖怪呢。她疼惜的看着你。将你擦干净后放在一个柔软的篮子里，带你去了俗世的一个妖怪手艺人那。那是一个长着四双眼睛八只手的老人家，他的妖怪修理店开在闹市旁边一个僻静的小巷子里，旁人不得门道的话是无法进入的。这家店专为生活在俗世的妖怪们修理宝器。物品等。\n她把你拿出来递给蜘蛛老人，老人小心的为你修补伤痕，画上精致的妆，拿出新的假发给你一根根接好，又拿了一套非常精致的小和服给你穿上。之后老人拿出一面镜子，你看着镜中的自己，比你刚被做出来还精致漂亮。蜘蛛老人满意的看着你，笑眯眯的说下次有需要随时可以来找他,之后那个漂亮的女人和蜘蛛老人走到了一个你看不到的角落耳语了些什么,之后她就带你走到了一片满是红色鸟居的地方.\n她顺着鸟居一路上山，走进了森林。在森林深处有一栋漂亮的日式温泉屋，牌匾上挂着【狐狸旅馆】。这是一栋全木质的老式温泉旅馆,每块木头都散发着柔和的光。屋内有大片的草坪和一个波光粼粼的大湖,湖边百花齐放。鸟语花香。\n之后你就住在了这个狐狸旅馆里。来到这后你发现你可以活动了，也可以讲话了。后来你才知道这个狐狸旅馆是俗世去神域的入口，在这个交界处生活着许许多多的妖怪。有的妖怪因为自身的原因在俗世。能保持原型。但因为神域的入口灵力充沛。妖怪的法力也会自然而然的提升。当初捡到你的女人正是这旅馆的主人，阿玉。她是一只九尾狐。虽然也是狐族，但她并不是稻荷神的使者。并不是所有狐狸都可以做神使。只有被主神挑选或经过一年一次的选拔才能进入神域去侍奉主神。这间旅馆正是稻荷神的预备使者们修习的地方。当然，也是普通妖怪参拜稻荷神的地方。你也照例去神龛处参拜了稻荷神，但许愿时你却犯了难，你也不知道自己有什么心愿。想了半天，最后许下了一个简单地愿望∶希望怨气能彻底消散。能获得自由。许愿后神龛突然发光。然后在神龛前出现了一个御守，你拿起御守想要打开却发现怎么都打不开。你不知道你的愿望能否实现，但你还是把这个御守放在了自己身上随身带着。\n你从来没想过进入神域，因为在这狐狸旅馆中你已经获得了你梦寐以求的生活。阿玉给你布置了一间小房，虽然面积不大但五脏俱全。毕竟你的身材大小只是个娃娃，房间太大反而不太方便。你在这里并不白住，为了感谢阿玉的恩情。你在这旅馆里做了一个小小的侍女。狐狸旅馆作为对妖与神明开放，为大家提供落脚度假之地。在京都地区广受欢迎。客人络绎不绝。而旅馆其他人也都非常友善，除了大姐大阿玉外。还有厨房的镰鼬大厨，经常光顾这里来喝酒的天狗大人们，偶尔出现在这里的滑头鬼大人。你很喜欢这个旅馆，在这里你找到了活着的意义。你很想帮大家做事。但是你被身材限制很多事都做不了。只能简单的帮帮忙，上菜啊，为客人倒酒。\n来狐狸旅馆吃饭喝酒的除了神明还有妖怪。大家都和谐的在这不大的旅馆里其乐融融的生活着。你逐渐融入了这里的生活，因为你经常会跑到厨房端菜，慢慢的和掌管厨房的镰鼬大厨【风一郎】熟悉了起来。他是个害羞内向的大哥哥。不怎么爱说话。却对料理非常认真。他每次看你来就会拿厨房的一些零食给你吃。哄你开心。他就像个大哥哥般照顾你。\n你很珍惜这种拥有家人的感觉，毕竟【家人】这个东西你从前从未真正拥有过。你知道【风一郎】每天都努力练习刀工与料理。是因为与【阿玉】的一句赌约。阿玉对你来说也是重要的家人，你希望他俩好，可是他俩一直较着劲你却插不上手。【阿玉】宛若是你亲生的姐姐。又有些像一个唠叨的母亲。从来没有人如阿玉这般对你这样好。亲手制作漂亮的衣服,为你梳头发，修剪发型。每天变着花样的送你不同的小玩具。给你搜集很多小画书，还会每天晚上来哄你睡觉。给你讲睡前故事或者是童谣。你从未感受过这种亲人般的温暖，你知道她做什么都是为了你好。虽然偶尔你会有种她再通过对你的好来寻求一些什么，但她却从未开口对你有过任何要求，你只能安慰是自己多心了。\n【特别的他】\n在狐狸旅馆的每一天你都充实而愉快，尤其是你认识了‘他'之后。你总是记不住他的名字。你只知道他是一位天狗大人。但是他和旅馆中其他喝酒吵闹的大天狗不一样。每次他来的时候都是一个人单独坐一个桌子。安静的吃着东西。然后静静的喝两壶酒。平时都是【阿玉】侍酒，但有一次阿玉姐姐有事。便让你给他倒酒。你吃力的抱着一个跟你差不多高的酒瓶来到桌子边。但你发现你够不到桌子上的杯子，你努力的垫着脚想要把瓶子倾斜过来想要给杯子倒酒。\n这时你发现脚下离地，你被旁边的天狗大人整个抱了起来。他把你轻轻的放在桌子上,然后温柔地对你说∶\"你现在可以倒酒咯\"。你红着脸低着头给他倒好酒，接着偷偷的抬头看了他一眼。多么温柔的人儿啊，黑色的翅膀上有一个月牙形状带着一个圆的印记。脸上看不出表情。但是目光却非常友善。你小心翼翼的从桌子上下来。心里突突突的跳着。从这之后只要这位天狗大人来你就会抢着倒酒,渐渐地你也与他熟悉了起来。\n你知道他是天狗族现任大名的儿子，还有一个哥哥，他很努力。梦想是守护整个京都。你在心里想着，他与你多像呀，你想守护家人。守护旅馆。而他想守护住在京都的人和妖,守护整个京都。你越来越喜欢这个有点闷的天狗大人。他也越来越频繁的来旅馆找你玩。你在心里偷偷想着，你又多了一个要守护的人呢。\n有一次你想要和天狗大人比身高。你发现自己还没有到天狗大人的膝盖。你努力的仰起头想看到大人的样子，然后好奇的问'不知道大人你看到的世界会不会和我看到的不同呢′?突然你就被一双大手从地上抱了起来。接着天狗大人将你放在了他的脖子处对你说:‘这样，你看到的就和我一样了'。\n说完后他突然双翼震动，接着带着你直接飞上了天空。你离开了旅馆的结界，又变回了那个不会说话不会动的木偶，但是你能看到这个世界。你第一次从这么高的地方俯瞰整个稻荷神山。翠绿的山上点缀着些许红色的鸟居，旁边神社的红色屋顶连成一片,多么美啊。天狗大人好像发现了你的变化。急忙降落回旅馆的院子。\n他一脸着急的将你放下来问你是不是吓到了，怎么不动了。你跟大人解释了原因。然后`低着头，悄悄说:【虽然我不会动也不会说话。不能触碰春天的樱花，抚摸夏日的溪流，踏遍秋日的落叶，踩过冬日皑皑的白雪。但是我能看到这些美丽的景色已经很开心了，毕竟从前连看都是奢望。】天狗大人若有所思的点了点头。\n第二天他再来的时候，手中多了一个樱花图案的背包。他有点局促的说。这是送你的礼物。希望你可以躺在背包里。你打开背包钻了进去。发现里面被铺了厚厚的绒布，虽然缝得歪歪扭扭，但是大小跟你的身材也刚刚好。你躺进去后发现有两个小洞，刚好是你眼睛的位置。接着你感觉到背包被人合了起来。然后你感觉到天狗大人把这个包背在了胸前。你透过洞看到你们飞了起来，开始在整个京都上空飞翔。你看到下面灯火通明的京都宁静样和，想着这一定有他守护的功劳吧。从这之后天狗大人经常带着这个樱花包和你飞在天上，带你去看你从未看过的景色。可能是因为你一直待在他的胸口处吧。你的心也渐渐的离他越来越近。\n【想守护的家】\n除了天狗大人外，对你来说最开心的事就是每周旅馆休息的那天。大家会聚在旅馆的休息厅中，一个矮桌，一床暖被。大家围在桌子边一起打妖怪间最流行的游戏《妖怪牌》。《妖怪牌》的牌中都封着一些可爱的小妖怪的分身影子，每张牌都有不同的属性，如果这牌和你自身的属性相同你还可以与牌建立联系，驱动同属性的牌。甚至释放一点小小的符咒来恶搞下大家。你是木偶娃娃。所以你的木属性的妖怪。但是妖怪牌中并没有木属性。你只能小小的驱动土属性的【山鬼】牌。不过你也不喜欢给牌中下恶搞咒语。毕竟他们都是你的家人。\n虽然你只有矮桌那么高。但是风一郎专门为你制作了一个小凳子。让你可以够的到桌子。你来到狐狸旅馆后阿玉教会了你如何打这个简单又欢乐的小游戏，但是你基本没怎么赢过。最根本的原因是在这个又名信任的游戏中，你只想相信阿玉姐姐和风一郎哥哥，而你更不想欺骗他们。你就是这样执拗的在很多细枝末节之处守护着你来之不易的'家'。虽然你不经常赢，但是你却很喜欢跟他们玩，因为这种家庭聚会的时光让你更加觉得这是一个'家'。《妖怪牌》是一个二到八人都可以进行的游戏。所以每次一起玩牌的人并不是固定的，会打的客人有时也会凑进来。\n你是在这时与滑头鬼大人渐渐熟悉的。他经常在一旁笑着看着你们围在一起打牌。像一个长辈看着小辈玩闹一样。不知道为什么你每次看到滑头鬼大人都会有种威严又熟悉的感觉。不知道是因为滑头鬼大人让你想起了当初那个买走你的男人，还是因为他是京都所有妖怪的头领。这种威严使你想要靠近。\n有时你也会想，如果你是一个在俗世也能正常生活的妖怪，会不会可以加入滑头鬼大人的家族，毕竟你也曾经听闻客人说起过，滑头鬼大人在京都有一个大院子，里面有很多妖怪住在一起。热闹非凡。会不会你也有另一种生活。但这种想法也是转瞬即逝，毕竟对于你来说，没有什么地方比旅馆更温暖，更幸福。日子就在这种舒适悠然中度过，但最近，旅馆却格外的热闹。\n【新的家人】\n起初是有一只小狐狸。邋里邋遢的站在旅店门口,请求【阿玉】收留她。说她想在这里学习如何做一个合格的狐狸。【阿玉】疑惑的看着眼前红色的小狐狸。半晌后点头应允。你不知道阿玉为什么会同意让这个自称【小暖】的狐狸进入旅馆。你很害怕这个意外出现的不明人物会不会对你的'家'不利。正好【阿玉】问你。愿不愿意跟她出趟门。去看望一下【蜘蛛大师】，就是当初帮你修理好身体那个老匠人。阿玉邀请你当然愿意随她去，更何况你还有一个好主意。\n【阿玉】带着你又来到了那条小巷。随着\"叮咚\"的门铃声响起。推门而入后你又见到了那个专注的老人。他带着厚厚的眼镜。抬头看了你们一眼后点点头招呼你们坐下。之后他们走到房间的角落里，老人和阿玉商量着什么，但是老人不太同意的样子。你看到阿玉突然跪下。然后哭着说了些什么。接着老人勉为其难的点了点头，之后阿玉急匆匆的就出去了。\n之后老人过来拿起你准备给你的手臂补漆。因为你在旅馆住的时间比较长了，体内也有了一些灵力。只是非常微弱。你用尽全身的灵力。断断续续的对蜘蛛老人说∶我…有一个...请求。请...给我一..些--能够…保护我的…家人的….力量吧。老人看着你努力的样子问:\"我有办法,但是会非常的痛哦。你能忍吗?\"\n你努力的眨眨眼睛，表示你愿意。接着，你感受到左边的手臂传来了剧烈的疼痛，你的手臂被整个卸掉。接着老人掏空了你的手臂内里。然后把你的手切下来，把手当柄。在手的后边安了一个伸缩的剑。接着把手和胳膊安回去。\n老人对你说：\"这把剑就是你守护家人的力量。\"老人说完后就去离你很远的工作台开始做东西。他做了很久。中间断断续续的自言自语︰这可是大罪。可是阿玉又是那样好的孩子,怎么办呢。我到底要不要偷偷的告诉神明大人...你听的并不是很真切。但你还是努力地记住了他说的每一个字。很晚阿玉才回来。蜘蛛老人递给阿玉一盒东西，之后你们就回了旅馆。\n回去后你在最初的几天几乎寸步不离的跟着【小暖】，阿玉还安排了这个小狐狸跟你住在一起。你已经准备好。只要她稍有不对你就在她睡梦中用你的手里剑刺穿她的心脏。但你发现这个姑娘每天只是认真的完成【阿玉】给她安排的工作，虽然只是擦地板，收拾房间这种工作，但她每一件都完成的非常漂亮。她在工作间隙对你也很热情友善，拉着你问这问那，明明比你高两头却喊你优子姐姐。还总是抱着一桶饼干，问你要不要吃爪爪饼干。\n每晚还在房间跟你讲她来京都之前一路上遇到的趣事和形形色色的人。你后来也发现她没什么威胁。便在心中暗暗的同意了【小暖】加入旅馆，加入你们这个家。你想着反正你也没有妹妹。就当她是妹妹吧。她跟着你们一起打牌。一起生活。这个家温暖而融洽，这都是你守护的功劳啊。\n滑头鬼大人突然带来了一个奇怪的雪女。她的头上自带一朵乌云，总是一副不高兴的样子。她住进旅馆后就把自己关在房间里。不让任何人进去。也从不出来。刚开始阿玉姐姐还去邀请她一起吃饭打牌，但是得到的回复永远只有冷冰冰的拒绝。你每天去给她送饭也进不乏去她的房间，而且你也不愿多在她的房门前停留。因为她用冰将自己的房门冰冻了起来。你每次只把饭放在她门口就匆匆离开了。其实有时你也会想，这个雪女倒是挺像之前差点变成诅咒娃娃的自己，看起来也很孤单难过。只是你的运气多么好啊，遇到了阿玉姐姐，拥有了家。\n后来你发现小暖不知为何开始天天去敲雪女的门，每次都冻得小爪子通红。你觉得她有点傻的可爱，也劝过她。但是她却略有些倔强的说∶\"我答应了别人。要给她送饼干吃的!\"没办法，谁让她是你的傻妹妹呢，你也就随她了。\n【涌动的暗流】\n最近阿玉姐姐心事重重，你询问过她，却被以你是小孩子不需要知道那么多为理由敷衍过去了。你想起姐姐去蜘蛛老人那里带回来的东西，一定和那个东西有关!你决定偷偷去姐姐的房间翻找一番。你趁姐姐外出采买的空隙偷偷的跑到姐姐的房间,在里面翻了好久。终于在抽屉里翻到了那个盒子。打开后你发现竟然是一套新的妖怪牌。你在心里想着明明你们现在那套还能用，为什么要做套新的呢?你想要把这套牌处理掉,直觉告诉你这个牌有问题。\n这时你听到门口有脚步声，你赶忙把牌放在抽屉里。然后躲进了壁橱的被子里。坐在被子上想着怎么处理牌，突然有点困，可能是因为刚才翻东西耗了太多力气。想着想着。你就睡着了…也不知道睡了多久。你听到一阵塞塞窣窣的声音，你透过壁橱的缝隙往外看去，发现外面有一个你从没见过的狼妖在四处翻找什么。接着你看到他马上就要碰到你刚才放牌的抽屉。你连忙打开衣橱。揉揉眼睛装作刚睡醒的样子，开口问到:\"这位客人。你是不是迷路了。这里是我的房间哦，你可能进错房间了。\"\n那个狼妖看到你时吓了一跳。但仔细看清你是个人偶娃娃时偷偷松了口气，回你说是他迷路了，再找自己的房间。你走过去抬头看着他说∶\"这位客人。由我来带你回房间吧，不过我走的比较慢，如果您不介意的话，可以抱着我吗\"狼妖见你小小的，也没多想。可能也是为了掩饰他的行动，就点点头弯下身抱起了你。你跟着他从房间出来。在房间旁一个阴暗的拐角，你趁他四处张望时从把左手的手里剑抽了出来，直接刺向了狼妖的心脏。一刀毙命。他不可置信的把你扔在地上，接着就倒了下去。你走过去小心的试探了他的鼻息。发现确实死了。这时你猜意识到一个问题。你…搬不动尸体??\n你努力的搬了半天，最后也没能拖动他几米。你只能找人帮忙。想了半天，能帮你的只有风一郎哥哥。你飞一般的冲到厨房，看到正在看料理书的镰鼬哥哥。你飞快的告诉他，你看到一-个狼妖再翻阿玉姐姐的东西，然后你为了保护姐姐就把他杀了。但你搬不动尸体。\n风一郎嘴角带笑的摸着你的头说:\"我们的优子是不是做噩梦了呀。没事没事了，想不想喝糖水?哥哥给你煮一碗红豆羹吧?\"你见他不信。又来不及解释那么多，只能急忙拉着他到那个拐角，边走边说，你不信跟我来看啊，尸体就在那。当你带着哥哥来到那时你傻眼了,尸体竟然不翼而飞了?!原本有尸体的位置现在空空如也。\n风一郎把你抱起来，摸着你的头说好了没事的，做噩梦而已,我去给你做点红豆沙吃。你摇摇头把你在蜘蛛老人看到阿玉做东西以及蜘蛛老人言语的话都告诉了哥哥，说你害怕那个东西被别人发现，那个狼妖翻到了姐姐让蜘蛛老人做的东西你才要杀他。说到这你发现风一郎哥哥脸色一变。接着他说让你先回房间,然后就冲进了厨房。\n你回到房间左思右想总觉得事情有些古怪。但你心里明白。无论如何这个家才是最重要的。如果阿玉姐姐要做什么危险的事，你一定要在不伤害她的前提下阻止她!绝对不能让她做傻事。这个旅馆就是家，而【风一郎】，【阿玉姐姐】，【小暖】都是你非常重要的家人。你不能失去他们任何一个。\n你，是这个家的守护者。\n",
      "Script": "【清晨的阳光】\n今天你刚刚起床就发现小暖又纠结又兴奋，小脸皱成一团的站在衣柜前挑和服。你揉揉眼睛问她怎么了，她惊讶的对你说，今天稻荷神大人就要来旅馆了!听说是亲自下来挑选神使呢！\n你这才想起这几日旅馆的众人都在筹备着些什么。原来是要迎接神明大人啊。你随手穿上阿玉姐姐为你做的你最喜欢的那件小兔子和服。小暖却嚷着让你穿的更加正式一点。你被她嚷的无奈，只能从衣柜里取出你平时不怎么穿的华丽款套上，慢吞吞的梳妆后被小暖急匆匆的拉到了旅馆的大厅。\n来到大厅后你才发现大家已经都坐在大厅内了，桌上还放着妖怪牌，看起来已经洗好分好了。但是大家却并没有开始打牌的意思。阿玉姐姐和风一郎哥哥脸色凝重，滑头鬼大人也正襟危坐，大天狗大人今天居然也在。他看到你眼睛一亮。冲你笑了笑。这时你注意到那个头顶乌公的雪女居然也破天荒的出现在大厅里。你发现她看到你身旁的小暖时表情明显发生了变化。欲言又止的样子跟冷若冰霜的形象倒是有些不同。\n你略微考虑了一下，虽然很想坐在天狗大人身旁，可今天似乎会发生什么大事的样子,稳妥起见还是坐在阿玉姐姐和风一郎哥哥身旁吧。下定决心的你走过去坐在了他俩旁边,一时无言。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "【毁灭！还是守护】\n怎么办。你到底要怎么办才好?1\n你没想到竟然会发生这样的事。京都的主神大人，竟然死在了这间旅馆里。死在了大家的面前。无论如何这家旅馆都要被毁掉吗..大家…都要死吗\n不可以！！！\n你可是这家旅馆的守护者啊，这里可是你的家，是你最重要的东西。这里有你的家人。要守住旅馆，要守护好大家，保护好这个家!一定不能让旅馆毁灭，一家人一定要在一起!\n想要一直延续..延续幸福和快乐啊。\n还有天狗大人..还想在他的胸前，一起再去看看外面的世界啊。\n优子!加油吧,请你一定要守护好这间【狐狸旅馆】啊!\n",
      "Ability": ""
    },
    "雪女": {
      "Story": "你叫雪姬，是一个想要逃离自己命运的雪女\n——你会永远记得，哪个改变你命运的’他‘。\n【白色的世界】\n你是如何诞生在这个世间的，你完全不记得了，只记得在幼年时期，只有漫天苍茫的白雪，满目望去天地间都只剩白色。你和你的母亲住在一座雪山山顶。你的母亲是一个美丽却忧郁的女人，肌肤胜雪，红唇黑发，仿佛是这世间最美的人儿。但她却不快乐，你从没见她笑过。幼小的你并不明白母亲的心思。只知道每次母亲从外面回来总会带一些漂亮的冰雕,而冰雕中总是冻着各式各样的男人。\n你有时也会疑惑你的父亲是谁，但你不敢问你的母亲。你怕看到母亲哭泣，更害怕看到母亲发狂。每当你的母亲带回冰雕后都会把自己关在洞中，你只能听到里面传来愤怒的辱骂,尖利的哀嚎，悲伤的哭泣。还伴随着洞穴的颤动。毕竟你的母亲是一只高级雪女，法力十分强大。她发怒或悲伤的时候，这方圆百里都会下雪。小小的你总会偷偷的想，等你长大了，变成一个成熟的可以施展法力的雪女。你一定不会像母亲这样。会做一个好妖怪。\n你的母亲总是不在家。不会教你法术。不会教你控制力量,也从没教过你该如何做一只雪女。但她总会跟你说。远离人类。人类都是十分危险的。还有永远不要轻易相信男人。男人都是骗子。你似懂非懂的点头。并不明白男人指的是什么，是那些冰雕里的人吗?但他们都已经被永远冻了起来，又有什么不可信呢?\n长大一点的你也会偷偷的跑去人类的村庄，看看母亲口中的人类究竟是怎样的,你看他们宁静样和。男耕女织。一点也不像母亲所说的有危险的样子。你看他们因为你母亲的情绪所造成的大雪而饥寒交迫，有人背井离乡，有人冻死街头时，你的内心是责怪你的母亲的。你不明白母亲为什么要给这些无辜的人制造这些苦难。但你也无能为力，你只是个不成熟的雪女。你连降雪都还不会。更何况其他的高级法术呢。你冲回家去问母亲，但你回去后发现母亲又没有回来。\n你在家等啊等。等了不知多少个年月。却再也没有等到你的母亲回来。你出门去寻找她,走遍了这方圆百里，你发现周围的冰雪融化了。除了你家的那个雪山外，山下的田野，小河,村庄。都充满了生机。你想不明白为什么母亲不见了，为什么母亲的冰雪融化了，但是你想通了一件事，你的母亲再也不会回来了。你回到雪山上，尝试了一下降雪。你发现你很轻易的就制造了一场鹅毛大雪。原来这雪山上的雪现在还没有融化是因为你。因为你终于是一个成熟的雪女了。\n你离开了出生的雪山，走到人类的村庄和他们接触，想看看没有了母亲的雪他们生活的怎么样。当你踏进村庄后，一堆人把你围了起来。你看到男人不怀好意的眼神和女人充满敌意的目光。他们拿起了草叉，镰刀，把你越围越紧。你想解释你的来意，但是你听到他们喊着雪女来了！又是一只雪女！快拿火来，把她烧死！不然又该下雪了！\n你赶紧回话到你只是想来看看他们生活的怎么样，并不会伤害他们也不会降雪。但是他们根本不听你的解释，手中的武器离你越来越近，后面还有人举着火把准备往你身上扔。你脑中回想起母亲对你说的话，你终于愿意相信母亲说的人类的危险。你召唤冰雪将这些人微微冻住，然后飞一般的逃离了这里。之后你回想着他们的对话，觉得母亲的消失也和他们脱不了干系。\n【灰色的乌云】\n你回到你的雪山。努力练习着术法。你渐渐明白了作为雪女的职责。因为你感受到了富士山下有一股常滚烫的能量，似乎随时会喷涌而出。而雪女的存在就是要用冰雪封住这座大山里的力量。但你不想也不敢去承担这份职责。你怕你的能力不够，你怕永远都要呆在这座山上，你怕你会变得像母亲一样。更重要的是，你想要替母亲报仇。一日你从洞窟中出来,看到一个农夫打扮的男子晕倒在了地上。你是不信任人类的，但你的善良让你将他带回洞窟,他醒来后看到了你，他眼中满是惊艳。毕竟你继承了你母亲的美貌，他似乎发现了你的身份,但是他并不害怕。他告诉你他是为了他的替母亲采药才来这座山,却迷失在了冰雪里。这令人迷路的冰雪是你故意布下的,你害怕人类找到你。\n你并不相信他，又害怕他离开这里会告诉其他的人类你的所在。所以你并没有放他走,但你也不忍心要他的性命。但这人总是找借口和你聊天，给你讲故事。你听着他给你描绘的那些奇妙的景致，惊心动魄的冒险，渐渐地你放下了戒备。你与他相处的愈加融洽。你的心沦陷了，他看出了你的变化，一日他出门后很久才回来。你看到他从背后拿出了一个冰雕肖像红着脸送给了你。这肖像与你有八分相似，你看着他为了制作冰雕已经冻伤的双手，心里充满了感动，低下头害羞的不敢看他。他上前轻轻的拥住你，抚摸你的长发。你将自己的全部身心都交给了眼前这个男人。\n第二天你醒来后他穿好衣服在旁边看着你。捧着你的脸对你说。现如今你们算是夫妻了。他问你是否愿意让他下山去照顾他的母亲，他的母亲已经不行了，待他母亲归西后他就回来,与你厮守一生。你念他孝顺，更何况你与他已经有了肌肤之亲。你点点头，对他说\"阿木。我就在这山上等你回来。你回去后切勿和他人说起你在这里见过我，你能答应我吗?\"男人点点头说致死不会说出去，并且一定会回来。你说他出去。撤了你的冰雪迷阵，目送他下了雪山,离开了这。\n之后的你就拿着他为你雕刻的小像在这雪山上等啊等，等了不知多少年。你一直相信着他。相信他会回来。你早把他当成你的夫君，你想着母亲说的男人不可信。可能是错的。可是你等了许多冬夏。却没等到他。你不信他会骗你。但你对他的思念愈加浓烈。你给冰雕施加了永不融化的术法，然后下了山化成一个美丽的人类女人，前往他的村庄。\n你挨家挨户的寻找他，终于在一个破屋中见到了你日思夜想的男人。他正在阳光下侍弄庄稼。他回头看到你，愣了一下，但并没认出你。你正想冲上去抱住他，问他为何没有回来寻你。这时你看到他身后的房子里出来了一个长相平平的女人，她拿着两个饭团走过来递给了他，帮他擦了擦额头上的汗。对你福了福身就进去了。\n你愣住了，停下了脚步。阿木走到你旁边问道，小姐。家内让您见笑了，请问您来到这有何事啊?你看着眼前这个你曾经全心全意相信并爱着的男人，他没有遵守承诺,还娶了别人。你被愤怒占据了理智，将眼前这个男人冻成了冰雕。之后招来暴雪，将方圆十里的村庄全部淹没。你对男人彻底失望，也许你的母亲是你最后的唯一的依靠，所以你决定继续寻找自己的母亲\n你听闻京都有一八宝琉璃坊，八宝琉璃坊的主人名叫蜘蛛老人，知晓妖界的很多信息，所以你决定去打听一下你母亲的下落。来到八宝琉璃坊。刚入坊内，老人就抬起头，上下打量了一下你。惊讶的问∶\"你是富士山上的雪女?\"你心中疑惑到自己之前从未下过山。他说的一定是自己的母亲，于是缓缓回答到\"您说的应该是我的母亲,可是.…我找不到她了，您,您见过她吗?\"老人沉思了一会。叹了口气，说道:\"我，我记得当时看到了一个身影，它背身双翼。移动的太迅速了，它把你妈妈带走了。地上只留下一根黑色的羽毛，而且……我看到了他翅膀上的印记，一个月牙形状的印记，中间好像是个圆形。”\n听到老人这番话。你的心情无比沉重，难道妈妈真的被掳走了?她去哪儿了?那个身影为什么要拐走妈妈?辞别了老人。你沿着河边一直走啊走。脑海里全是老人的话，妈妈的身影,还有那个男人的谎言。想到这里，你的心里开始崩溃了。这个世界为什么对自己这么残忍，,难道你的存在只是为了体验这个世界所有的痛苦?于是你发动灵力,在自己的头上结了一朵乌云，想哭的时候，乌公会晃动它小小的躯体，飘落下些雪花，而有它的陪伴，会让你心理舒服一些。\n【灰色的京都】\n你漫无目的的继续前行,突然一个身影拦住了你的去路，你抬起头。那是个头无比长的妖怪,他疑惑的看着你。问到\"你是富士山上的雪女吗?\"你看着这个滑稽的妖怪,心理嘀咕到,怎么这么多人都见过我的妈妈。他会知道妈妈的事情吗?于是你冰冷的说到\"那是我妈妈，她。她失踪了。我这次下山就是想找到我的妈妈。\"妖怪听完后对你伸出了一只手，说道:\"我是京都的妖怪统领。滑头鬼大人!此次专程来调查富士山雪女失踪事件的。既然她是你的母亲，你愿意帮我调查吗?\"你看着他心里嘀咕道，他真的能帮你找到妈妈吗？算了，如今也没有别的方法。于是你冲他点了点头，把蜘蛛老人告诉你的羽毛和图案的事情告诉了他。\n他把手尴尬的收回。继续说道，\"雪女失踪了怎么这富士山还是皑皑白雪啊，看来小雪女灵力也很强大嘛! \"突然他看到了你头上的乌云，想伸手去推走它。手刚碰到一个角，就被冰冻的缩了回来，\"这是啥啊，你头上这玩意能消散不?\"你一边向前走边冷冷的回答\"不能\"。他追了上来\"那你能开心点吗?\"看了他一眼，说到\"不能!\"\"那你能笑一下吗?”\"不能!\"\n他尴尬的咳嗽了一下。继续喋喋不休的说到\"好吧!那你可要跟紧我!我们去京都，那儿是我的地盘，到处都是我的兄弟，你跟不紧受欺负了我可不管喔!\"你看着他的样子。好气又好笑，你和他打了声招呼，转身回富士山上下了两年都不会融化的雪，毕竟这是雪女的职责,下山后,你们踏上了去往京都的路。\n路上滑头鬼大人看着你头上的乌云，一直小心翼翼的问你\"你头上的乌云能消散吗?\"\"你能开心吗?\"\"你能笑一下吗?\"而你没有任何的心情理他。终于到达了京都，他把你带到了一个大院子里。让你在这住下。这院子里住了很多妖怪，他们每天都感觉莫名其妙的快乐，天天的不是打什么妖怪牌就是喝酒,你被他们吵得头痛,从不参与他们的活动。过了好多天，你并没有得到任何关于你母亲的消息，头上的乌云反而更加浓密了。\n一天，滑头鬼大人说\"我带你去稻荷神社祈个愿，散个心呀。\"你懒得搭理他。就冰冷冷了说了句\"不去。\"他接着说\"稻荷神社旁有个狐狸旅馆，那里有很多大天狗，你可以住在那里看能不能遇到带走你妈妈的大天狗。\"听到有可能找到你妈妈的下落，你立马答应了。你们来到了狐狸旅馆，你看到这里有好多奇奇怪怪的妖怪。而他们一直在傻乐，也不知道在开心什么，而且这儿的很多妖怪好像也很喜欢打妖怪牌。对你来说这番景象简直要吵死了。接待你的是一个温柔的白色九尾狐。不过你并没有给她什么好脸色。把你安排在了后院的一个房间。滑头鬼还硬拉着你去神龛许愿，说这边许愿很灵的。你无奈之下只能做了祈祷。许愿时你想都没想便许了∶希望可以找到妈妈，希望能够鼓起勇气和妈妈一起压制火山守护京都。许愿后神龛突然发光，然后在神龛前出现了一个御守，你拿起御守想要打开却发现怎么都打不开。你不知道你的愿望能否实现，但你还是把这个御守放在了自己身上随身带着。\n许愿后你就去了自己的房间。进入房间后，你立刻把屋子的门窗都冰冻了起来。除了找到自己妈妈的下落。你没有任何心情认识这里的人。刚开始老板娘还会来邀请你一起吃饭打牌，你都冷冷的拒绝了。渐渐地也就没人再来打扰你，可这样正好符合你的心愿。\n住进狐狸旅馆后。每天都会有一个非常矮的小人偶给你送饭，你懒得理她。以她的身高,你可能会一不小心就踩到她的头，你从不让她进门，只让她把饭放在门口。而每次你吃完饭门外就会有个男人的声音响起\"您好l我是这里的厨子l请问，您觉得我做的饭好吃吗?\"你看着桌子上的饭菜。先不说它凉透了。你也没有心情吃饭啊。所以你就冷冷的回他\"不好吃，走远点!\"起初他还会在门口继续问，\"请问，哪里做很不能好，诸指点。\"后来他也烦了，会用拳头砸你的冰门，甚至还会对着门扔莱刀，\"喂!你很没礼貌耶!你给我出来!哪里不好吃!你说啊!\"。当然，你的心里只有找到妈妈的下落，完全不想理会他,\n这里的妖每天就是傻乐，打牌，老板娘阿玉和滑头鬼大人也会喊你出来打牌，终于有一次你受不了了，冲着滑头鬼说:\"不是调查我妈妈失踪案吗，你找到线索了吗?\"他看着你生气的样子，一脸委屈的说到。\"别生气嘛，我不是调查到了嘛。那个羽毛啊，是大天狗的!他也会时不时来这个狐狸旅馆。\"他看着你的眼睛亮了起来，继续问到\"如果调查清楚。你头上的乌云能……\"没等他说完。你啪的一下把冰门关上了。你脑海里都是妈妈的样子，于是施展了灵力，摆出了几片小雪花，小雪花是你的意念之力，贴到别人身上可以悄无声息的跟踪他。你偷偷来到了前院。正是大家坐在一起吃饭的时候，滑头鬼大人正拍着桌于说\"咳咳，这顿饭记我账上了啊。京都都是我的地盘，钱不钱的算什么。\"你不屑的警了一眼他，控制意念捏出了一片雪花贴到了大天狗的身上。回到房间后，你想到自己并不方便在旅馆来回走动，又贴了一片雪花给你送饭的小人偶优子的身上。\n【红色的小暖】\n就这样过了一段时间。旅馆好像来了一个新成员。每天会有女孩子的声音在门外。边敲门边大声的喊。\"雪女姐姐，外边的蔷薇花开了，可漂亮了，你出来看看吧!\"\"雪女姐姐，今晚天上全是星星，你快出来看啊!\"\"雪女姐姐,刚出炉的新鲜的爪爪饼干,快出来吃啊!\"起初你并不想理她，可是她每天都会来，每天都会有咚咚的敲门声。这次你终于忍受不了了，开门冲着她说\"你烦不烦啊!真的很吵耶，你可不可以别烦我!\"说完。你低头看到了那个人影，大概比你矮两个头,那是一只红色的小狐狸，她水汪汪的眼睛看着你。从身后掏出一块小饼干，笑着伸到你面前。小声地说∶\"雪女姐姐，吃小饼干嘛，刚出炉的,可香了，你闻闻。\"\n看着她真诚的眼神，那是你从没见过的目光。你的眼睛有些湿润了。心里突然暖暖的，甚至。头上的乌云都散开了一些。你把她邀请进屋。可是整个房间的家具都是冰封的,她搓着手。红彤彤的脸蛋对着你笑，\"我叫小暖，你总是一个人在房间里，会很孤单的，我可以每天来找你玩吗?\"你看着她。这是你第一次冲着陌生人，笑了起来，你摸着她的头。说到\"可以啊，我叫雪姬，谢谢你的饼干，很好吃。\"她把一整袋饼干塞到了你怀里，\"雪姬。都给你。你为什么不开心啊。你可以和我说说话啊\"。看着她的单纯和真诚，你也开始和她聊了起来,把你母亲失踪。被男人欺骗的事都告诉了她。她听完后。握着你的手，认真的说\"雪姬。我告诉你啊。我可得好好和你聊聊天了。你别难过，其实我也没有父母，但是我从小就遇到了好多有趣的人…\"小暖的话匣子打开了就再也没有关上过。你很奇怪这么小的一个孩子怎么能这么能说。\n从这天起她每天都会带着小饼干来找你。而你也会每大给她开门,听她聊她经历的有趣的人和故事。有天她带着新开的樱花来找你。你正跟她一起吃着爪爪形状的饼干，她突然闪着眼睛对你说︰\"雪姬。我可以做你的朋友吗?我从来没有朋友，但我想我们这样，应该就是好朋友了吧?朋友?你思考了很久。这是你未曾拥有过的东西。你也不知道什么才是朋友。可是现在，你每天都在期待着小暖的到来。期待她的爪爪饼干，期待她那些小小的礼物。这…就是朋友吗?你看着小暖。轻轻的点点头说:\"那我们。就是好朋友了…对吗?\"你刚说完，一个红色的身影就飞速的冲过来。冲进了你的怀里。\"太好啦!'你很久没有与别人这么亲密了,可是拥抱的感觉…或者说你怀里的红色的小狐狸,好温暖啊。\n【黑色的翅膀】\n最近。你通过新贴在大天狗身上的小雪花听到了一段对话。似乎是两只大天狗的对话：\n\"之前那个富士山雪女的事.\"\n\"啊，那个啊，当时不是派了….去处理了”\n\"听说当时状况特别严重。那个雪女。把方圆…..全...\"\n\"好了好了，…大人不是派了……去处理，都把她消灭了这事就过去了”\n听完这些你攥起了拳头,原来你的母亲真的出事了，你又查看了贴在优子身上的小雪花,发现她最近和一只大天狗走的特别近。于是在她们聊天时偷偷跟了出去，借着灯光，你看到了优子对面的大天狗，它的羽翼上竟然有之前老人告诉过你掳走你妈妈的那个妖怪的胎记。\n回到房间。你忍不住哭了起来。嘴里念叨着\"妈妈。我一定要帮你报仇!\"滑头鬼又来找你了,你把这件事告诉了他。并且说到你一定要为自己的妈妈报仇。滑头鬼看着你，一本正经的问到,\"杀了他你头上的乌云能消散吗?你含泪点了点头，她继续问到\"那你会开心点吗\",你哭着说\"会\"。他看着你坚定的说到:\"那我就帮你。一起杀了大天狗!\"\n可是你怎么才能杀了他呢，毕竟你平日连门都不出，突然出现他一定有所防备，于是你想到了旅馆里大家经常会一起打妖怪牌，而大天狗从来不参与，那么打起牌一定会是新手。滑头鬼又告诉过你。不久后稻荷神大人会来到狐狸旅馆，选择一位新的神使服侍他，大家都聚在一起，到时一定会很好下手。\n当你说完后滑头鬼看着你，认真的说到:\"这，你也不会打啊，这样吧，你跟我学，我打妖怪牌从来没输过!\"于是你捏了一个小雪人。放在了滑头鬼的衣袖里。跟着他学打妖怪牌,果然他从来没有输过，但是小雪人会化啊。每次只能学两局，两局后。滑头鬼就会拍着桌子说，\"不打了不打了，你们这群菜鸡。回去好好练练再来和我打。\"\n你在房间里认真的研究着妖怪牌，《妖怪牌》的牌中都封着一些可爱的小妖怪的分身影子。每张牌都有不同的属性。如果这牌和你自身的属性相同你还可以与牌建立联系。驱动同属性的牌，甚至释放一点小小的符咒来恶搞下大家。通过妖怪牌你也了解到这些妖怪牌可是大有内涵的，虽然只有五种妖怪属性，但是这些牌可都是有真实灵力的，互相还可以制衡相生相克。妖怪都可以驱动跟自己属性相同的牌，比如雪女是水系妖怪，你就可以驱动水系的河童牌。最近小暖来找你你也会说自己不舒服，不想见人搪塞她。虽然你也想念她。但毕竟时间不多了，你要快点解决这件事了。\n晚上滑头鬼来告诉你。明天就是稻荷神大人来的日子，让你做好准备，你默默地说，我早就...准备好了。\n",
      "Script": "【清晨的阳光】\n今天一大早你就醒了。也不知是为即将发生的事兴奋还是紧张。你在窗前双手合十在心里默念着︰'妈妈。我马上就可以帮您报仇了。\"祈祷后你又制作了很多小雪人和小雪花，只是为了确保自己的法力万无一失。成功后你又紧张的复习了一遍妖怪牌的规则。看着时间差不多了，你就穿好衣服去了大厅。\n来到大厅后你发现老板娘和那个很烦人的厨子已经坐在那了。大天狗也坐在那，一副正人君子的样子让你看着想笑。你又想起你和滑头鬼大人两面夹击的计划。走过去坐在了大天狗的旁边。他疑惑的看了你一眼，似乎想对你说什么，但你并不想理睬他，冷冷的别过头去。过了一会滑头鬼大人也走了过来，他跟每个人都打了招呼。看了你一眼后他坐在了大天狗的另一边。没人讲话，整个大厅安静的可怕\n桌子上放着一套妖怪牌，已经分好了几摞，可是并没有人想开始。随着一阵奔跑声。你看到红色的小暖拖着人偶娃娃跑了过来。你已经好几天没有见过小暖了。看到她的瞬间你多想跟她打招呼，摸摸她的小脑袋。可是你一想到今天会发生的事，又不想把她拖进来，于是生生的忍住了。接着他们两人便分别入座，一时无言。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "【复仇！还是原谅】\n你也不知道为什么，这和你的计划完全不同,你想杀的大天狗没死，绝对不能死的稻荷神大人却死在了你面前!还是在你给他递完牌之后!\n你原本想要和滑头鬼两面夹击大天狗,所以你在那张河童牌里下了一个水属性的弑妖咒,那是一种名为冰针咒的咒语。只要妖摸到这样牌里面的咒语就会发动。冰针就会悄无声息的没入他的皮肤，通过血液到达心脏。然后将心脏急速冰冻使对方心脏骤停死亡。\n但你很清楚,这个咒语只会对妖造成伤害，是不会伤害到神的。可你不知道为什么会这样。你在稻荷神突然返回加入牌局还坐在你旁边后你就悄悄地在他的肩膀上贴了一个小雪花用来偷看神明大人的手牌。你很清楚神明大人手中没有河童牌。他拿到后一定会传给下一家,也就是大天狗。你还假装不清楚规则，故意询问旁边的人偶娃娃妖怪牌的规则。可是不知为何却出现了意外。\n现在你的嫌疑是最大的，你是最后一个给神明大人传牌的人，并且你确实对那张河童牌动了手脚。你不知道是不是你的咒出了问题，或者是滑头鬼那边出了问题。但在确定稻荷神的死到底和自己或与滑头鬼有关之前，【一定要隐藏好自己的行动。】最好能隐藏自己打出的那张牌是河童牌,毕竟河童牌是水系。会更令人怀疑。\n这个旅馆是否会被毁灭其实你并不是很关心。但是你看到小暖心碎的表情，你也感受到同样的心痛。如果可以。也尽量帮助小暖吧。\n最后还是没能成功的帮母亲报仇。到了这一步。你忽然有点想知道这件事背后的秘密。反正最后如果能把凶手的帽子扣到大天狗的头上，这两个神使一定不会放过他。所以在这个过程中要是能听到这大天狗最后的忏悔,倒也是件趣事。\n",
      "Ability": ""
    }
  },
  "第二幕": {
    "黑泽瞳（大天狗）": {
      "Story": "日记：10月16日 天气晴\n今天我收到了一份不一样的礼物，一个日记本。这是爸爸送给我的，他希望我能记录一些我的生活作息，爱好，心情以及发生的一些事情。\n我会按着父亲的吩咐做好记录的。\n10月17日天气阴\n今天我要在日记本中写第一个故事,我的家。我的妈妈,她非常温柔也非常火爆，因为在我犯错的时候，她就会有火爆的一面，当然不止对我，对哥哥、爸爸也是一样的、而她的温柔是在大部分的时间里，犯错责骂我之后会再安慰我在我不小心，受伤的时候她会急忙过来安慰我，在我睡不着的时候就会来哄我，我也不知道什么时候我就睡着了\n总之，她无处不在，感觉时时刻刻都在我的身边，下一个就是爸爸，他很忙，很少在家，因为他是警察，帮助其他人，所以这让我非常向往，因为我也想要成为警察，成为一个乐于助人的人。\n我非常自豪我的爸爸,经常在同学面前炫耀他，也在炫耀我自己,因为我说,我以后也会成为一个警察!\n最后一个就是我的哥哥，他也是不怎么回家，因为他在外面上学,我发现哥哥好像也在向往着爸爸，他的房间会有一些关于警察或者锻炼的用具，我其实很开心我们有着同样的目标，可是自从他出去上学之后，他没有像从前一样跟我玩警察小游戏，也没也没再带我去跑步锻炼\n1月24号天气阴\n爸爸居然来学校找我了,可能已经知道我在学校疯狂训练的事情，他居然说出了让他来解决我大学的问题。靠他的关系让我进入我想要的大学。\n他...是不相信我吗?为什么要做这些事，我可以的啊!我又没有残废、为什么要靠关系、我一定要用我自己的能力证明给他看，我一定会想出办法来解决这一切。\n3月3号天气睛\n今天发生了一件大事,哥哥真的考进了警察大学我们全家都非常开心的为哥哥庆祝，哥哥他离爸爸越来越近了。\n我也是!因为我初中马上也要毕业了，我也在努力的离爸爸更近一点。\n3月7日天气阴\n看来、心理学好像真的不错，虽然我不能用身体行动去保护京都。\n但是我可以靠脑子，当不了警察，我可以当侦探，一样可以侦查罪犯,这样我只是换了一种方法伸张正义，守护京都，没错!\n就是这样!加油!我一定可以的!\n4月6号天气雨\n已经这样持续很久了、全是找小猫小狗，或者是调查婚外情，光靠这些我要怎么保护京都?\n难道是我自己真的能力不够吗?\n我已经在体能上是不行了，难道连头脑也不够格吗?\n5月20号天气阴\n认识了阳光便利店的收银女孩，她叫凉宫桃子。\n开始还以为长得挺矮，后来才知道，她坐在轮椅上，听她说好像是车祸造成的，而且我看她就和便利店名字一样，很阳光。\n她偶尔也会给我讲讲她自己的故事，所以每天都来便利店,就已经习惯了。不过现在想想，桃子这样都还在努力，而我现在这个样子...呵。\n5月2号天气阴\n看来,我真的是一个废物，每天靠这些来度日,赚得也不多，我还有脸面告诉家里的人吗..\n每天....只能在凌晨去便利店,买一个红豆面包,再来两瓶啤酒来渡过每天时间。\n唉，我就只能这样了吧。\n5月6号天气晴\n我真的是一个废物吗?没有别的办法了吗?\n我的腿，我的身体，为什么这么弱，我只能靠文化课了吗?但是这样我就考不进警察大学了，但是我也不想要爸爸的帮助，我不想让任何人看不起我。\n我需要做出一个决定，我不能放弃它，不能脱离它怎么办呢?我需要做出一个重要谨慎的决定.....\n我决定了,为了实现它，我考入了一个普通大学选择了心理学专业，我做出这一切就是我不想脱离不想放弃。\n8月12号天气小雨\n桃子给我讲了好多她的经历,原来她以前在孤儿院，被收养之后过得也不是很开心。\n后来很幸运的找到了亲生母亲，一起回到了老家，她很喜欢那个地方，有很多小动物，里面最喜欢的就是鲸鱼。\n但是有一天她发现有人捕杀鲸鱼，她们要保护那个地方，所以就前往京都去抗议。可没想到，她们出了车祸，母亲为了保护她而昏迷不醒，她的腿也是因为这场车祸，并且她也没有为母亲找回公道，所以她很恨那群人。她现在的样子处境，都是被那群人害的,她要保护的都没了，然而，我可以!\n我可以保护她，我可以替她伸张正义，我现在不是有能力做吗?桃子在这一刻等的就是我!\n后来我调查到了,这个人居然会跟我父亲一起，就连哥哥也认识，我要怎么做?明明我快要做到了，结果就让这些挡在我的面前。\n他什么都有，金钱，权利，地位,就我和桃子根本对他造成不了什么，正义、法律对他都没有用，我该怎么做才能保护桃子，替她讨回公道\n8月16号天气雨\n杀了他!我要用我自己的正义去保护桃子。这么久了,我调查的非常清楚。\n他最近出现在稻荷神社附近，但这件事桃子也想一起。\n这些行动非常危险，而且她行动不便，可她一直坚持要去，说是要向神明大人许愿，让母亲能早点醒来。\n看着她坚毅的眼神，我只好答应她\n明天我们就出发。我一定要为桃子伸张正义，不让她失望、保护好她!不会让她再去经历那些风雨，她只需要幸福快乐就好，剩下的由我来做!桃子，我一定会保护好你!\n如果神明大人真的存在的话,请让我的女孩,变得健康起来变得快乐一些吧。\n9月6号天气阴\n为什么??为什么我一直锻炼都不行，是不够吗?是我训练的太少了吗?一定是的!\n哥哥和爸爸都那么好，一定是我训练少了，他们都可以，我也一定可以的!加油训练!\n9月7日天气雨为什么会生病?为什么我不行?\n为什么偏偏是哮喘?!没有任何办法吗?\n我的文化课一直都很好，只要我努力，再努力一点或许会有办法的!\n12月4号天气小雨\n现在的我也进入高中生活了,我要一直努力学习,要一直坚持文化课名列前茅.....只是，我发现我的体能方面好像不如人意，这让我有一点沮丧，所以我只能更努力，在体能方面一直训练,这样才能让我离哥哥和爸爸更近一点。\n11月27号 天气睛\n我毕业了，也如愿以偿开了一家属于自己的侦探事务所。这一次，相当于就是重新开始了，我要时刻保持头脑在线，靠自己做侦查，我也能破大案!也能用这种方式去保护京都了!\n也不知道接下来会遇到什么样的案件，想想就好激动!\n恩...….开始两天，都是一些小事情，可能是刚开始吧大家还不知道有这么个侦探事务所，只要我继读努力，破一个大案，我的名声就会传出去啦!\n加油，加油，不要松懈!\n",
      "Script": "看完日记的你们愣了很久的神，接着缓缓地合上了日记本。此时你们眼睛一晃，再次定神时你们发现眼前依然是你们熟悉的旅馆，但却有些许不同。\n没有了迷你尺寸的家具，没有了挚爱的鬼丸，没有被冰封的房间，没有一整面墙的案件笔记，没有了菜刀和料理大全，也没有了熟悉的妖怪牌。每个房间都差不多，有点破旧，有点普通。你们轻轻的走出房门，来到了平时打牌的大厅。此时临近夜晚。\n(风郎第一个到达了打牌的大厅)\n风一郎:好奇怪啊，总感觉哪里不对劲儿，但又说不上来。大家都去哪了?(此时一个身穿紧身连衣裙，带着些许风尘气的女子走了过来)\n阿玉:一郎!不对，你是我的郎吧...你的耳朵和尾巴...哪去了?(风一郎走过去，轻轻的抚过阿玉的眼角，略带悲伤)\n风一郎:阿玉...你的尾巴和耳朵也...而且你，怎么突然间苍老了些许?(两人相互望着彼此，接着一个穿着高中校服的小太妹走了出来)雪姬:你们是...老板娘?厨师哥哥?你们怎么变得...不样了?\n(说着雪女抬头看了看自己的头顶，又想用力量制作小雪花，却发现什么都没了，乌云和力量都没了)\n阿玉、风一郎:你是...雪姬吗?\n(雪姬不知自己该点头还是摇头，身后走来了一个西装墨镜的中年男人，一脸严肃)\n滑头鬼:雪姬?你是雪姬吗?你这头发颜色怎么是黄色的?你这裙子是不是太短了?\n雪姬:你是滑头鬼大人?!噗哈哈哈哈哈哈,你的头这么短还真让我不习惯呢。\n(阿玉和风郎被雪姬这句话逗得都笑了起来，滑头鬼大人看着眼前的雪姬开朗的样子，嘴角不自觉的也挂了笑，宠溺的摸摸她的头)\n此时的大厅虽然充斥着陌生的变化,但却还是像曾经的旅馆那样充满了欢笑和温暖，四人正在笑着打趣着对方，却看到一个坐在轮椅上的女孩，眼含悲伤，他身后站着的是一个穿着风衣带着格子帽的男人。男人缓缓的推着女孩来到大厅，欢笑戛然而止，整个大厅都陷入了沉默。\n(阿玉突然明白了什么，捂住脸蹲下啜泣起来)阿玉:优子?小优子!你的...你的腿..\n风一郎:小子，你是天狗吧?这到底是怎么回事?我们怎么都成了这样?(风一郎说完后过去安抚悲伤的阿玉，滑头鬼大人走上前不可置信的看着优子)\n滑头鬼:你是...优子?你，多少岁了?我为什么对你如此...熟悉?你的腿又是怎么回事?\n(优子低着头不说话，身后的你走过去帮她整了整盖在腿上的毯子)\n大天狗:你们先别问了...优子...优子她自己也很难受啊。我现在，连个能带她飞的翅膀都没了，我真的成了个废物。\n此时的大厅已经没有了欢乐。有的只是压抑和悲伤。小暖:大家...想吃饼干吗?\n所有人都抬起了头,看着出现在自己面前的小暖，一身红色的巫女服和红色的头发，还是像个小太阳一样温暖。\n大天狗:小暖，是你叫我们来这里的吧?这到底是怎么回事?\n(小暖挠了挠头，正想开口说些什么，从另一边走廊出现了一个穿着一身名牌的胖子，走近一看，他头发花白，脸上布满皱纹)\n大天狗:是你!(你认出了他，那个伤害了桃子的人，那个和你的父兄有着密切关系的人)\n(男人看着你们，眼神阴狠，面带疑惑)\nNPC:你们?你们怎么会在这?而且怎么...怎么可能呢?不可能啊?\n(男人正在思考些什么，阿玉突然冲到这个男人面前举起手想要打这个陌生的男人，却被男人身形一闪，接着反手一掌，只听啪的声，阿玉白皙的脸上就出现了五个红指印。接着男人转身抬起脚将阿玉踹倒，并连踢两脚)\n风一郎:你给我住手!!!(风一郎喊着，冲过去一拳打在了男人的脸上。)(男人阴狠的转身回给风郎一拳，两人扭打了起来。优子着急的想冲上去帮忙，却重重的从轮椅上摔了下来。你赶紧抱起优子让她坐回轮椅)\n雪姬:你们!你们住手啊!\n(滑头鬼看了眼小脸都皱在一起的雪姬，冲了上去拉开了两人，男人瞪了一眼你们，转身回了房间)\n小暖:大家...那个...现在也挺晚了，不然先回房间休息一晚..明天起来,起来咱们再说?\n(经过刚才的那场闹剧，大家也都累了，风一郎扶起阿玉回了房间，你也推着优子走了。雪姬看了眼滑头鬼，两人也前后脚的离开了大厅，只剩下小暖呆呆的一个人看着大厅中时打牌的桌子发呆)\n你将优子推回她的房间，轻轻抱起她，将她放在床上盖好了被子。你看着眼前的女孩，还是记忆里熟悉的那个勇敢坚强的凉宫桃子。在旅馆的日子仿佛梦一般，但那些回忆却占据了你的脑海。她轻轻的拉住了你的衣角，轻声说:“阿泽...你是不是要去找他?你知道法律无法制裁他，你要去坚持你自己的正义是不是?”\n你沉默了,这本就是你来这里的目的。你知道那个男人的势力大到你无法想象，他与你的家庭你的父兄关系甚密，他们所构成的这棵参天大树不是凭你的力量能够撼动的。你所能依赖的法律无法制裁他，在这种人面前，根本不存在所谓的正义。你明白你若是想替面前的女孩讨公道，唯有坚持你自己的正义，用你的方式去制裁他。你不敢看桃子的眼睛，轻轻地点头道:“桃子，你不要担心我，你乖乖的在房间里，睡一觉，等你醒来的时候我就回来了。”她使劲拉了拉你的手，认真道:“不要做傻事，我现在能依靠的只有你了。答应我，你一定要好好地回来，好吗?”你点头，帮她掖了掖被角就出了门。\n你穿过走廊来到拐角尽头的房间门口，思考了许久还是敲了敲门。听到‘进来’后，你开门进去，那个男人正坐在椅子上，看到你疑惑地问:“你是..?看你有些眼熟啊。”你冷冷的回到:“我是黑泽瞳，一个私家侦探。”男人突然恍然大悟道:“黑泽?你是黑泽家的小儿子吧?我和你父亲黑泽司关系很好呢!也亏你父亲我才有了现在的地位啊。你来找我有什么事?”\n你看着他的眼睛一字一句的说:“是你故意撞了那对母女对不对，根本没有什么刹车失灵，你也根本没有借别人车，你就是司机!你为什么要撞她们!”男人疑惑的思考了一会，不确定的说:“母女..?你说的不会是很早之前那起交通事故?啊呀，当时多亏了你父亲帮我疏通关系，那件事才能那么顺利的解决啊，那对凉宫母女就像臭虫一样，每天举着反对的牌子在我公司门口闹事，让我遭到不小的舆论的压力。我都已经私下找那个老女人说要给她钱了事,谁知道她竟然拒绝我?不就是嫌钱少吗。这种贪心不足的吸血虫，我碾死也是对社会的贡献啊!”\n你听到这里再也忍受不了,冲上去一拳打在了他的脸上。他显然没料到你会这样，往后退了两步吐了口血恶狠狠的说:“小子，你别仗着你老子就在这嚣张,你以为我是谁?我看刚才那样子，你是不是喜欢那小臭虫?我告诉你，她能活下来就是她命大!不知道你老子要是知道你现在的所作所为会不会气死?\n回头我去告诉你老子,让你老子替我解决这个小婊子,也算是收你小子打我这一拳的利息了!”“操你大爷!你给我闭嘴!我的事与我父亲无关,你给我去死吧!”你喊着冲上去想继续攻击他,他却早有防备,挡下了你的全力一击还回给你一拳。你俩就这样扭打在一起，但你却并没占到什么便宜。\n你逐渐感觉到了力不从心，胸口处闷得厉害，喉咙像是被什么堵住了，你就快要呼吸不了了。你知道，是那该死的哮喘犯了。你退到房间的一角大口的喘着气，男人似乎看出了你的窘境，并没有接着进攻，反而似笑非笑的坐回椅子上看着你说:“小子，怪不得你父亲说你是你们家的耻辱呢，呵呵。我跟你老子好歹这么多年的交情了，我也不至于要你的命，你赶紧滚吧。”\n你多想冲上去要了他的命，可是身体根本不允许，你摸了摸兜，发现哮喘药没带。你现在什么都不顾了，必须拿到药才行!你转身跑回你的房间，从包里翻出喷雾对着嘴连按三次。你深深的吸了一口气,那种致命的室息感终于有所缓解。你拿着药颓然的坐在了地上，嘲笑着自己，刚才落荒而逃的样子，真是要命的废物啊!!!这样的自己，还能做什么呢...\n就在你绝望又无助的时候，你听到隔壁房间传来了啜泣声。是桃子!她怎么哭了?她不是应该好好睡觉吗?你赶紧起身走到她房间开门进去，却看到桃子倒在地上，眼圈通红。你飞快的一把抱起她放在了床上。边整理被子边说:“傻瓜,怎么哭了呢?是不是让你担心了。我这不是回来了。”她拽住你的衣角说:“阿泽，能不能留在这，陪陪我。”你轻轻点了点头，坐在了床旁，摸了摸她的头。是啊，你还有桃子要保护。桃子除了你，还能依靠谁呢?哪怕是这样的自己...你握着她的手，轻轻说:“你安心睡吧，桃子，有我在，你别怕。”你看着她渐渐进入梦乡，你也疲惫的靠在床边，沉沉睡去。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "找出真相",
      "Ability": ""
    },
    "桐生一郎（滑头鬼）": {
      "Story": "日记：1月15日\n大哥，现在的町内，我们都做的很好了但是我自己陷入了些迷茫。\n感觉不知道该做些什么了，我听说在京都有个组织，不论出身，只看能力。在这个组织的，都是大人物，也许我该走出去看看了，我会成为大人物的，到时候我会再回来看你的，大哥!\n2月11日\n大哥，我累了，我不想继续干了。\n首领前两天病重，叫我到他床前,我想了很多，我以为我终于要成为人上人了。\n没想到首领跟我说了很多夸奖的话，勉励的话。\n但最后他说的居然是“我儿子就拜托你辅佐了”我为首领打拼了二十多年，每次都是身先士卒。为什么不让我当老大?\n那个二世祖有什么能力?有什么资格带领山口组?山口组哪里还有未来可言?唉，就这样吧。我不会背叛首领的信任,但我也不想再给别人卖命了。也该是时候去找我的玲子和我的小樱桃了。好几年过去了，不知她们现在怎么样了?\n我好想他们....\n3月3日\n最近都跟大哥到街上找肥羊，大哥夸我学得快，说最拼命的就是我，未来有前途，等他当老大了，就让我当他的头号打手。\n为了大哥，我一定会努力的!\n3月21日\n大哥，我为你报仇了!\n今天我们终于干掉了其他组织，现在整个町都是我们的了。以后再也没人敢瞧不起我们贫民窟出来的了。\n可是没了大哥，我不知道该做什么了。\n4月29日\n大哥，我到京都了\n这里人真多啊，穿的跟我们也不一样，我才知道我加入的组织叫山口组。跟了一个组长，他跟你很像，也会夸我很拼命，说我能成大事。\n虽然我现在只是一个小弟，我一定会成为大哥说的人上人的!!\n5月4日\n现在的年轻人都是废物!\n遇到事情也不敢冲上去!都在说什么要用文明的方法处理，一个个穿的西装笔挺，文绝当的，真没意思。\n要是我带着十年前的老部下们，就冲上去干他娘的，这么不利索，哪有我们山口组的风范?\n首领居然也不支持我，他说什么新时代我们也不能老是打打杀杀的，要适应新的规则，难道我已经跟不上时代了吗?\n大哥，你是能理解我的吧?\n5月5日\n玲子，我对不起你!\n我不该这些年不闻不问，只知道寄钱去老家。为什么我去老家的时候什么都没了?\n原来当年你们走的时候就被那个跳河的年轻人追杀...是我拖累了你们啊...我打听了好久好久，可为什么所有打听到的消息都是告诉我你已经死了?而小樱桃\n也不见了?她还那么小….她能去哪啊…我的错，都是我的错!\n什么大人物，什么人上人!!没了你和小樱桃，我有什么意义?玲子，我发誓我会找到那个该死的家伙，为你报仇。\n我也会找到小樱桃，好好照顾她，以求弥补我这些年的过错,玲子，求你原谅我。\n7月15日\n玲子，我终于找到了那个畜生!\n好的!当年就该杀了他!他现在改头换面开了一家什么科研公司,还成了社长!自己逍遥法外，到处快活，我的妻子呢!\n我的女儿呢!\n我听说他五日之后会去稻荷神社。\n我会找准时机杀了他，为你报仇!\n玲子你等着我，报仇以后,我会找到小樱桃，等她有了安稳的生活后，我会去陪你的。\n8月11日\n大哥，我有了一个女儿，我叫她小樱桃。\n她红扑扑的小脸跟她妈妈特别像，像个小樱桃。\n我跟玲子都很开心，希望小樱桃能幸福、快乐的长大。\n但玲子一直很担心我，她希望我能找个更安稳的工作,唉,女人总是怕这怕那的。\n首领刚给我安排了一个新任务，虽然很危险，但作为山口组的二首领，我必须完成任务，不辱使命!\n9月7日\n大哥，今天首领跟我说，我三十岁也该负责更重要的了,让我当上了组织的二把手!\n手下的兄弟们也很开心，首领说三十而立。\n我也不太懂，但是之前的安保工作做了三年，我也觉得是很烦了。而且这个青年人，居然抛下了工厂跑了!听说是政府不让做了。\n我去追债的，那个青年人居然自己跳河。\n倒是个有魄力的人呢,既然如此就算了吧，首领也说让我们不用管了,让我管其他事小弟们为了我庆生，带我去歌舞伎厅耍一耍~\n9月7日\n今天我10岁，大哥终于带我去干活啦!\n大哥说今天运气不好，只有一个穷鬼身上没什么值钱的,这个笔记本给我让我回去跟阿姨学认字。\n阿姨说，让我写日记，这样可以记下来重要的事。\n认字了才能成为大人物，大哥是这么说的!我桐生一郎一定会成为大人物的!\n9月23日\n大哥，我喜欢上了一个女孩!\n在歌舞氮町认识了玲子，她是个好女孩，又美丽又可爱。我每天都去找她，看看她红扑扑的脸蛋。\n我都想亲一口，我决定了，今天就跟她说，让她跟着我。不能让她待在歌舞伎町，我要把她娶回去!\n10月10日\n大哥，今天首领给我安排了一个奇怪的任务。\n一个青年人请求我们去保护他们的什么食品加工厂，说有人闹事，一群不知所谓的工人，在门口举着牌子说抗议，什么保护。我轻轻松松的就把他们都赶走人。\n但这个年轻人还要我们每天来看一下帮他做安保，要不是给的多，这种偏远的小镇上的这种破工作我才不干呢。\n11月3日\n大哥，玲子和樱桃回老家了，上次任务出了事，我在医院里躺了两个多月，玲子一直照顾着我。\n没想到出院这天，回到家发现空无一人，只有玲子留下的一封信。\n跟我说，她担心我更担心樱桃，在京都的话，可能会成为我的拖累，所以她带着孩子，回老家了。\n唉，我该怎么办?我好想玲子和樱桃!\n但首领对我恩重如山，下面还有那么多相信我的弟兄,我不能擅自离开，大哥，要是你，你会怎么做呢?\n11月11日\n大哥当老大了!我也终于成了头号打手!\n最近跟其他组织打的很厉害，抢生意也不容易呀!好几个小弟都没了，我都没脸见阿姨了，难过啊..\n12月23日\n大哥，京都的人都很厉害呢,最近几次打架都受了伤,以前可没人能伤到我。我们组长在老大死后成了新一任首领我也成了组长。\n首领很器重我,给我安排了很多新工作,带着小弟们出去，别人都毕恭毕敬的，这感觉真好。\n",
      "Script": "看完日记的你们撇了很久的神,接着缓缓地合上了日记本。此时你们眼睛一晃，再次定神时你们发现眼前依然是你们熟悉的旅馆，但却有些许不同。\n没有了迷你尺寸的家具，没有了挚爱的鬼丸，没有被冰封的房间，没有一整面墙的案件笔记，没有了菜刀和料理大全，也没有了熟悉的妖怪牌。每个房间都差不多，有点破旧，有点普通。你们轻轻的走出房门，来到了平时打牌的大厅。此时临近夜晚。\n风一郎第一个到达了打牌的大厅。\n风一郎:好奇怪啊，总感觉哪里不对劲儿，但又说不上来。大家都去哪了?此时一个身穿紧身连衣裙，带着些许风尘气的女子走了过来。\n阿玉:一郎!不对，你是我的一郎吧.....你的耳朵和尾巴...哪去了?风一郎走过去，轻轻的抚过阿玉的眼角，略带悲伤。\n风一郎:阿玉.你的尾巴和耳朵也...而且你，怎么突然间苍老了些许?两人相互望着彼此，接着一个穿着高中校服的小太妹走了出来\n雪姬:你们是.…老板娘?厨师哥哥?你们怎么变得..不一样了?\n说着雪女抬头看了看自己的头顶,又想用力量制作小雪花，却发现什么都没了，乌云和力量都没了。\n阿玉、风一郎:你是...雪姬吗?\n雪姬不知自己该点头还是摇头，身后走来了一个西装墨镜的中年男人，一脸严肃。\n滑头鬼:雪姬?你是雪姬吗?你这头发颜色怎么是黄色的?你这裙子是不是太短了?\n雪姬:你是滑头鬼大人?!噗哈哈哈哈哈哈,你的头这么短还真让我不习惯呢。\n阿玉和风郎被雪姬这句话逗得都笑了起来,滑头鬼大人看着眼前的雪姬开朗的样子，嘴角不自觉的也挂了笑，宠溺的摸摸她的头\n此时的大厅虽然充斥着陌生的变化,但却还是像曾经的旅馆那样充满了欢笑和温暖，四人正在笑着打趣着对方，却看到一个坐在轮椅上的女孩，眼含悲伤，他身后站着的是一个穿着风衣带着格子帽的男人。男人缓缓的推着女孩来到大厅，欢笑戛然而止，整个大厅都陷入了沉默。\n阿玉:优子?小优子!你的...你的腿..\n(阿玉突然明白了什么，捂往脸蹲下啜泣起来)\n风一郎:小子，你是天狗吧?这到底是怎么回事?我们怎么都成了这样?(风一郎说完后过去安抚悲伤的阿玉，滑头鬼大人走上前不可置信的看着优子)\n滑头鬼:你是...优子?你,多少岁了?我为什么对你如此...熟悉?你的腿又是怎么回事?\n(优子低着头不说话，身后的大天狗走过去帮她整了整盖在腿上的毯子)大天狗:你们先别问了...优子...优子她自己也很难受啊。我现在，连个能带她飞的翅膀都没了，我真的成了个废物。\n此时的大厅已经没有了欢乐。有的只是压抑和悲伤。小暖:大家...想吃饼干吗?\n所有人都抬起了头,看着出现在自己面前的小暖，一身红色的巫女服和红色的头发，还是像个小太阳一样暖。\n滑头鬼:小暖，是你叫我们来这里的吧?这到底是怎么回事?\n小暖挠了挠头，正想开口说些什么，从另一边走廊出现了一个穿着一身名牌的胖子，走近一看，他头发花白，脸上布满皱纹。\n滑头鬼:是你?!(是那个男人吧...那个当年跳河后追杀玲子的该死的混蛋!可是他怎么苍老了这么多?一定是报应吧。)\n(男人看着你们，眼神阴狠，面带疑惑。)\nNPC:你们?你们怎么会在这?而且怎么...怎么可能呢?不可能啊?\n男人正在思考些什么,阿玉突然冲到这个男人面前举起手想要打这个陌生的男人，却被男人身形一闪，接着反手一掌，只听啪的一声，阿玉白皙的脸上就出现了五个红指印。接着男人转身抬起脚将阿玉踹倒，并连踢两脚\n风一郎:你给我住手!!!(风一郎喊着，冲过去一拳打在了男人的脸上。)(男人阴狠的转身回给风一郎一拳，两人扭打了起来。优子着急的想冲上去帮忙，却重重的从轮椅上摔了下来。大天狗赶紧抱起优子让她坐回轮椅。)\n雪姬:你们!你们住手啊!\n(你看了眼小脸都皱在一起的雪姬，冲了上去拉开了两人，男人瞪了一眼你们，转身回了房间)\n小暖:大家...那个...现在也挺晚了..不然先回房间休息一晚...明天起来,起来咱们再说?\n(经过刚才的那场闹剧，大家也都累了，风郎扶起阿玉回了房间，大天狗也推着优子走了。雪姬看了一眼滑头鬼，两人也前后脚的离开了大厅，只剩下小暖呆呆的一个人看着大厅中平时打牌的桌子发呆。)\n你目送雪女回到走廊上的房间后也回到了自己的房间。你坐在床上思考着刚才发生的一切。那个坐轮椅的女孩和玲子长得怎么会那么像，难道是玲子家的什么亲人?她会不会知道玲子和小樱桃到底发生了什么?等下一定要去找她问问看...雪姬的头发怎么是那种鬼颜色，校服也不好好穿，裙子那么短...刚才她好像很难过，似乎她的头上又有了乌云似的...就像刚遇到她时那个样子。不然一会去她房间吧，看看她到底怎么回事。对了!还有那个该死的男人，他为什么会出现在这里?都是他害死了玲子，害的小樱桃也不见了...\n你越想越恨，起身出了房间。你准备先去那个男人的房间，但是当你经过雪女房间时，你隐约听到房间里传来了一丝啜泣的声音。你犹豫后还是叹了口气敲了雪姬的门。过了半晌门被轻轻的打开了，门后的雪姬眼眶红红的，似乎刚刚哭过。你有点揪心，问道:“你怎么哭了?”她突然间就崩溃了，无法控制的大哭起来。你看着她手足无措，毕竟你从来没有哄过女孩子。想了半天，只能从兜里拿出手帕递给她说:“别哭了别哭了，有什么委屈说出来就好了。”她拿过这个手帕却没有擦眼泪，反而梏榔一声笑了出来:“什么年代了还随身带着手帕，大叔你真的很过时哦。”\n你看着她稳定了心情,就拉着她坐在床边让她说说发生了什么。她犹豫了下，说:“我做了一件对不起别人的错事。这件事折磨了我很久很久，从那之后我的人生就只剩下了愧疚。我想向她道歉，想要弥补错误，可是却没有勇气面对她。”\n你摸了摸她的头说:“虽然不知道你经历了什么，但是看你的样子不过就是个中学生吧。做错了事不怕，谁都有做错事的时候。只要能意识到错误，无论对方是否原谅你，都尽自己的全力去弥补，以后的日子都不会那么难过的。你只是有点害怕，小女孩不那么勇敢也没关系。再给自己点时间，好好地跟自己聊一聊。如果现在还没准备好，就好好睡一觉，等明天太阳出来，在鼓起勇气试一试吧!只是以后少哭一点，红眼睛像个兔子，都不好看了。”\n她点点头，把你的手帕递回去说:“这个我不需要了，以后我不会在哭了。”然后乖乖的钻进被子里。\n你看她躺下后轻轻的离开了。\n你想起今天晚上他对阿玉的伤害，他对玲子的伤害，还有雪姬看到他时眼里流出的恐惧.既然一切都是那个男人引起的，为了玲子，为了樱桃，为了阿玉和雪姬。那，一不做二不休，就让他消失吧。\n你做好心理准备去那个男人的房间，却发现他躺在了地上，不知死活。你上前探了探他的鼻息，发现他只是晕倒了。你从口袋拿出了手帕直接捂住了他的口鼻，他只是稍稍挣扎了一下，就断了气。你把手帕整理好放回兜里，静静的回到了自己的房间，等待明天。\n你是杀害死者的凶手，请一定隐瞒!!!\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "找出真相",
      "Ability": ""
    },
    "苍井惠（九尾狐）": {
      "Story": "日记：5.9晴\n我的小小白已经满月了。看着她像小天使一般的面庞,我的内心剩下的只有欣慰。那些难过的事情我多希望能彻底忘记，可那些背叛和欺骗却永远的留在了我心底。\n他消失四个月了。自从我怀孕后他回家的次数就越来越少。总是说忙,我理解他，公司新成立，他作为社长忙，\n多正常啊。可就在我临盆前两个月，他消失了,电话再也无法接通。直到这时我才发现，我对他一点也不了解啊!他的家庭，亲人，朋友，他的公司地址...我对他一无所知，我想找到他却毫无头绪。\n我找遍了所有的地方，却一无所获。\n我还记得那个雨夜，我绝望的再马路上被淋了个湿透腹中传来剧痛，我瘫倒在地。\n要不是遇到好心人，可能我和小小白都活不下来吧。\n我要坚强起来,我一个人也能照顾好她,我要她再也不要和我一样受尽苦难，我要她快乐的长大!!!\n付出再多，再多苦我也不怕\n5.12日.晴\n爸爸今天又喝醉酒了,回家就开始打妈妈，嘴里还不停的辱骂着:你这个没用的女人，生个儿子都生不出来,生了这一堆的赔钱货，我们苍田家血脉都断在你手上了!明天我就去外面找个女人给我生个儿子去!\n妈妈蜷缩的身体，和姐妹们震耳欲聋的哭喊声，我的心像撕碎般疼痛!为什么我要出生在这样的家庭?却什么?\n上面的姐姐，下 面的妹妹，还有妈妈。\n一大家都一样，痛苦，压押，绝望\n5月20日小雨\n今天父亲阴沉着脸回到家中，我们姐妹几个知道父亲这样，一定是今天又输钱了。\n中饭时,我讨好般的想帮父亲倒一杯酒，可是一不小心酒壶摔碎在了地上，父亲暴跳如雷的拳头又如狂风暴雨般的打在了我的身上\n他边打边骂着:你这个没用的家伙，生你有什么用?就是因为你这个赔钱货，害我天天输钱，晦气!这点事都做不好还不如去死算了!\n身体的疼痛已经让我感觉到了天堂的感觉,母亲疯了般的冲过来把我拉出了家门!走，走的越远越好，这是我在雨中唯一听见母\n亲对我说的最后一句话!\n去哪里都好，只要能逃离这里去哪里都可以...\n5.22.晴\n今天他久违的露出了笑容，回家时买了一束玫瑰，还给我买了一条新的连衣裙。\n他抱着我高兴地转圈圈，说他要东山再起了，机会来了。他说他认识了一个很重要的人，只要能搞定那个人，拿到许可证，他就可以再卷土重来!\n之后他捧着我的脸认真的对我说，他需要我的帮忙，让我陪他应酬一下\n我毫不犹豫的答应了，我希望看见他开心!只要他能东山再起，我们一定能幸福下去!\n5.22.小雨\n几经竿转,我竟然来到了京都，京都的一切都让我眼花缭乱。大都市和我家那个小山村太不一样了。人们穿着光鲜靓丽的衣服(总有一天我也可以)马路上车水马龙。\n这么大的城市，一定会有我立足的地方!\n终干离开了那个可怕的家，我要开始新的生活，我要让自己强大起来，我再也不是以前那个懦弱的我!!!\n5.25.小雨恶心死了!!!\n我没想到陪他应酬，竟然需要做这样的事!!\n穿着紧身暴露的裙子,画着他买的鲜艳的口红。陪那些大腹便便的男人唱歌喝酒每次那些油腻的手在我身上摸来摸去的时候，我真的想推开他们跑的远远的!!!\n但是我砖头看到他，他也在拼命的喝酒，卑躬屈膝的样子，还有他祈求的眼神.…\n是啊，这是为了我们的家，为了我们的未来努力啊。他都那样拼命了，我又怎么能拖他的后腿呢?\n我不能这么做，我要坚持!!!\n6.5晴\n今天他突然冲回家抱着我开心的说:他拿到了，终于拿到了那个许可证了，你不用再去帮我应酬了!\n我真为他高兴啊，他可以施展他的报负了，我们的日子也会越来越好!而且….而且我….\n我害羞的看着他说，我也有好消息告诉你呀，你要当爸爸啦!他为什么...愣了一下?一定是我的错觉吧。\n一定是....\n7.22.晴\n在这偌大的城市中已经挣扎了两个月。没有念过书、没有什么技能的我在这城市里处处碰壁、根本找不到什么好工作。\n如今我才知道，大城市也有大城市的难处。\n那些衣着光鲜的人们似乎都不怎么快乐,找工作时每个老板都愁眉苦脸的说经济不景气啊、养不起闲人。\n我愿意学啊!可是却连机会都不给我...他们说什么我长得漂亮、可以去风俗店工作。\n风俗店是什么?原来长相也可以成为我的优势和能力吗?不如...去试试\n7.30.晴\n我就不该来这种地方!\n里面的女孩子穿着那么暴露的裙子，还画着那么浓艳的口红。\n1.10.晴\n今天是他来店里的第15天了。\n他每天都捧着花等着我下班，那么晚都送我回家。\n他长得虽然没有电视剧里那些男星长得英俊，而且岁数也比我大。但他绅士又温柔我现在每天都很期待下班!下班就可以见到他啦.不知道为什么每次看到他我的心都蔼砰直跳。难道这就是小说里所说的爱情?我....我好想答应他呀!!!!!\n我还是搬进了他的公寓,拉着他去买了新新毛巾,情侣睡衣,还有情侣拖鞋。我把这些东西安置在他的家里。\n看着他对我宠溺的眼神，我第一次有了家的感觉。我终于有了我自己的家，我不再是孤单一个人了，从此以后我和小岛要的\n幸福的活下去!!\n3.9晴\n我拼了命的努力工作赚钱,没日没夜的工作。可是章鱼烧店的工资太微薄了我的小小白那么小，我要怎么养活她..\n我最终走进了夜樱馆，那个我明明最讨厌的地方，做了我最讨厌的工作。只要守住底线就好了，只是陪酒而已....\n小小白越来越可爱了,每天我带着酒气在楼下呕吐完强拖了身体回家时，小宝贝都会肉嘟嘟的跑过来给我拿拖鞋给我倒杯牛奶:妈~妈，喝，宝宝饱了!看着如此乖巧懂事的白白，我什么都值得了…\n还好夜樱馆的老板娘待我不薄，不会逼我做不想做的事,还介绍了靠谱的阿姨在晚上照看小小白。\n我终于把小小白拉扯到了6岁,还赞了一笔钱,这笔钱足够我去盘下一间小门面，我还去买下了当年打工的章鱼烧店的配方。下星期就去选地方吧，以后就守着这间小铺和小小白过日子，也很幸福了\n3.14\n为什么!!!!\n为什么老天爷你要这样对我!!!\n我的小小白她这么小，那么懂事那么可爱!!神明大人你有什么你惩罚我啊!!!都怪我...都怪我在她小的时候带着她颠沛流离的住那些廉价公寓...明明每天在馆里抽烟喝酒还母乳喂养...都怪我没有给她好的营养，没有好好做饭给她吃...都怪我..\n神明大人啊...能不能把病痛转移到我的身上!我的女儿...我的小小白她还小啊...她那么期待去上学，去认识新朋友…\n小小白看着我啪迢的掉眼泪,轻轻的说:妈妈不哭，宝宝不怕打针，宝宝很快就会好起来~\n可是女儿啊...你得的可是急性白血病啊.….妈妈...妈妈害怕失去你啊...神啊，无论让我做什么，只要我的女儿能好起来...我什么都愿意做\n4.16.晴\n亲爱的最近很苦恼，他在京都边一个小镇上的工厂被政府查封了。他第一次发了脾气，摔了家里好多东西，还推开了我。\n他不会跟爸爸一样的，他是那么温柔的人。他一定是太痛苦了。\n他也哭着对我道歉让我原谅他。\n我理解，我都理解。我愿意陪他熬过所有难过的日子。我们以后一定会幸福的。\n5.8雨\n小小白的化疗第二个月了,我把攒的所有钱都放在了医院。可是这些钱对女儿的并来说只是杯水车薪.…\n我去求了老板娘,我上了那些老男人的车和他们去了酒店。我接过他们一沓沓的钱。我活的像个行尸走肉一样。我为什么还活着?我快坚持不下去了\n可是在医院看着以前可爱的小小白现在已经变得不成人形了，头发都掉光了，我简直都快要撑不下去了。\n可是小小白拉着我的手说:妈妈,我不想死,如果我死了，妈妈就一个人了，没有人保护妈妈了~!!!\n我不敢当着她的面哭，我怕她担心。\n医生还是下了病危通知，化疗不理想。只能等着造血干细胞移植，可现在愿意捐助的人太少了，有的有都不合适....我的也不行.…\n骨髓...对了!那个男人!小小白的父亲.\n我一定要找到那个负心汉，只有他才能救我的白白我一定要找到你!!!\n这就算了，那些客人，一个个的色眯眯不怀好意，毛手毛脚。恶心死了!!!!我就算饿死都不会做这种工作的!\n哪怕去洗盘子，去做清洁工，都比什么风俗小姐强!\n8.2晴\n终于!!!!我终于打听到他的消息了!!!\n听说他出现在稻荷神社附近，可是我去神社找了好久都找不到,他真的在这吗?如果找不到,我的白白怎么办...\n神明大人啊，如果你真的存在的话，求求你不要这么残忍了，求求你，让我的小小白恢复健康吧...\n也不知道那个红衣服的巫女说的是真是假，狐狸旅馆?从来没听说过。但是事到如今我又能怎么办呢....去碰碰运气吧。\n说不定真的能实现愿望呢?\n我没有别的心愿，只希望女儿能顺利的长大...哪怕用我的命来换我也愿意啊...\n8.2.阴\n终于找到工作啦!\n虽然只是一家章鱼烧店的学徒，但是老板人很好!愿意教我，还包吃住。我终于不用打小时工啦!我一定会努力工作，绝对不会辜负老板的好意的!\n要是以后我能通过自己的努力当上店长再攒上一笔钱,开一家自己的章鱼烧铺子该多好呀。",
      "Script": "看完日记的你们撇了很久的神,接着缓缓地合上了日记本。此时你们眼睛一晃，再次定神时你们发现眼前依然是你们熟悉的旅馆，但却有些许不同。\n没有了迷你尺寸的家具,没有了挚爱的鬼丸，没有被冰封的房间，没有一整面墙的案件笔记，没有了菜刀和料理大全，也没有了熟悉的妖怪牌。每个房间都差不多，有点破旧，有点普通。你们轻轻的走出房门，来到了平时打牌的大厅，此时临近夜晚。\n(风一郎第一个到达了打牌的大厅)\n风一郎:好奇怪啊，总感觉哪里不对劲儿，但又说不上来。大家都去哪了?(此时一个身穿紧身连衣裙，带着些许风尘气的女子走了过来)\n阿玉:一郎!不对，你是我的一郎吧....你的耳朵和尾巴...哪去了?(风一郎走过去，轻轻的抚过阿玉的眼角，略带悲伤)\n风一郎:阿玉...你的尾巴和耳朵也...而且你，怎么突然间苍老了些许?\n(两人相互望着彼此，接着一个穿着高中校服的小太妹走了出来)雪姬:你们是...老板娘?厨师哥哥?你们怎么变得...不样了?\n(说着雪女抬头看了看自己的头顶，又想用力量制作小雪花，却发现什么都没了，乌云和力量都没了)\n阿玉:你是...雪姬吗?\n(雪姬不知自己该点头还是摇头，身后走来了一个西装墨镜的中年男人，一脸严肃)\n滑头鬼:雪姬?你是雪姬吗?你这头发颜色怎么是黄色的?你这裙子是不是太短了?\n雪姬:你是滑头鬼大人?!噗哈哈哈哈哈哈,你的头这么短还真让我不习惯呢。\n(阿玉和风一郎被雪姬这句话逗得都笑了起来，滑头鬼大人看着眼前的雪姬开朗的样子，嘴角不自觉的也挂了笑，宠溺的摸摸她的头)\n此时的大厅虽然充斥着陌生的变化,但却还是像曾经的旅馆那样充满了欢笑和温暖，四人正在笑着打趣着对方，却看到一个坐在轮椅上的女孩，眼含悲伤，他身后站着的是一个穿着风衣带着格子帽的男人。男人缓缓的推着女孩来到大厅，欢笑戛然而止，整个大厅都陷入了沉默。\n阿玉:优子?小优子!你的...你的腿...(阿玉突然明白了什么，捂住脸蹲下啜泣起来)\n风一郎:小子，你是天狗吧?这到底是怎么回事?我们怎么都成了这样?(你说完后过去安抚悲伤的阿玉，滑头鬼大人走上前不可置信的看着优子)滑头鬼:你是.优子?你，多少岁了?我为什么对你如此...熟悉?你的腿又是怎么回事?\n(优子低着头不说话，身后的大天狗走过去帮她整了整盖在腿上的毯子)大天狗:你们先别问了..优子优子她自己也很难受啊。我现在，连个能带她飞的翅膀都没了，我真的成了个废物。\n此时的大厅已经没有了欢乐。有的只是压抑和悲伤。小暖:大家...想吃饼干吗?\n所有人都抬起了头,看着出现在自己面前的小暖,一身红色的巫女服和红色的头发，还是像个小太阳样温暖。\n阿玉:小暖，是你叫我们来这里的吧?这到底是怎么回事?\n(小暖挠了挠头，正想开口说些什么，从另一边走廊出现了一个穿着一身名牌的胖子，走近一看，他头发花白，脸上布满皱纹)\n阿玉:是你?(是他?那个曾经骗你签合同的那个年轻人?才过了几年他怎么老成这样)\n(男人看着你们，眼神阴狠，面带疑惑)\nNPC:你们?你们怎么会在这?而且怎么...怎么可能呢?不可能啊?\n(男人正在思考些什么，阿玉突然冲到这个男人面前举起手想要打这个陌生的男人，却被男人身形一闪，接着反手一掌，只听啪的一声，阿玉白皙的脸上就出现了五个红指印。接着男人转身抬起脚将阿玉踹倒，并连踢两脚)\n风一郎:你给我住手!!!(你怒吼着，冲过去一拳打在了男人的脸上。)\n(男人阴狠的转身回给你一拳，两人扭打了起来。优子着急的想冲上去帮忙，却重重的从轮椅上摔了下来。大天狗赶紧抱起优子让她坐回轮椅)\n雪姬:你们!你们住手啊!\n(滑头鬼看了眼小脸都皱在一起的雪姬，冲了上去拉开了两人，男人瞪了眼你们，转身回了房间)\n小暖:大家...那个...现在也挺晚了...不然先回房间休息一晚...明天起来,起来咱们再说?\n(经过刚才的那场闹剧，大家也都累了，你扶起阿玉回了房间，大天狗也推着优子走了。雪姬看了一眼滑头鬼，两人也前后脚的离开了大厅，只剩下小暖呆呆的一个人看着大厅中平时打牌的桌子发呆)\n风一郎送你回到房间后欲言又止的看着你,心疼的轻轻拂过你脸上红色的指印。你看着眼前的他，陌生又熟悉。你静静的靠在他的肩膀上，缓缓的向他讲述了你的故事，你和你的小小白的故事。讲到最后你忍不住哭泣起来。他抓着你微微有些颤抖的肩膀，坚定的望着你说:“阿玉，我一定会帮你治好你的女儿，定会给你幸福的生活。你一定要相信我。”\n你看着他的眼睛点点头，说:“我相信你...但你...不要做傻事啊。他犹豫了一下点了点头，说去给你做点夜宵，让你在房间待一会。”\n你等他走后坐在床上想着:“好不容易找到了他,要不...去求求他吧...只要明天他能去医院就行...”你下定决心后起身走到走廊拐弯尽头小岛的房间，轻轻的敲了敲门。里面传来了‘进来’的声音。你推开门走了进去，房间里很多东西都倒在地上，男人正在椅子上坐着，他头发花白，衣衫有点凌乱，脸也有点肿。看你进来后他轻轻笑了声，说到:“好久不见了啊，阿惠。过得怎么样?”\n你想问他去哪了,为什么抛下你和肚子里的孩子,可是你想到小小白还是忍住了，走上前对他说:“秀川，我们的女儿已经六岁了，叫小小白，很可爱。只是她现在生病了，白血病。只有你才能救她，明天咱们回去，你陪我去趟医院好吗?”\n秀川等你说完后哈哈大笑了起来:“女儿?六岁?哈哈哈你真是会开玩笑。我看你没怎么老还以为你保养得当，又傍上了什么富贵人家呢，还我的女儿，谁知道你跟哪个野男人生的野种，还来骗我，呵呵，醒醒吧傻女人，当初我就是嫌弃你怀孕麻烦，再说了，当年我让你去陪那些高官，谁知道你有没有跟他们乱搞,当年我就怀疑你肚子里那个破烂东西不明不白所以才走的，现在看来，我走的很明智嘛。”\n你看着眼前你曾经用你的全部爱过，付出过的男人。你早就知道他靠不住,可现在他这幅丑恶的嘴脸，说出恶心如利剑一般伤人的话语让你再也无法忍受，你从旁边的桌子上随手拿起一个烟灰缸就砸了下去。\n他因为坐着躲闪不及,直接就被你砸晕在了地上。你举起烟灰缸想要砸死他，却想到你的小小白还忍受着痛苦，这个男人是唯一的办法了。你停住手把烟灰缸放在地上，接着瘫在地上抓着头,想了很久。最后你决定明天把他绑起来，带到医院去，哪怕让一郎帮忙.…\n你起身回到房间，等着一郎来，可是过了很久很久也没有等到他。你在走廊上看了半天，听着厨房似乎有动静，应该是他在做什么吧。回房间前你似乎看到一个黑色的身影在走廊上闪过，你并没有放在心上。\n你回到房间坐在床边，心里牵挂着小小白，等着一郎，不知不觉间困意渐渐袭来。模糊中你似乎看到一郎进来了，摸着你的头说:“阿玉，别担心，我一定会帮你解决好，一定会救你的女儿，你放心，好好睡吧，明天一切都会好的。”不知为何你的心里突然就安稳了下来，然后沉沉的睡了过去\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "找出真相",
      "Ability": ""
    },
    "北野大熊（镰鼬）": {
      "Story": "日记：启程吧\n12月8日阳\n父亲说，要我把每天学习料理的过程记录下来。可每天只是在不停的切东西罢了、切萝卜，切土豆。日复一日，年复一年、有什么好学的呢?\n虽然家果的这间料理亭也有一真多年的历史了，但面对那些萝卜土豆,我实在是没有兴趣。、熊我不适合做一个厨师，感许父亲也没有对我抱什么希望，不然怎么只会让我切菜呢?这切菜我已经练了好几个星期了，也不知道这些萝卜土豆有什么好切的。切得差不多不就行了?非要一样大小粗细，还不都是吃到肚子里，也不知道讲究什么。\n1月3日晴\n东京真繁华啊，那些高楼大厦，那些琳琅满目的商品几乎让我忘了自已手上的伤。忘了父亲那失望的眼神。\n我果然不适合做厨师，不然怎么会笨到切到自己的手。\n父亲一定对我很失望吧,不然怎么叹了口气就走开了。我害怕,我害怕料理,我害怕那把菜刀、我害怕父亲对我失望。\n可能离开家乡，离开那个我害怕的地方，我才能找到真正适合自己的工作吧\n1月20日\n原来这就是大城市的生话!\n和家乡的慢节奏完全不一样，做一个汉堡只要几分钟，几分钟就可以赚一万多日元!\n父母他们一截萝卜都要炖几个小时,而且才能赚个几百日元，为什么他们还要坚持那种老旧又传统的规矩呢?\n东京的发展也太快了，父母的老思想根本就跟不上时代的进步。待在家乡那种地方，可能永远也看不到这场景吧。\n父亲，我一定要给你证明，我得选择才是对的，我一定会成功的!\n5月6日阴\n明天就要交下个月的房租了，我在快餐店当快餐员已经几个月了。\n每天省吃俭用，最后还是一分钱都没攒下来。大城市的生活虽然丰富便利,可东西也比家乡的贵好多，看着别人一夜挥霍千金，我也只能羡慕。\n不行,我不能这么灰头土脸的回去,我要在这生活下去,我要证明给父亲看。\n6月2日多云\n真的是第一次见到那么多钱，估计这些钱我在快餐店干一辈子都挣不出来!真没想到原来家里的那哥小破店那么值钱。\n不过那个男人说的也对，父母那么大年纪了，也该休息休息了,给职业经理人，发展成现代化连锁店多好。不过这时候回去会被父亲教训吧。这个年轻人看上去也是个靠谱的人就让他去劝劝父母吧。\n对了，还是拿些钱给父母，让他们买个高级公寓，也该掌受享受生活了。也算是我对他们的一份孝心吧。\n8月6日晴\n合同签订了，钱也到手了工作嘛，也不需要了\n原来对面大厦的高级饭店这么好吃。\n明天我要搬离这个又破叉小的公寓，银座对面那个高级公寓一定很舒服吧，说不定还能碰到漂亮的女邻居。东京的新生活就要开始啦!\n10月2日小雨\n很行卡怎么就没钱了呢?这高级公寓也没法租下去了。\n原来钱这么不禁花，也不知道怎么回事，物价越来越离谱，什么都在涨价，打个车起步都要一万日元。这大都市的生活也是腻了，还是家里的生活好呀，最起码轻松快乐。父母过的怎么样了呢?\n家的店有发展的怎么样了呢了\n不知道他们有没有买高级公寓好好享受呢?回去看看吧\n10月4日大雨\n不可能，这不可能....\n我的店呢?我的家呢?鱼类加工厂是什么东西?\n我明明只卖了店，怎么会连他...那个合同!该死的，我怎么就没仔细看看那该死的合同呢!爸、妈你们在哪啊??!\n都是我的错，那个男人是个彻头彻尾的骗子。我怎么就听信他的鬼话呢!?\n对不起……对不起\n你们一定是被赶出去了，我一定要找到你们!\n10月6日阴\n终找到你们了,这个人，一定是把我带给你们的钱全都吞了，居然只让你们住在条件过么差的疗养院。\n父亲母亲，都怪儿子，是我不孝，是我把我们的百年料亭毁于一旦。\n都怪我，你们现在才变成现在这样痴痴傻傻的。母亲，您还认出我、我惭愧\n啊\n父亲...我都离开家这么多年了,您为什么只记得我还在练刀工,这个创可贴，是您当时想要给我的吗...父亲...封不起…\n原来父亲您从来没怪过我，是我太懦弱，是我没有坚持、您说的对啊，学料理哪有不切到手的呢!\n对不起父亲，原来您从来没对我失望过，是我自己...亲手毁了这一切啊..\n10月8日多云父母都安顿好了。这些天我一直在后悔\n后悔自已不敢再拿起菜刀……后悔自己不敢面对……\n后悔自已离家出走……后悔听信那个男人的话……后悔自已的店会在自已手里!\n可后悔有什么用呢?不行,我要找到那个骗了我的人，我一发要替父母报仇!一定要赎回自已家的店!\n11月9日阴\n那个巫女不会骗我吧，她说去稻荷神旁的狐狸旅馆就能实现愿望。\n算了，死马当活马医，反正找了这么久没找到，去那就算找不到，也能祈祷一下虽然不知道神明到底是否存在,但如今的我有还能有什么办法呢...无论如何,请帮帮我吧\n",
      "Script": "看完日记的你们愣了很久的神,接着缓缓地合上了日记本。此时你们眼睛一晃，再次定神时你们发现眼前依然是你们熟悉的旅馆，但却有些许不同。\n没有了迷你尺寸的家具,没有了挚爱的鬼丸，没有被冰封的房间，没有一整面墙的案件笔记，没有了菜刀和料理大全，也没有了熟悉的妖怪牌。每个房间都差不多，有点破旧，有点普通。你们轻轻的走出房门，来到了平时打牌的大厅,此时临近夜晚。\n(风一郎第一个到达了打牌的大厅)\n风一郎:好奇怪啊，总感觉哪里不对劲儿，但又说不上来。大家都去哪了?(此时一个身穿紧身连衣裙，带着些许风尘气的女子走了过来)\n(你走过去，轻轻的抚过阿玉的眼角，略带悲伤)\n风一郎:阿玉...你的尾巴和耳朵也...而且你，怎么突然间苍老了些许?阿玉:一郎!不对，你是我的一郎吧.....你的耳朵和尾巴...哪去了?\n(两人相互望着彼此，接着一个穿着高中校服的小太妹走了出来)雪姬:你们是...老板娘?厨师哥哥?你们怎么变得...不样了?\n(说着雪女抬头看了看自己的头顶，又想用力量制作小雪花，却发现什么都没了，乌云和力量都没了)\n风一郎:你是...雪姬吗?\n(雪姬不知自己该点头还是摇头，身后走来了一个西装墨镜的中年男人，一脸严肃)\n滑头鬼:雪姬?你是雪姬吗?你这头发颜色怎么是黄色的?你这裙子是不是太短了?\n雪姬:你是滑头鬼大人?!噗哈哈哈哈哈哈,你的头这么短还真让我不习惯呢。(阿玉和你被雪姬这句话逗得都笑了起来，滑头鬼大人看着眼前的雪姬开朗的样子，嘴角不自觉的也挂了笑，宠溺的摸摸她的头)\n此时的大厅虽然充斥着陌生的变化,但却还是像曾经的旅馆那样充满了欢笑和温暖，四人正在笑着打趣着对方，却看到一个坐在轮椅上的女孩，眼含悲伤，他身后站着的是一个穿着风衣带着格子帽的男人。男人缓缓的推着女孩来到大厅，欢笑戛然而止，整个大厅都陷入了沉默。\n阿玉:优子?小优子!你的...你的腿...(阿玉突然明白了什么，捂住脸蹲下啜泣起来)\n风一郎:小子，你是天狗吧?这到底是怎么回事?我们怎么都成了这样?(你说完后过去安抚悲伤的阿玉，滑头鬼大人走上前不可置信的看着优子)滑头鬼:你是.优子?你，多少岁了?我为什么对你如此...熟悉?你的腿又是怎么回事?\n(优子低着头不说话，身后的大天狗走过去帮她整了整盖在腿上的毯子)大天狗:你们先别问了..优子优子她自己也很难受啊。我现在，连个能带她飞的翅膀都没了，我真的成了个废物。\n此时的大厅已经没有了欢乐。有的只是压抑和悲伤。小暖:大家...想吃饼干吗?\n所有人都抬起了头,看着出现在自己面前的小暖，一身红色的巫女服和红色的头发，还是像个小太阳样温暖。\n风一郎:小暖，是你叫我们来这里的吧?这到底是怎么回事?\n(小暖挠了挠头，正想开口说些什么，从另一边走廊出现了一个穿着一身名牌的胖子，走近一看，他头发花白，脸上布满皱纹)\n风一郎:是你?(是他?那个曾经骗你签合同的那个年轻人?才过了几年他怎么老成这样)\n(男人看着你们，眼神阴狠，面带疑惑)\nNPC:你们?你们怎么会在这?而且怎么...怎么可能呢?不可能啊?\n(男人正在思考些什么，阿玉突然冲到这个男人面前举起手想要打这个陌生的男人，却被男人身形一闪，接着反手一掌，只听啪的一声，阿玉白皙的脸上就出现了五个红指印。接着男人转身抬起脚将阿玉踹倒，并连踢两脚)\n风一郎:你给我住手!!!(你怒吼着，冲过去一拳打在了男人的脸上。)\n(男人阴狠的转身回给你一拳，两人扭打了起来。优子着急的想冲上去帮忙,却重重的从轮椅上摔了下来。大天狗赶紧抱起优子让她坐回轮椅)\n雪姬:你们!你们住手啊!\n(滑头鬼看了眼小脸都皱在一起的雪姬，冲了上去拉开了两人，男人瞪了眼你们，转身回了房间)\n小暖:大家...那个...现在也挺晚了...不然先回房间休息一晚...明天起来,起来\n咱们再说?\n(经过刚才的那场闹剧，大家也都累了，你扶起阿玉回了房间，大天狗也推着优子走了。雪姬看了一眼滑头鬼，两人也前后脚的离开了大厅，只剩下小暖呆呆的一个人看着大厅中平时打牌的桌子发呆)\n你送阿玉回到房间后欲言又止的看着她，你想询问到底为什么,阿玉的曾经究竟经历过什么?可最后\n述了她的故事，她从小乡村出生，从暴虐的父亲手下死里逃生，去到京都谋生路，遇到这个你只是心疼的轻轻拂过她脸上红色的指印。阿玉静静的靠在你的肩膀上，缓缓的向你讲男人，相爱后她怀了孕，男人却逃之夭天了。她一个人将女儿抚养长大，女儿好不容易六岁却患上了白血病。孩子如今病危了，她走投无路只能来找孩子的亲生父亲给孩子做配型移植骨髓救孩子的命。讲到最后她忍不住哭泣起来。\n你听后心疼极了,抓着阿玉微微有些颤抖的肩膀,坚定的望着她说:“阿玉，我一定会帮你治好你的女儿，一定会给你幸福的生活。你一定要相信我。”你丝毫不介意她的过往，你只恨自己没有早点遇到她。但你也害怕早一点遇见她，你害怕当时的你，无法给她安全感，无法给她幸福，但现在的你可以!至少，你可以去把那个伤害她的男人，送去见真正的稻荷神!更何况那个男人骗走了你家的百年料亭，害得你父母变成了那样!新仇旧恨，一起算。\n阿玉看着你的眼睛点点头，说:“我相信你...但你...不要做傻事啊。”你不得不欺骗她，你不想让她担心。点了点头，说去给她做点夜宵，让她在房间待一会。说完后你就离开了阿玉的房间去厨房找趁手的家伙。\n你在厨房的料理台上拿了一把菜刀,握住菜刀的瞬间你心里涌出阵感慨，你在狐狸旅馆为阿玉所做的一切都历历在目。在旅馆你为她杀妖弑神，如今回到现实，你也愿意为她手刃仇人，但是在杀他之前，要把阿玉需要的骨髓想办法搞到手才行，不然阿玉的女儿要怎么办。\n你在厨房用你所有能找到的工具自制了一个注射器，虽然很简陋，但是应该可以用吧。你带好注射器和菜刀,穿过走廊来到了拐角尽头男人的房间。你发现他的门并没有上锁，于是你轻轻的推开了房门。你发现房间很凌乱，似乎经过了打斗一般，地上扔着一个烟灰缸，男人躺在地上闭着眼睛不知是死是活。你走过去推了推他，没什么反应，你走过去将注射器插进他的膝盖，不知是不是因为自制的注射器确实不够专业好用，你抽的非常困难，但是好歹抽出了一些黄粉色的东西，应该是骨髓了吧..\n你用纸巾擦了擦注射器的头，小心的将它放在你准备好的盒子里，接着用菜刀连捅他好几刀。你确定他死透了，就把刀扔出了窗外，然后把他小心的挪到大厅做成趴着的样子，并擦干了他房间和走廊的血迹。你害怕身体组织变质，将盒子放进冰箱保鲜，做完这一切后你才后知后觉的想到，这是你...真正意义上的第一次杀人...似乎没有什么感觉...呕...一阵恶心传来，你跑到厕所吐了很久。等你整理好心情已经过了\n很久，你想起阿玉还在等你，连忙去厨房做了碗面端着去了阿玉的房间。你进去后才发现阿玉好像已经睡了,你把面放在旁边，走过去仔细端详着这个对你来说最重要的女人，摸着她的头，自言自语道:“阿玉，别担心，我一定会帮你解决好，一定会救你的女儿，你放心,好好睡吧，等到明天...一切都会好的。”说着你也感到一阵疲惫，仿佛卸下重担一般，你也靠在床边沉沉睡去。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "找出真相",
      "Ability": ""
    },
    "小暖（小狐狸）": {
      "Story": "日记：1月1日\n又是新的一年了我还是没有成为神使，妹妹已经成为神使两年。而我还没有完成我的承诺，我什么时候才能完成我的约定呢?神明大人，你会保佑我的吧?\n神明大人，希望我今年可以成为神使。神明大人，希望爸爸妈妈可以快乐。神明大人，希望爷爷奶奶身体建康。神明大人，希望妹妹在你的身边好好的。\n神明大人，希望我遇见的每一个人都幸福快乐。拜托!!\n1月10日\n今天我碰到了一对好心的夫妻，他们说愿意收留我，他们把我带去了一间暖乎乎的小房子，他们说这里以后就是我的家了。\n家?家是个什么样的地方呀，这就是我的家了吗?我拥有家人了吗?\n他们摸着我的头，让我以后管他们叫爸爸妈妈，我懵懂的看着他们的眼睛，叫了他们一声爸爸妈吗。突然他们的眼睛变得弯弯的像小月牙一样，我的心也变得暖暖的，像是放了一个小火炉一样，是暖暖的房子的原因吗，还是家人这两个字的力量呢?\n我还拥有一个可爱的的妹妹,他也很喜欢我的样子,我们会相处的很愉快吧!\n3月21日\n我还是想成为名神使，我不会弃的!\n虽然很舍不得爷爷奶奶,很舍不得白狐村的大家,但是是我应该离开的时候\n了\n我背上小行囊，找到爷爷奶奶告别.\n爷爷奶奶的怀抱好温暖呀，我会永远记住这个感觉的!\n爷爷奶奶还塞给我一包我最爱吃的爪爪饼干,叮嘱我要好好照顾自己，要好好吃饭，别着凉，要努力完成愿望，不要忘记他们，我用力的点点头，不会记的，一定不会!\n3月3日\n今大稻荷神大人来找我,让我将最后一个人引入狐狸旅馆，明明已经六个人了呀?\n这是一个大腹便便的，两鬓斑白的男子，我总觉得我以前好像见过他，他以前来这吗?\n我还是走上前去，询问他有什么愿望想要实现吗?那就去寻找狐狸旅馆吧.它能实现你所有愿望。\n他的身上有一种奇怪的力量，靠近他的时候我不由的浑身发冷，从由心散发出一种情绪这是…恐惧?\n为什么我会感觉到恐惧呢?\n像是我的同类在警告我远离他一样。他到底做了些什么?\n3月4日\n我好努力的做修行，可是我等不及下一次的选择了。小确还在等着着我呢，我是不是该离开去寻找新的机会呢?我和爸爸妈妈说了我的想法，爸爸妈妈和我说“孩子，\n你去追导你的梦想吧，爸爸妈妈会一直为你祝福的，记住爸爸妈妈永远在这里，累了就回来，家里永远等你”\n我背上了行囊，踏出家门的时候，爸爸妈妈又像初见时那样，摸着我的头,但不如道为什么，他们的眼角有些湿润，椅怪，我的眼角也湿润了，为什么呢?\n3月4日\n稻荷神大人让我也和他们一起进入狐理旅馆,这是我的最后一个考验,帮助他们找至到实现望的]力量，我吗?\n我能做到吗?\n究竟是什么样的力量呢?\n回想起之前进去的人们苦恼的样子，不行，小暖想让每个人都幸福。小暖能做到的!\n4月8日\n在白狐村的日子真是太开心了，大家都很照顾我。\n爷爷奶奶每天都给我做好吃的，我每天都吃的饱饱的,我也每天都给爷爷奶奶捶背。\n爷爷奶奶也每天都夸奖我，给我吃爪爪饼干。这种感觉好热悉,就像找到了二个家一样。\n大家开心心的多美好呀~\n4月28日\n在这个叫家的地方，真的好幸福呀!\n爸爸妈妈都很爱我，每天都给我和妹妹买好多好多好吃的，还会带我和妹妹出去玩，妹妹萌也会把自己最爱吃的爪爪饼给我一起分享。\n小暖每天都很开心很开心。\n风彦爸爸，抚子妈妈，小萌妹妹，我看你们!你们是我最爱的家人!\n5月20日\n今天我实在等不及了，去问了村长爷爷。\n什么时候才能选拔神使候补，村长爷爷却一脸奇怪的表情说，去年不是刚选拔完吗?\n就在我来到这里的两天前，这里可是几十年才选一次神使呢。天哪，怎么会这样，难道我注定成为不了神使吗?\n我要背我也约定了吗?\n6月8日\n今天是最后一个迷茫的人到来的时候，是一个穿着校服染着头发的女孩。我看着她，她身奇异的波动异常强烈。\n我听到她许愿到:神明大人\n请赐我勇气让我帮她讨回公道吧。\n我走了过去问:你有什么心结吗?去狐狸旅馆吧，你会实现愿望的。我也会在这里为你们祝福的!\n小萌,:马上我就能见到你了!\n7月1日\n我在稻荷神山的稻荷神社修行一段时间了，又是新的一年。\n当我摇动铃铛向神明大人诉说愿望的时候，我的面前突然出现了一个人，矮矮的个子，肚子圆乎乎的还戴着一顶高高的帽子。\n这不是稻荷神大人吗!\n稻荷神大人看到我了!\n稻荷神大人说要给我一个考验，如果我能完成他的考验,他就让我做他的神使!\n我的愿望终于可以实现了吗!\n我一定会好好完成考验，不会让神明大人失望的!\n7月20日\n今天又碰到了一个迷茫的人，穿着西装戴着墨镜的严肃男人。他好像很烦恼的样子许了愿:希望能替玲子报仇，找到小樱桃。\n玲子和小樱桃是谁???一定是对他很重要的人吧，我依旧指引他前往了狐狸旅馆，希望稻荷神大人能让他们幸福吧!\n看来，我只需要守在神社，就有迷茫的人到来，能够帮助苦恼的人们，小萌也会很开心呢。\n8月2日\n夏天来了，我吃着小饼于，晒太阳，看着天空想念家人们。\n熟悉的力量感从鸟居传来，一位略显风尘的女子走了上来，那一身性感的紧身连衣裙上，还有着十分浓重的酒味，我听到她许愿:希望神明大人能让我的女儿小白健康快乐的成长。\n她一定是个好妈妈吧…如果她是我的妈妈该多好啊….\n我的心有些酸酸的,不如道这个女子发生了什么,但是稻荷神大人可以帮助她的!\n我将她也引去了狐狸旅馆。加油小暖，你会帮助更多人的!\n8月16日\n今天同时来两个迷茫的人，那个坐在轮椅上的女孩叹着气，捶着自己的腿。在她身后是个穿着风衣，戴着格子帽子的年轻男人，显得有些心不在焉。女孩轻轻的许愿:希望神明大人能让妈妈醒来。\n男孩则许愿到:希望能帮桃子伸张正义。\n我又一次走上前去，让他们前往狐狸派馆，实现自己的愿望。他们真的好可怜，小暖感到了他们的困扰和无奈。\n愿神明大人实现你们的愿望。\n8月16日\n我又在旅途上了，离开了我的家人们，为我的梦想，带着他们的期愿。听说,有一座山，叫做稻荷神山，如果在神山上修行，稻荷神大人就能看到。那这里离稻荷神大人住的地方一定非常近吧?\n如果稻荷神大人能看见，那小萌是不是也能看见呢?小萌，你看我离你越来越近了呢!\n9月16日，\n我在路上走了好久呀，可是没有人愿意接纳我，太阳好晒呀。我的小爪子都走起泡了,好痛呀。\n我应该放弃吗?我好想爸爸妈妈呀。\n不行,我不能放弃，妹妹还在等着我呢。爸爸妈妈这么支持我，我怎么能放弃呢?\n我一定能成功的,听说有一个白狐在这个村子里,一次就能出好多好多神使,所以如果我能去到这个地方我就能成为神使了吧!\n加油小暖!你可以的!\n10月30日\n我终于找到那个白狐村了，这里的狐狸都好和善呀。\n村长爷爷很热情的招呼我，让我在村中住下，听村长爷爷说，村西边有一对老爷爷老奶奶，没有人照顾没有人陪他们。好可怜呀，我要帮助地们。\n于是我和村长爷爷说我想住在老爷爷家里,村长乐呵呵的叫来了老爷爷老奶奶;爷爷奶奶很谅喜的样子。\n从口袋里掏出一块饼干递给我，我好开心，我想起妹妹了，妹妹你还好吗，小暖定会去找你的。\n11月9日\n稻荷神大人让我去聆听别人的愿望，寻找六个迷茫或绝望的人们，把他们指引到一个叫做狐狸旅馆的地方。\n为了方便,稻荷神大人把我变成了一个人类的模样，我红色的皮毛，变成了红色的巫女服,，但是我不能离开稻荷神山，在这里等着就能等到那迷茫的人了吗?\n咦?那个人身上有好奇怪的力量，这..就是迷茫吗?\n我靠近了那个穿格子衬衫的阳光男孩听到他许的愿望,希望神明大人能帮助我找到那个骗子，能让我的父母变得安康，看着他紧皱眉头的样子，我不由的问他，你有什么烦恼么?去狐狸旅馆吧，那里会实现你的愿望。\n看来我找到第一个迷茫的人了，还有五个。\n11月15日\n听说马上蹈荷神大人就要来挑选神使了!我也好想成为神使呀!\n妹妹也想和我一起成为神使，这样我妹女就丽队呆在一起了。小萌，我们一起努力吧!\n12月23日\n今天在路上捡到3这个本子，好好子看呀.不如就用来记录一下我找寻家人所发生的事吧.我的家人到底在哪里呀，他们都是什么样子的人呢?\n暖真的好期待啊，虽然现在很辛苦，吃不饱，穿不暖的。但是我相信这一定是神明大人给我的考验，我一定会努力\n加油，找到我的家人的。\n12月25日\n今天，稻荷神神使的的选拔完成了。\n小萌成了新的神使，妹妹真是太优秀了，真为她开心。我也要努力，我们预定过要一起成为神使得。\n等着我吧，我会努力赶上你的脚步的!!!\n",
      "Script": "看完日记的你们愣了很久的神,接着缓缓地合上了日记本。此时你们眼睛一晃，再次定神时你们发现眼前依然是你们熟悉的旅馆，但却有些许不同。\n没有了迷你尺寸的家具，没有了挚爱的鬼丸，没有被冰封的房间，没有一整面墙的案件笔记，没有了菜刀和料理大全，也没有了熟悉的妖怪牌。每个房间都差不多，有点破旧，有点普通。你们轻轻的走出房门，来到了平时打牌的大厅。此时临近夜晚。\n(风一郎第一个到达了打牌的大厅)\n风郎:好奇怪啊，总感觉哪里不对劲儿，但又说不上来。大家都去哪了?(此时一个身穿紧身连衣裙，带着些许风尘气的女子走了过来)\n阿玉:一郎!不对，你是我的一郎吧....你的耳朵和尾巴...哪去了?(风一郎走过去，轻轻的抚过阿玉的眼角，略带悲伤)\n风一郎:阿玉...你的尾巴和耳朵也...而且你，怎么突然间苍老了些许?(两人相互望着彼此，接着一个穿着高中校服的小太妹走了出来)雪姬:你们是、..老板娘?厨师哥哥?你们怎么变得...不一样了?\n(说着雪女抬头看了看自己的头顶，又想用力量制作小雪花，却发现什么都没了，乌云和力量都没了)\n阿玉、风一郎:你是...雪姬吗?\n(雪姬不知自己该点头还是摇头，身后走来了一个西装墨镜的中年男人，一脸严肃)\n滑头鬼:雪姬?你是雪姬吗?你这头发颜色怎么是黄色的?你这裙子是不是太短了?\n雪姬:你是滑头鬼大人?!噗哈哈哈哈哈哈,你的头这么短还真让我不习惯呢。\n(阿玉和风一郎被雪姬这句话逗得都笑了起来，滑头鬼大人看着眼前的雪姬开朗的样子，嘴角不自觉的也挂了笑,宠溺的摸摸她的头)\n此时的大厅虽然充斥着陌生的变化,但却还是像曾经的旅馆那样充满了欢笑和温暖，四人正在笑着打趣着对方，却看到一个坐在轮椅上的女孩，眼含悲伤，他身后站着的是一个穿着风衣带着格子帽的男人。男人缓缓的推着女孩来到大厅，欢笑戛然而止，整个大厅都陷入了沉默。\n阿玉:优子?小优子!你的..你的腿..(阿玉突然明白了什么，捂住脸蹲下啜泣起来)\n风一郎:小子，你是天狗吧?这到底是怎么回事?我们怎么都成了这样?(风一郎说完后过去安抚悲伤的阿玉，滑头鬼大人走上前不可置信的看着优子)\n滑头鬼:你是...优子?你，多少岁了?我为什么对你如此..熟悉?你的腿又是怎么回事?\n(优子低着头不说话，身后的大天狗走过去帮她整了整盖在腿上的毯子)大天狗:你们先别问了..优子..优子她自己也很难受啊。我现在,连个能带她飞的翅膀都没了，我真的成了个废物。\n此时的大厅已经没有了欢乐。有的只是压抑和悲伤。小暖:大家...想吃饼干吗?\n所有人都抬起了头，看着出现在自己面前的小暖，一身红色的巫女服和红色的头发，还是像个小太阳一样温暖。\n所有人:小暖，是你叫我们来这里的吧?这到底是怎么回事?\n(你挠了挠头，正想开口说些什么，从另一边走廊出现了一个穿着一身名牌的胖子，走近一看，他头发花白，脸上布满皱纹)\n所有人:是你\n(男人看着你们，眼神阴狠，面带疑惑)\nNPC:你们?你们怎么会在这?而且怎么...怎么可能呢?不可能啊?\n(男人正在思考些什么，阿玉突然冲到这个男人面前举起手想要打这个陌生的男人，却被男人身形一闪，接着反手一掌，只听啪的一声，阿玉白皙的脸上就出现了五个红指印。接着的从轮椅上摔了下来。大天狗赶紧抱起优子让她坐回轮椅)\n雪姬:你们!你们住手啊!\n风郎:你给我住手!!!(风一郎喊着，冲过去一拳打在了男人的脸上。)\n(男人阴狠的转身回给风一郎一拳，两人扭打了起来。优子着急的想冲上去帮忙，却重重男人转身抬起脚将阿玉踹倒，并连踢两脚)\n(滑头鬼看了眼小脸都皱在一起的雪姬，冲了上去拉开了两人，男人瞪了一眼你们，转身回了房间)\n小暖:大家...那个...现在也挺晚了...不然先回房间休息一晚...明天起来，起来咱们再说?\n(经过刚才的那场闹剧，大家也都累了，风一郎扶起阿玉回了房间，大天狗也推着优子走了。雪姬看了一眼滑头鬼，两人也前后脚的离开了大厅，只剩下你呆呆的一个人看着大厅中平时打牌的桌子发呆)\n大家依次离开后,你独自在大厅发了很久的呆。在旅馆一起生活的日子就像幻灯片一般，一幕幕的在你的面前闪过。温柔的像妈妈一样的阿玉姐姐，带你一起捉虫子的滑头鬼叔叔，会给你小礼物的大天狗哥哥，会帮你烤饼干，给你做甜汤的风一郎哥哥，和你一起住了那么久，像亲姐妹一样的优子，还有你第一个，也是唯一的朋友，雪姬。大家就像是真正的一家人一样，在这张桌子前，嬉笑怒骂，一起打牌，喝酒，吃饭。优子因为个子小要站在桌子上，滑头鬼叔叔打牌永远都能赢，雪姬会用小雪人偷看，风一郎哥哥永远都让着阿玉姐姐，大天狗哥哥总是一本正经的在旁边，可他的眼睛从来没离开过优子。\n大家...都是一家人啊,可是刚才...那么熟悉又陌生...似乎就像是陌生人..你叹了口气回到了房间，却发现房间里放着一包爪爪饼干和妖怪牌原来...大家在狐狸旅馆里的生活不是假的.是真的一起度过了那么久的岁月,大家都吃过你的爪爪饼干，大家都陪你打过妖怪牌.你的眼泪‘啪嗒啪嗒’的落在了桌上，你把自己埋在胳膊里，你知道你舍不得大家，舍不得他们每一个人。狐狸旅馆可以给他们一个美好的景象，一段单纯快乐的生活，但他们不能永远留在这个虚假的美梦里..他们实现了愿望，找到了自己最重要的东西，他们还要回去勇敢的面对他们的生活啊...\n小暖...舍不得大家...可是...小暖一定要让大家向前走啊!不能停留在痛苦的原地做鸵鸟啊!不能永远躲在这里...把自己封闭起来啊...你擦了擦脸上的泪珠，把小爪子紧紧攥成拳给自己打气:小暖!加油!你一定可以让大家获得力量!勇敢的向前走的!小暖也定会帮稻荷神大人保护好那些和小暖一样单纯善良的鲸鱼，让稻荷神大人变健康，有力量可以继续保佑小暖的家人们!!\n小暖!加油!\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "找出真相",
      "Ability": ""
    },
    "凉宫桃子（小人偶）": {
      "Story": "日记：1月1日\n今天，是是我拥有“家”的第一八年转眼间从孤儿院出来已经这么久了呀!感谢神明大人赠与我这份珍贵的礼物一让我有家人，体本会到温暖!\n去年的新年是是我和爸爸妈妈一起，今年变成了我、爸爸、妈妈还有妹妹一起，吃饭的碗筷多添一副，合照里多一个身影，一切好像变得越来越好。\n妹妹很可爱，她像条小尾巴，喜欢跟着我，粘着我叫姐姐，她的出现给我的生活添加了不少乐趣，爸爸妈妈不在的时候，也有她陪我玩耍，真好!\n可不知道为什么,我总觉得爸爸妈妈对我没有那么在意了.……没有像之前那样在意了，是因为妹妹吗?\n不对不对，肯定是我想多了!\n新的一年又到来喽~一~希望这一年我爱的大家都可以开心健康!请多关照!!!\n2月3日晴转多云难过....为什么呢\n为什么不再对我笑，不再关心我，不再和我说很多话。我说很多话。\n因为我不是你们的亲生女儿吗?弟弟就那么重要吗?\n爸爸妈妈，我也很需要你们啊!我也想......\n2月4日\n是我高看了这个社会,，这个界已经掉了里到外，烂的一团麻。\n我和妈妈奔了这么久,我拿着那些片去抗议，去维权，去为我的漾鱼讨说法，但......有什么用呢?\n官官相护，钱就能摆平所有事。太恶心了，真的太恶心了。\n4月1日\n我没想息过个新年是在医度度过的，当我醒星来的时候，迎接我的是四周惨白的墙，氧气罩，以及穿白大褂的医生。\n我很想说话，很想起身，可我没有力气，被子里空荡荡的，空荡荡的。\n医生告诉我，3月29日那天我和妈妈出了车祸，母亲为了救我被撞飞变成植物人，我侥幸活了下来，但双腿.......必须截肢。\n哈哈,我的人生，是跟我开玩笑吗\n妈妈…我妈妈…\n我永远不会忘记那辆车它故意撞过来的\n故意杀人\n我看到到了，有个女孩还有个男人在车里。\n我好恨\n4月2日\n她为什么要撤谎“法官，她在说谎!”“你这个骗子骗，骗子”骗子\n骗子骗子骗子骗子\n她是骗子，她在说谎。法官，她在说谎啊不是这样的!!!\n4月20日 阴×\n第九年，我终于失去了它。我再也没有家了\n6月28日\n有时候我觉得妈妈像个魔术师，她的肚子又渐渐鼓了起来,，妹妹每天都会问我妈妈肚子里装着什么，嗯.…..我也不太清楚。\n爸爸总听妈妈的肚子,然后笑得很开心小心翼白的拼无摸肚皮,然而我和妹妹也想摸时，爸爸会把我拦下来，然后抱起妹说，那里住着她的弟弟。\n什么啊，不也是我的弟弟吗?\n为什么..…..不让我也去摸摸呢?\n7月18日 晴\n夏天来了,不知不觉一年已经过去了大半，再翻开日记本记录的刹那还有些陌生，时隔三月，确实发生过很多事。比如，我接受了爸妈不爱我。\n比如，我离开了那个我曾那么爱的家。\n比如，他们并没有找我，甚至可能没这个想法。再比如，我遇见了我真正的母亲\n从她看到我时,眼神中流出的慈爱和疼惜,是我从未在之前妈妈身上见过的，她抱着我叫小樱桃的时候，语气里的颤抖骗不了人。也是那天，我知道自己的名字，原来还有小名，叫做樱桃。也在那一天，我才明白我不是被抛弃的可怜虫，而是与妈妈走散了.她牵挂一辈子。\n神明大人，我是有人爱的对吧。\n距离妈妈带我回到小渔村已经快一个月了,我们的生活简单却快乐,妈妈喜欢带我去坐渔船，每当海每面泛浪花都会有蓝色身影飞跃海平面。那是鲸鱼!\n特别特别美，自由，又美好。\n呐，我的快乐，在一点一点回来，现在的我，比任何时候，都要幸福。\n8月12日\n我认识黑泽蒯，105天了\n他是一个侦探,每天喜欢在凌晨两点半来便利店买一个冷的红豆面包和两瓶啤酒。\n我记得他想探寻的眼神，探头在看见我身下的轮椅时他很震惊，说了好多遍对不起。\n他……真的挺好的，虽然只是个三流侦探,做的都是找宠物调查婚外情这种事。他的身体不太好，总是随身带个喷雾药。可是他在知道我的事情之后拼命的帮我查证，想替我和还睡在医院的母亲伸张正义，他很努力。\n可是，再多的努力都斗不过势力。\n那个罪魁祸首，每月都谈笑风生的出现在他家,送贵的奢侈品给他家人，这些足把们垮，黑泽这样对我讲的时候，捂着脑袋，非常自责。\n我知道,我都知道\n所以我不恨他，不是他的错。\n8月16日\n他说要去杀了那个男人讨回公道。\n他说兑听到息传那个男人在稻荷神社付近近出现了。他说...\n我说:带我去吧，让我和神明大人最后吧吧。他说:好。\n如果可以，请大人、让我都能幸福一点，拜托了。\n10月9日\n血.....好多血血，多沙滩都被染了色。\n我真的不敢相信我的眼睛，曾经陪我嬉闹1，自由的鲸，现在正以开檬破肚的模样出现在我眼前前，我….我\n那是生命啊!是活生生的命啊!\n它们就在我面前，眼都没闭上，它们在哭,，我我听到了，我听到了!得有多疼啊!\n人面兽心的刽子手们，捕杀了我的朋友,我好害怕，他们长得都好凶，像恶魔，在人间游荡。\n不行，我不能退缩，我要帮它们报仇!我这些恶人受到应育的惩罚\n我要去去京都!!听说那里有很多保护海生物的组织我一定可以阻阻止他们的!\n12月25\n今天，是弟弟出生后的第二个月。\n爸爸妈妈的精力似乎全放了他身上，他们专门布置出了一间幼儿房给弟弟，里面堆满了各式各样的玩具，那些都是我见都没见过的\n有一次，我向爸爸问能不能拿一个出来给我和妹妹玩儿,他看了我一眼,眼里都是冷冰冰的东西，像一棵树，扎到了我的心脏。\n那一刻开始，我知道有些事情，已经变了。现在是晚上6点半的圣诞节，窗外应景的下着雪，我的爸妈在和弟弟妹妹吃饭，而我在卧室下这篇日记\n他们都没有来叫我.…....\n雪很美，可我却一点也开心不起来....我好像，要失去我这么热爱的家了..\n",
      "Script": "看完日记的你们韶了很久的神,接着缓缓地合上了日记本。此时你们眼睛一晃，再次定神时你们发现眼前依然是你们熟悉的旅馆，但却有些许不同。\n没有了迷你尺寸的家具，没有了挚爱的鬼丸，没有被冰封的房间，没有一整面墙的案件笔记，没有了菜刀和料理大全，也没有了熟悉的妖怪牌。每个房间都差不多，有点破旧，有点普通。你们轻轻的走出房门，来到了平时打牌的大厅。此时临近夜晚。\n(风一郎第一个到达了打牌的大厅)\n风一郎:好奇怪啊，总感觉哪里不对劲儿,但又说不上来。大家都去哪了?(此时一个身穿紧身连衣裙，带着些许风尘气的女子走了过来)\n阿玉:一郎!不对，你是我的一郎吧...你的耳朵和尾巴..哪去了?(风一郎走过去，轻轻的抚过阿玉的眼角，略带悲伤)\n风郎:阿玉...你的尾巴和耳朵也...而且你，怎么突然间苍老了些许?(两人相互望着彼此，接着一个穿着高中校服的小太妹走了出来)雪姬:你们是..老板娘?厨师哥哥?你们怎么变得..不样了?\n(说着雪女抬头看了看自己的头顶，又想用力量制作小雪花，却发现什么都没了，乌云和力量都没了)\n阿玉、风一郎:你是...雪姬吗?\n(雪姬不知自己该点头还是摇头，身后走来了一个西装墨镜的中年男人，一脸严肃)\n滑头鬼:雪姬?你是雪姬吗?你这头发颜色怎么是黄色的?你这裙子是不是太短了?\n雪姬:你是滑头鬼大人?!噗哈哈哈哈哈哈,你的头这么短还真让我不习惯呢。\n(阿玉和风郎被雪姬这句话逗得都笑了起来，滑头鬼大人看着眼前的雪姬开朗的样子，嘴角不自觉的也挂了笑，宠溺的摸摸她的头)\n此时的大厅虽然充斥着陌生的变化,但却还是像曾经的旅馆那样充满了欢笑和温暖，四人正在笑着打趣着对方，却看到一个坐在轮椅上的女孩，眼含悲伤，他身后站着的是一个穿着风衣带着格子帽的男人。男人缓缓的推着女孩来到大厅，欢笑臻然而止，整个大厅都陷入了沉默。\n阿玉:优子?小优子!你的你的腿..\n(阿玉突然明白了什么，捂住脸蹲下啜泣起来)\n风郎:小子，你是天狗吧?这到底是怎么回事?我们怎么都成了这样?\n(风一郎说完后过去安抚悲伤的阿玉，滑头鬼大人走上前不可置信的看着优子)\n滑头鬼:你是...优子?你，多少岁了?我为什么对你如此.熟悉?你的腿又是怎么回事?\n(优子低着头不说话，身后的大天狗走过去帮她整了整盖在腿上的毯子)大天狗:你们先别问了优子优子她自己也很难受啊。我现在,连个能带她飞的翅膀都没了，我真的成了个废物。\n此时的大厅已经没有了欢乐。有的只是压抑和悲伤。小暖:大家...想吃饼干吗?\n所有人都抬起了头,看着出现在自己面前的小暖，一身红色的巫女服和红色的头发，还是像个小太阳一样温暖。\n优子:小暖，是你叫我们来这里的吧?这到底是怎么回事?_\n(小暖挠了挠头，正想开口说些什么，从另一边走廊出现了一个穿着一身名牌的胖子，走近一看，他头发花白，脸上布满皱纹)\n优子:是你!(是他!!!你永远不会忘记这张脸，这张脸出现在那天晚上的驾驶位，那个害了你和你妈妈的凶手!!!)\n(男人看着你们，眼神阴狠，面带疑惑)\nNPC:你们?你们怎么会在这?而且怎么...怎么可能呢?不可能啊?\n(男人正在思考些什么，阿玉突然冲到这个男人面前举起手想要打这个陌生的男人，却被男人身形一闪，接着反手一掌，只听啪的声，阿玉白皙的脸上就出现了五个红指印。接着男人转身抬起脚将阿玉踹倒，并连踢两脚)\n风郎:你给我住手!!!(风一郎喊着，冲过去一拳打在了男人的脸上。)\n(男人阴狠的转身回给风一郎一拳，两人扭打了起来。你着急的想冲上去帮忙,却重重的从轮椅上摔了下来。大天狗赶紧抱起你让你坐回轮椅)\n雪姬:你们!你们住手啊!\n(滑头鬼看了眼小脸都皱在一起的雪姬，冲了上去拉开了两人，男人瞪了一眼你们，转身回了房间)\n小暖:大家...那个...现在也挺晚了...不然先回房间休息...明天起来，起来咱们再说?\n(经过刚才的那场闹剧，大家也都累了，风一郎扶起阿玉回了房间，大天狗也推着你走了。雪姬看了滑头鬼，两人也前后脚的离开了大厅，只剩下小暖呆呆的一个人看着大厅中平时打牌的桌子发呆)\n大天狗将你推回你的房间，然后轻轻抱起你，将你放在床上盖好了被子。你看着眼前的男孩，还是记忆里熟悉的那个小侦探黑泽蒯。在旅馆的日子仿佛梦一般，但那些回忆却占据了你的脑海。你轻轻的拉住了他的衣角，轻声说:“阿泽...你是不是要去找他?你知道法律无法制裁他，你要去坚持你自己的正义是不是?”\n男孩不敢看你的眼睛，轻轻地点头道:“桃子，你不要担心我，你乖乖的在房间里，睡一觉，等你醒来的时候我就回来了。”你使劲拉了拉他的手，认真道:“不要做傻事，我现在能依靠的只有你了。答应我，\n你定要好好地回来，好吗?”男孩点头，帮你掖了掖被角就出去了。\n你在床上躺着却全无睡意,睁着眼睛盯着天花板。那晚的小巷,车头的大灯，母亲的尖叫。这一切萦绕在你的脑海里。你心里的恨意越来越浓烈，那个剑子手离你咫尺之遥!你要亲手为母亲为自己报仇!你已经被仇恨占据了脑海，全然不顾是想要冲过去，却‘蔼’的一声摔下了床。\n这刻你回到了现实，恢复了理智。你只是个残废而已，别说报仇了，连站起来都做不到。你的情绪终于在这刻崩溃了，你再也控制不住大哭起来。你恨你自己，为什么这么弱小，甚至还不如十厘米的小人偶!你边哭边捶打着自己的腿，希望能用疼痛唤醒腿上的知觉，可是你连疼都没感觉到。\n在这时你似乎听到门口有什么人，但是并没有传来敲门声,静默了很久后脚步声又离开了。是谁?他为什么不敲门?难道是...是雪女吗?刚才在大厅中你看到她的瞬间就认了出来，是那个在法庭上做了伪证的女孩。为什么她也出现在这里?你想趁这个机会问个明白，但现在的你却什么都做不到。\n你终于哭累了，缓缓瘫倒在床边。阿泽还没回来，他去了很久了吧...正当你担心的时候，门轻轻打开了，阿泽回来了。他呼吸并不顺畅，头发衣服也有些凌乱。他看到你坐在地上后飞快的来到你的身边，将你一把抱起放在了床上。他边整理被子边说:“傻瓜，怎么哭了呢?是不是让你担心了。我这不是回来了。”\n你很想开口问他去做了什么?那个人怎么样了?但是你最终还是拽住他的衣角说:“阿泽，能不能留在这，陪陪我。”黑泽瞳轻轻点了点头，坐在了床旁，摸了摸你的头。\n不知是因为他陪着你的原因，还是你真的累了。你渐渐有了困意，阿泽轻握着你的手，轻轻说:“你安心睡吧，桃子，有我在，你别怕。”你听着他的话，进入了梦乡。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "找出真相",
      "Ability": ""
    },
    "木之本奈奈（雪女）": {
      "Story": "日记：2月13日 小雨\n“啪!\"的一声，电视被妈妈关掉了\n“就知道天天看电视!这都凌晨三点了,不睡觉等什么?等你爸回来吗?男人，不过都是些没有感情的动物!\n妈妈倒在沙发就睡着了，我拿了条毛毯，搭在她身上，她的浓妆没有清洗。我拿起茶几上的三周岁纪念照片，手上的烫伤清晰可见。\n那是我第一次尝试煲汤，我没有见过爸爸，妈妈更像是个需要照顾的孩子，而我只能和妈妈相依为命。\n我把她的高跟鞋脱掉，蹑手蹑脚的去妈妈的包里拿出了100日元,明天再给妈妈做鸡蛋汤吧，刚好这笔钱可以买2个鸡蛋。\n我拿着这笔钱，爬回床上，定好了早起的闹钟。\n3月29日\n这个叫小岛的男人似乎很喜欢我,跟我谈了一个合理的长期价格。这已经是他给我钱的第四个月了。\n他今天格外的开心。\n大晚上要带我兜风，风很大,开着开着，他的手机响了起来。\n接了十几秒后，他的表情变得严肃，他挂掉电话后，立刻调头，拐进了一个黑黑的巷子。\n突然，车头前面出现了一对母女，他猛踩油门，朝着她们撞了过去，“砰”的一声人影倒下了。\n我吓的不敢动“撞….....我.........你撞人了??\n他沉默不语，立刻把车倒了回去，再次压在了那两个人的身体上。我再也忍受不了准备跳车下去。\n他看了我一眼,冷冰冰的拍出了一沓美金,又拿出一把手枪,冷冷的说到“选\n我该怎么办，我该怎么办，我该怎么办.…\n4月2日\n开庭了，这起交通案件，作为当事人，我还是出席了。对不起，对不起，我真的很需要钱，我也真的怕死。\n对不起，我只是个初中女孩啊，在手枪面前我又能怎么选呢。\n“刹车坏了，不小心撞到了人，我可以作证。”说完，我只想了他安排好的替死鬼“是他，他是司机”\n我的眼睛无法正视那个被冤枉的男人，转头看向其他地方，看原告席，我看到了一个坐轮椅的女孩，她穿着白色的裙子，嘴唇发白，似乎很虚弱，但那双眼睛,那眼神充满怨恨与愤怒的看着我。\n她是那天活下来的小女孩吗?对不起,对不起，对不起......我无法正视她的脸，脸火辣辣地疼起来了。\n5月14日\n夏天快到了，我也来到新的城市,拿着那笔钱，来到这个城市最好的贵族中学读了一年，又顺着升上了贵族学校的高中部。\n再过两年就要高考了。\n我一定要努力学画画。\n看着我的手绘册，上面画满了美少女战士可我的脑海里总是闪过一些身影，那个昏暗的卷子，那个白裙子坐轮椅的女孩。\n我想当伸张正义的美少女战士，却最后变成了要被美少女战士所打倒的坏人...\n我在手绘册的最后一页一遍又一遍的写着对不起...可是对不起又有什么用呢，对那女孩有什么用呢…\n我不想再懦弱下去了，我要回去，哪怕不能为她伸张正义，我也要找到那个老男人，哪怕，让他多赔点钱，让那个女孩子过的好一点。可是，我去哪里找他呢?\n6月1日晴转多云\n今天是儿童节，可是妈妈要半夜才回来。\n我看着电视里的美少女战士,好喜欢她们,可以变身,可认拥有强大的能量。我默默地许下一个愿望\n“奈奈想变成美少女战士!!”\n6月8日多云\n终于联系了嘉美，或许能从她嘴里打听到那个男人的消息。过了很久，我收到了一条信息“稻荷神社”\n或许这里，能找到我想要的答案。\n不管了，不论怎样，我都要找到那个人。\n我带着简单的行李，朝着稻荷神社的方向走过去。\n既然来到了神社,还是许个愿吧。我对着神社许愿到:希望能找到那个男人，帮那个女孩讨回公道。\n接着在这没有目的的找着那个男人。刚走到一棵大树旁,突然窜出来一个穿红衣服的巫女，她盯着我，嘴里缓缓地吐出句话“去狐狸旅馆吧，那里有你要的答案。\n她是谁?我该听她的吗?\n这里是哪里，狐狸旅馆是什么地方?可是现在好像也没有别的选择呢!不管了，再差也差不到哪里去了。我握着手里的美少女战士的挂饰\n“对不起，这次，我一定鼓起勇气替你讨回公道!”\n8月12日\n新学期的学费越来越贵了，而我也没有脸，再去问邻居要钱了。可是兼职的钱也不够补，看着黑板上的数字，我读怎么办。\n我坐在搂道里抽烟，不知该怎么办，如果不上学,我就学不了画画了，脑海里全是美少女战士手绘图，我也想学画画，我想上学,哪怕是在这了最差的初中中学。\n嘉美走过来，她今天的烟熏妆格外浓。吐着烟圈对我说“缺钱了么，想要来钱快的方法么”\n我抬起头，她眼神里全是不屑，趴在我耳边说“陪酒，一晚上，10000日元，做的好，一晚上就能拿不少”\n我看着她，10000日元,那我就可以买最全色号的马克笔了。”我握住了拳头，冲她点了点头。\n晚上,我跟着她来到一家酒吧,乌烟瘴气的氛围。口哨声,吵架声,呻吟声…直到我看一个肥头大耳的叔叔，他走过来，眯着眼打量着我粗厚的手掌，在我身上游走，拿出一沓日元，拍在桌子上。\n那是我要的!于是，我走进了他的房间……\n8月13日晴\n今天听到美裕子要去上学了，她是我的邻居。大声的喊着“这个书包好丑!我不要”\n我羡慕地拾起她扔的那个书包，想偷偷的拿回去，书包上是我最爱看的美少女战士。美裕子的妈妈走了过来。“奈奈，你想上学吗”\n听到这句话，我忍不住地哭出声，一边抽泣一边点头。\n在这个贫民窟，大家都知道我没有爸爸。我妈妈是陪酒女,而他们没有人弃我，反而一直在照顾我。\n美裕子妈妈给了我一个新书包，还帮我交了学费，我终于可以上学啦!\n9月7日多云\n今天是我第一天来初中学校报道。\n我选择坐在角落里,手上的伤又开始疼了那晚妈妈回来,收拾好所有的行李，我问她去哪里。\n她摸了摸我的头，给了我一个信封。\n我打开后里面是600日元和一封信:奈奈，你要照顾好自己啊，妈妈也需要人照顾。\n她要离开我了，我哭喊着抢掉她手里的行李。妈妈…\n门口出现了一个男人，他头发已经有些秃,佝偻着腰。他冲上来一把推开我，拉起妈妈就走了。\n我永远也不会忘记，我诟着妈妈的衣角，求她不要抛弃我，而她头也不回地上了那个男人的车。我手上的伤也开始疼了。\n从此以后，我知道，我再也没有哪怕一点点的生活费了。而以后，我要自己生活了。\n加油奈奈!!!\n10月3日小雨\n大家都不.喜欢我，我没有朋友，不过我不在乎，我没有课余生活。\n最近好多复习资料要买，只能再找一份工作了。这样，白天洗盘子，晚上再去做手工，可以把下学期学费先交了。\n我已经离她们远远的了，为什么她们这要欺负我?她们把我围在女厕所，拽我的头发，嘴里骂着我是个没人要的野孩子。\n她们把烟头烫在我身上，朝我吐口水，直到她们笑累了骂累了、打累了，终于走了。\n为什么我已经这么卑微了，还要被欺负?只是因为我和她们不一样么?\n好羡慕她们，可以保护自己。还可以欺负别人。而我，我不想再被欺负了!我也要变成她们的样子。\n12月20日大雪\n生活对于我来说，已经是个行尸走肉的容器。一到放学时间,我的手机会不停响起,而我，要选择其中一个号码接听。\n那是我生活费的来源。\n而我除了马克笔,还拥有了新的名牌衣服、名牌包包，全套美少女战士的模\n今晚我遇见了一个男人，他两鬓斑白，大腹便便，一身名牌，不苟言笑。他是个公司的老总，据说还是什么有名的会长。做些我也不明白的生意。他的豪车停在我面前，我犹豫了片刻..\n",
      "Script": "看完日记的你们撇了很久的神,接着缓缓地合上了日记本。此时你们眼睛一晃，再次定神时你们发现眼前依然是你们熟悉的旅馆，但却有些许不同。\n没有了迷你尺寸的家具,没有了挚爱的鬼丸，没有被冰封的房间，没有一整面墙的案件笔记，没有了菜刀和料理大全，也没有了熟悉的妖怪牌。每个房间都差不多，有点破旧，有点普通。你们轻轻的走出房门，来到了平时打牌的大厅。此时临近夜晚。\n(风一郎第一个到达了打牌的大厅)\n风一郎:好奇怪啊，总感觉哪里不对劲儿，但又说不上来。大家都去哪了?(此时一个身穿紧身连衣裙，带着些许风尘气的女子走了过来)\n阿玉:一郎!不对，你是我的一郎吧....你的耳朵和尾巴...哪去了?(风一郎走过去，轻轻的抚过阿玉的眼角，略带悲伤)\n风一郎:阿玉...你的尾巴和耳朵也...而且你，怎么突然间苍老了些许?(两人相互望着彼此，接着一个穿着高中校服的小太妹走了出来)\n雪姬:你们是.…老板娘?厨师哥哥?你们怎么变得...不一样了?\n(说着雪女抬头看了看自己的头顶，又想用力量制作小雪花，却发现什么都没了,乌云和力量都没了)\n阿玉、风一郎:你是...雪姬吗?\n(你不知自己该点头还是摇头，身后走来了一个西装墨镜的中年男人，一脸严肃)\n滑头鬼:雪姬?你是雪姬吗?你这头发颜色怎么是黄色的?你这裙子是不是太短了?\n雪姬:你是滑头鬼大人?!噗哈哈哈哈哈哈,你的头这么短还真让我不习惯呢。\n阿玉和风郎被雪姬这句话逗得都笑了起来,滑头鬼大人看着眼前的雪姬开朗的样子，嘴角不自觉的也挂了笑，宠溺的摸摸她的头\n此时的大厅虽然充斥着陌生的变化,但却还是像曾经的旅馆那样充满了欢笑和温暖，四人正在笑着打趣着对方，却看到一个坐在轮椅上的女孩，眼含悲伤，他身后站着的是一个穿着风衣带着格子帽的男人。男人缓缓的推着女孩来到大厅，欢笑戛然而止，整个大厅都陷入了沉默。\n阿玉:优子?小优子!你的...你的腿..(阿玉突然明白了什么，捂住脸蹲下啜泣起来)\n风一郎:小子，你是天狗吧?这到底是怎么回事?我们怎么都成了这样?风一郎说完后过去安抚悲伤的阿玉,滑头鬼大人走上前不可置信的看着优子滑头鬼:你是.优子?你，多少岁了?我为什么对你如此...熟悉?你的腿又是怎么回事?\n优子低着头不说话，身后的大天狗走过去帮她整了整盖在腿上的毯子大天狗:你们先别问了...优子..优子她自己也很难受啊。我现在，连个能带她飞的翅膀都没了，我真的成了个废物。\n此时的大厅已经没有了欢乐。有的只是压抑和悲伤。小暖:大家..想吃饼干吗?\n所有人都抬起了头,看着出现在自己面前的小暖，一身红色的巫女服和红色的头发，还是像个小太阳一样温暖。\n雪姬:小暖，是你叫我们来这里的吧?这到底是怎么回事?_\n小暖挠了挠头，正想开口说些什么，从另一边走廊出现了一个穿着一身名牌的胖子，走近一看，他头发花白，脸上布满皱纹\n雪姬:是你!(眼前这个男人就是当年那个用枪逼你撒谎的恶魔，不过两年，他老的可真快)\n男人看着你们，眼神阴狠，面带疑惑\nNPC:你们?你们怎么会在这?而且怎么..怎么可能呢?不可能啊?\n男人正在思考些什么,阿玉突然冲到这个男人面前举起手想要打这个陌生的男人，却被男人身形一闪，接着反手一掌，只听迢的声，阿玉白皙的脸上就出现了五个红指印。接着男人转身抬起脚将阿玉踹倒，并连踢两脚\n风一郎:你给我住手!!!\n雪姬:你们!你们住手啊!\n风一郎喊着，冲过去一拳打在了男人的脸上。(男人阴狠的转身回给风郎一拳，两人扭打了起来。优子着急的想冲上去帮忙，却重重的从轮椅上摔了下来。大天狗赶紧抱起优子让她坐回轮椅)\n滑头鬼看了眼小脸都皱在一起的你，冲了上去拉开了两人，男人瞪了一眼你们，转身回了房间小暖:大家...那个...现在也挺晚了...不然先回房间休息--晚.明天起来，起来咱们再说?\n风一郎扶起阿玉回了房间，大天狗也推着优子走了。你看了一眼滑头鬼，他跟着你离开了大厅，只剩下小暖呆呆的一个人看着大厅中平时打牌的桌子发呆经过刚才的那场闹剧，大家也都累了，回到房间后你瘫坐在床上，心里久久不能平静。刚才那个轮椅上的女孩..你永远都忘不了当时法庭上那双眼睛，她望着你时的那个眼神。心里的愧疚就快要将你淹没了。还有那个男人，那个当时递给你一把枪和一沓钱让你选的那个男人，让你背上罪恶的那个该死的男人!\n你犹豫了很久，拿出你包里放着的那本画册。你看着那些美少女战士阳光开朗的笑容，代表正义时勇敢的身姿，还有最后一页，你这几年里写下的无数句对不起.你鼓起勇气起身出了房间，你下定决心要去找那个女孩解释当年的事，跟她说出去后就帮她澄清，承认当时你做了伪证，哪怕要负起法律责任也好，哪怕她骂你，打你，都可以。只要能帮她找回迟到的正义，只要她能原谅你。\n你走出房门，在拐角处碰到了个风衣男人，应该是...大天狗。你看到他气冲冲的走到了拐角处尽头，然后开门进去了。你发现他对面就是那个男人的房间。你犹豫了一下，要不要去找那个男人，但内心深处你还是惧怕着。怕那个黑黝黝的枪口和他阴狠的眼神。定了定神你向前走了几步来到了那个女孩的门口，你正想敲门却听到了里面传来了哭泣的声音。你停住了敲门的手,轻轻的贴在门上想听听她怎么了。\n你听到里面女孩绝望的哭着，边哭边捶打着什么东西，崩溃的喊着:“为什么!为什么是我!为什么我是个废物!!!我什么都做不到...鲸鱼，妈妈，自己...我什么都做不好..什么都保护不了..”你愣住了，现在是不是...不该进去..你刚刚鼓起的勇气瞬间就丧失殆尽。你像个逃兵样的逃回了自己的房间。\n回到房间后的你立刻钻进被子,用枕头捂住自己的头，似乎这样能够给你安全感。你回忆刚才听到的话，后悔，愧攘，害怕。你的心中五味杂陈，你懊悔的想明明都鼓起勇气了为什么又逃跑了..要是冲进去安慰她多好，要是能把想好的事情告诉她该多好...但是无论如何你都再也无法抬起脚去那个刚才你逃离的地方。你恨这样懦弱胆小的自己，你把自己用被子裹起来，抱着腿轻轻的啜泣着。\n也不知过了多久,你听到阵轻轻的敲门声。你走过去打开门,发现是滑头鬼。他看你的眼眶通红，就问:“你怎么哭了?”你看到他关切的眼神，不由自主的崩溃了。你再也无法控制的大哭起来。滑头鬼看着这样的你手足无措，慌手慌脚的从他的兜里拿出了一个老气的手帕递给你，说:“别哭了别哭了，有什么委屈说出来就好了。”你拿过这个手帕却没有擦眼泪，反而噗榔一声笑了出来:“什么年代了还随身带着手帕，大叔你真的很过时哦。”\n滑头鬼看着你稳定了心情,就拉着你坐在床边让你说说为什么哭。你犹豫了很久说:“我做了一件对不起别人的错事。这件事折磨了我很久很久，从那之后我的人生就只剩下了愧疚。我想向她道歉，想要弥补错误，可是却没有勇气面对她。”滑头鬼认真的看着你，摸了摸你的头说:“虽然不知道你经历了什么，但是看你的样子不过就是个中学生吧。做错了事不怕，谁都有做错事的时候。只要能意识到错误，无论对方是否原谅你，都尽自己的全力去弥补，以后的日子都不会那么难过的。你只是有点害怕，小女孩不那么勇敢也没关系。再给自己点时间,好好地跟自己聊聊。如果现在还没准备好，就好好睡一觉，等明天太阳出来，在鼓起勇气试一试吧!只是以后少哭一点，红眼睛像个兔子，都不好看了。”\n你点点头，把他的手帕递回去说:“这个我不需要了，以后我不会在哭了。”说完后乖乖钻进了被子里。\n他看你躺下后轻轻的离开了。你闭上眼睛,感觉那片笼罩在你心尖的乌云似乎散了点，要是明天太阳出来了，阳光会不会真的能够穿透心中的乌云呢?想着想着...你沉沉的进入了梦乡。\n",
      "Relationship": "你的Relationship在Story和Script中均有提及。",
      "Performance": "你应该根据你的Story和Script表现自己，融入你所扮演的角色设定，以该角色设定的口吻进行对话。",
      "Purpose": "找出真相",
      "Ability": ""
    }
  },
  "show": "【神明大人驾到】\n一阵烟雾过后，从神域入口处出现了一个挺着大肚子，带着高高帽的身影，身旁有一只狐狸和一只狸猫手持蒲扇为他使劲扇着风。\n神使（故意的使劲儿扇风，扇的越大越好）\n稻荷神大人（微笑，把披风往后一撩，回头对狐狸小声说，轻点扇行不行！然后用正统的跪坐或正襟危坐在正位上）：吾，乃是京都地区所供奉的主神，稻荷神是也。（点头微笑）\n神使：鼓掌欢迎啊！（更加用力扇风）\n稻荷神大人：（先挥手示意大家停止鼓掌，回头怒吼狐狸，让你轻点扇听不见啊！）：吾近日下来所谓之事，便是寻一个新的神使随吾回到神域去接任我身后这一个（有狸猫就两个）笨蛋的。如你们所见，这两个家伙，五百年了，扇子都扇不好。吾终于忍到他们该退任了，吾心甚慰。让吾来看看，今天都是些什么人在这里啊？（扫视一圈，并看到桌上的妖怪牌），嗯，看起来都挺顺眼的。咦？你们也打这妖怪牌？正好，吾最近也喜欢上打这个妖怪牌，只是吾身后这两个笨蛋打的太烂了，吾从未体会过输的乐趣。既然如此，今日便用这妖怪牌来选神使吧（回头对狐狸小声说：这人太多了，要是我打不过怎么办啊。狐狸小声回：是啊，您的牌技那么....好，不如...让他们先打？）咳咳，吾这会身子有些乏了，先回房间休息片刻，你们七个人先打3局，决出3个胜利者后再到旁边的房间来与吾一决胜负吧！赢的人吾就带回去做新的神使了！（出房间）\n神使：呼，这胖子终于走了，你们是不知道啊，我们这五百年可真是受够了！打牌打得烂，输了还发脾气！真是难伺候极了！哎算了算了，反正我马上也退休了，我看看是哪个倒霉鬼接我的班上去给他扇扇子，有你们受的咯。行了，哎？你们桌上这妖怪牌都分好了呀，那就一人那一摞开始吧，他不打的话多的这一份先放着吧，给你们增加难度。行了来吧，国际惯例，决出个倒霉蛋吧~黑白~~~\n稻荷神大人（假的哦，表现要粗鲁一些，跟前面的那个的行为动作区分开）：咳咳。\n神使：咦？大人，你怎么回来了？是不是听我们热闹您也想打一局啊？\n稻荷神大人（点点头，不说话，粗鲁的坐下，拿起桌上最后一摞牌）：开始吧。\n阿玉：大人也要下场吗？那就让大人先开始吧\n稻荷神大人：行吧~那还是要选个倒霉蛋出来（看向左手边的大天狗），就你了，倒霉蛋。（把多余的两张给他）\n大天狗：那就是我第一个出牌对吧!好的!（抽出 姑获盖牌对滑头鬼说）这张是获鸟!你信不信？\n滑头鬼：哼！狡猾的天狗！你说得我一个字也不会信，我不信！（看完牌后收入手中，假装思考了一番）\n滑头鬼：（拿出手牌里的姑获鸟盖住，对小暖说）姑获鸟，小姑娘？\n小暖：我信噢!滑头鬼叔叔!（接牌看牌，看过后把牌放进自己的手牌中洗一洗）\n小暖：嘿嘿嘿~一对姑获鸟（拿出一对姑获鸟打出来）\n小暖：（再从手中拿出赤舌递给阿玉并说）阿玉姐姐！我这张是河童！不骗姐姐噢！\n阿玉：小暖说的~姐姐当然是~~~~~不信啦~~（接过小暖出的牌并放进自己的手牌里)）\n阿玉：小机灵鬼~~一对赤舌~（打出2张赤舌）\n阿玉：（从手牌中拿出山童对风一郎说）一郎啊~我这张是山童哦~~\n风一郎：我们阿玉说的！我当然信啦！我信！（拿过牌看一眼，放进手牌里）\n风一郎：（打出3张山童，开始思考一番）恩~我出3张山童！\n风一郎：然后我给优子的···那就这个吧！（从手牌中抽出姑获鸟向优子说）姑获鸟！\n优子：风一郎哥哥最会骗人了！我才不信你~~（拿过风一郎打出的手牌查看，然后哼！鼓气~）\n优子：（将牌放进自己的手牌中，拿出河童对雪姬说）那我出的是~！河童！\n雪姬：我信（拿牌查看后放进自己的手牌）\n雪姬：一对合同。（打出一对河童）\n雪姬：（拿出一张【河童】向下盖住，问稻荷神）大人，我这张是座敷童子！\n雪姬：（转头小声地偷偷问优子）我可以说跟卡面不同的么？\n优子：（偷偷的说）当然可以的哦~,\n稻荷神大人和神使同时看对方，小声说：她好像不会打牌！\n稻荷神（小声)：那我是信还是不信呢...\n狐狸：不信不信，她肯定骗人的\n稻荷神：别啊，她都不会打，肯定应该信吧！（高兴地接过牌大声说）我信！（拿到牌后皱个眉头，把手牌放进手里，先将两张抽出来一点示意狐狸，狐狸摇头，在将三张抽出来示意狐狸，狐狸摇头，最后哪一张，狐狸点头。把这张抽出来盖住，对大天狗说）天狗，听好咯，这张啊，可是！可是！（痛苦的颤抖，手捂心脏，倒下）\n神使：卡密萨马！卡密萨马你怎么了！（上去晃一晃）。不好了！卡尼萨马没气了！你们！！都给我放下手中的东西，立刻去隔壁！接受调查！（双手上下一挥）好了~现在我们来到了隔壁。（稻荷神大人这会可以起来说，稻荷神大人的尸体就放在隔壁，我是狸猫使者）\n狐狸（很凶）：怎么回事！\n狸猫（更凶）：怎么回事！我们稻荷神大人在天上好好地，白胖白胖的活了几千年了，怎么到你们这打了把牌就没气了！（狐狸：就是！）你们这什么破旅馆！我现在就给卡密萨马的卡密萨马打电话！（狐狸：打电话！），让大大人降下一道神谕！将这个旅馆彻底毁灭！（狐狸：毁灭！）你们！全都给我死在这给我们大人陪葬！\n狐狸：陪葬！...等等等等！也不用全陪葬吧，毕竟咱们卡密萨马的卡密萨马还是讲道理的\n狸猫：讲道理吗？（回头看狐狸）\n狐狸：讲道理的！咳咳，你们几个，如果在两个小时内给我们交一个凶手出来的话，我们可以在这个旅馆被毁灭之前，偷偷把你们放跑！但是凶手我们就要带回神域接受审判了！\n狸猫：听到没！交一个凶手出来，还能让你们活命，但是这个旅馆！必须毁灭！还开旅馆，哼。"
}