{
    "Crew Member Han": {
        "Story": "Crew Member Han, full name Yimu Han, female, 25 years old. She joined the ship last September and is now a crew member on The Eastern Star. You have a strong curiosity and are known as the ship’s gossip. \nYou deeply despise Second Mate Liu. He often orders you around as if you were a servant, and you want to kill him. Tonight, you delivered a bottle of sulfuric acid to the warehouse for him. \nOn the wall of your room is a photo of Second Mate Liu, and you have a BB gun, which you use to shoot at his picture whenever you're upset. You hide this photo under another poster. \nYou believe that Singer Lin and Second Mate Liu are having an affair. \nBefore joining the ship, you were a ballet dancer and took the job on the ship because you grew tired of life on stage.",
        "Script": "That afternoon, you were severely scolded by Qi Liu. He grabbed you by the collar and hit you on the head because you forgot to deliver something for him after the ship docked yesterday. You later reported this to Manager Xiu. \nAfterward, you angrily returned to your room and plotted to kill him. You poured sulfuric acid into a drink bottle that you had hidden in your room. \nAt 19:20, you brought the bottle to Qi Liu in the warehouse. He immediately chased you out after seeing you, so you left the bottle on the shelf and left. \nAt 19:30, while you were in your room browsing the internet, you saw a video that had just been uploaded. The video showed Second Mate Zhang being humiliated by a VVIP guest for giving them peanut ice cream despite their peanut allergy. Zhang had to kneel and apologize. After 20:00, due to the fireworks display, there were many passengers, so during this time, you were performing safety inspections on the ship's moving walkways.",
        "Relationship": "Qi Liu (Second Mate): You despise him. Ever since you started working on the ship, he has been bossing you around, using his title to command you like a servant. He often texts you to cook noodles, clean, or even wash his underwear. Lately, he has been asking you to deliver chocolates whenever the ship docks. \nManager Xiu (Bar Manager): You have a good impression of him and often chat with him. Sometimes, he also complains about Qi Liu with you. Once, after drinking, you told him you wanted to kill Qi Liu. \nSinger Lin: You suspect she is having an affair with Second Mate Liu and have given her the nickname 'Lin Magnet.' Lin found out about the nickname and, on May 6th, had a public argument with you because of it. \nCaptain Hong: On May 6th, after your argument with Singer Lin, the captain intervened and punished you for disturbing passengers and damaging the ship's reputation. He made you write a self-reflection letter, which you grudgingly handed in the next day. \nSecond Mate Zhang: You know he is the gun custodian, and there is a revolver in the control room. \nAt 20:30, you were informed that Qi Liu was found dead in the warehouse.",
        "Performance": "Qi Liu is a very strict person, and you feel no one likes him. \nAfter 20:00, due to the fireworks display, there were many passengers, and during this time, you were performing safety checks on the ship's moving walkways. \nAt 20:30, you were informed that Qi Liu had died in the warehouse.",
        "Purpose": "Collaborate with others to find the culprit while avoiding suspicion falling on you.",
        "Ability": "The culprit is the only one allowed to lie, but you cannot lie. However, you can withhold evidence that may implicate you."
    },
    "Captain Hong": {
        "Story": "Captain Hong, full name Zilian Hong, male, 38 years old. A graduate of the National Ocean University, he has worked on the ship for 12 years. After the previous captain died unexpectedly a year ago, you became the captain of The Eastern Star. You emphasize that you are the leader of everyone on board.\nYou know that Second Mate Zhang is responsible for managing the ship’s firearms, and nearly everyone knows that there is a revolver in the control room. \nYou also have a personal handgun and some bullets hidden in your room, used for protection during drug smuggling operations. \nRecently, you gave a necklace to Singer Lin. \nYou are addicted to smoking but can only use nicotine liquid for e-cigarettes on board.\nYou need to hide the fact that you are in a romantic relationship with Singer Lin and that you are secretly involved with the Korean gang, the Triads. You smuggle drugs aboard the ship, coordinating with the Triads and letting Qi Liu handle the transportation.",
        "Script": "18:40: You received a call from the restaurant reporting a major incident. When you arrived, you saw Second Mate Zhang kneeling before the ship’s VVIP guest, apologizing. The guest has a peanut allergy, and Zhang had mistakenly given her peanut ice cream. You immediately apologized alongside him and escorted him away. You reported the incident to the board of directors.\n19:40: You received a fax from the Triads with tarot cards showing the captain, secret deal, betrayal, meeting, port, and murder. You're not entirely sure what it means, but you suspect it's a warning from the Triads that they will kill you if you betray them. You decided to ask Qi Liu about it.\nYou hid the tarot cards in a locked box in the control room’s hidden compartment.\nAt 20:00, you saw Singer Lin returning to her room in her performance outfit, which seemed to be torn. \nFrom 20:00 to 20:15, you watched the fireworks on the deck. \nAround 20:15, you knew that Qi Liu would typically be in the warehouse organizing things before the ship docked, so you headed there. At 20:25, you arrived at the warehouse and found Qi Liu dead.",
        "Relationship": "Qi Liu (Second Mate): He is your junior from university. He was originally the Third Mate, but after former Captain Yang died a year ago, you were promoted to captain and promoted him to Second Mate. He also helps you smuggle drugs.\nManager Xiu (Bar Manager): He has been the manager of The Eastern Star for two years, but you don’t interact much with him.\nYimu Han (Crew Member): You saw her arguing with Singer Lin on May 6th, and you believe it negatively impacted passengers and the ship’s image, so you made her write a self-reflection letter. (If asked why you didn’t punish Singer Lin, you can say that since Singer Lin is directly under Manager Xiu, it would be his responsibility to discipline her.)\nSinger Lin (Bar Singer): She is a jazz singer and your lover. You call her 'Little Canary.' She doesn’t know about your drug-smuggling activities.\nSecond Mate Zhang: A graduate of the International Maritime Academy, he holds the highest qualifications on the ship. He resents Qi Liu's promotion and has submitted reports criticizing Qi Liu’s work, but you ignored them and discarded the reports.",
        "Performance": "Qi Liu is your junior from university, and out of loyalty, you have supported him.\nThe fireworks show started at 20:00, and after watching it, at 20:15, you remembered something you needed to discuss with Qi Liu. Knowing he would be in the warehouse before the ship docked, you went there and found his body. You are the first to discover the corpse.",
        "Purpose": "Collaborate with others to find the culprit while avoiding suspicion falling on you.",
        "Ability": "The culprit is the only one allowed to lie, but you cannot lie. However, you can withhold evidence that may implicate you."
    },
    "Singer Lin": {
        "Story": "Singer Lin, full name Ruotong Lin, female, 31 years old, has been working on the ship for 1 year. She is the exclusive jazz singer in the bar on The Eastern Star Cruise. You are very beautiful and attract everyone's attention.\nRecently, Captain Hong gave you a necklace.\nYou and Captain Hong are true lovers, but due to some reasons, you have been secretly dating Qi Liu recently, and it has happened three times already.",
        "Script": "At 19:45 on that day, you arranged to meet Qi Liu at the warehouse via a text message. You were wearing a performance outfit. When you arrived at the warehouse, Qi Liu rushed towards you and began tearing at your clothes, wanting to be intimate. In desperation, you took a hairpin from your head and stabbed it into Qi Liu’s back. While he was in pain, you quickly fled.\nAround 20:00, you returned to your room and changed out of the torn clothes. You were furious and terrified, then suddenly remembered that your lover, Captain Hong, had a private revolver. At 20:20, you sneaked into the captain’s cabin and stole his gun, hiding it in a bag in your wardrobe.\nAt 20:30, you were informed that Qi Liu had died.",
        "Relationship": "Qi Liu (First Mate): Qi Liu is one of your suitors. He gave you a branded handbag, but you don’t like him. Last year, you were in debt of 1 million yuan and unable to repay it. When Qi Liu found out, he offered to help repay the debt, but in return, he asked to go on 10 dates with you, which you agreed to and signed a dating contract. (The dates involve watching movies and having meals)\nCaptain Hong: He is your lover. He calls you 'Little Yellow Warbler' and doesn’t know about your secret dates with Qi Liu.\nSecond Mate Zhang: You know he is in charge of the guns, and there is a revolver in the wheelhouse.\nCrew Member Han: Recently, you learned she gave you a nickname, 'Magnet Lin,' which made you very angry. On May 6th, you publicly quarreled with her. The captain came and reprimanded her for disturbing the guests.\nManager Xiu: He is your direct supervisor. You know he enjoys drinking, especially foreign liquors.",
        "Performance": "Qi Liu often comes to the bar, so you only chat with him at the bar, as ordinary friends.\nSince there is a bar performance scheduled at 20:30, you spend this time in your room preparing for the upcoming performance.",
        "Purpose": "Collaborate with others to find the culprit while avoiding suspicion falling on you.",
        "Ability": "The culprit is the only one allowed to lie, but you cannot lie. However, you can withhold evidence that may implicate you."
    },
    "Manager Xiu": {
        "Story": "Manager Xiu, full name Renjie Xiu, male, 32 years old, has been working on the ship for 2 years as the bar manager of The Eastern Star Cruise.\nYou originally thought only Qi Liu and you were secretly transporting drugs, but now you feel there is another person involved, though you don’t know who.\nYou are the drug dealer on the ship, and the most important secret is that you killed Qi Liu.",
        "Script": "A year ago, through a friend of your father, you became the bar manager of The Eastern Star Cruise. Life on the ship made you long for a luxurious lifestyle. One day, you happened to meet your high school classmate Qi Liu, who was working as the Third Mate at the time. Not long after, Qi Liu proposed a secret deal, suggesting that smuggling drugs using the cruise would bring huge profits, and you accepted the offer. You began hiding drugs in firework boxes that you managed. Qi Liu would transfer 50,000 yuan to you every month. A year ago, the ship’s drug-smuggling operation was discovered by the former captain Yang Chenlin. Qi Liu killed Captain Yang and forced you to give false testimony, leading to his acquittal. You were terrified of Qi Liu, so you bought a revolver for self-defense. After Captain Yang’s death, Qi Liu was promoted to First Mate. Six months ago, Qi Liu suggested that privately selling the drugs smuggled would be more profitable, and asked you to hide the drugs in chocolates and deliver them. For the sake of money, you agreed. But two months ago, the drug orders significantly decreased. When you asked for the reason, Qi Liu ignored you. On the day of the incident, while chatting with Crew Member Han in your room, you learned that she had been helping Qi Liu deliver the chocolates. Feeling betrayed, you confronted Qi Liu and sent him a threatening text. That evening, Qi Liu came to your room with foreign liquor as an apology gift. Suspicious, you checked the bottle carefully and found needle marks on the cap. Pouring the liquor into a silver cup, you saw it turn black, realizing it was poisoned. Qi Liu intended to kill you like he had killed the previous captain. You decided to act first. You went to the wheelhouse, took a bullet from Second Mate Zhang’s revolver (everyone on the ship knows about the gun, and the key is in his drawer). Then, around 20:00 during the firework display, you slipped away unnoticed, ran to the warehouse where Qi Liu was, and saw him injured. You shot him. The sound of the gun was masked by the fireworks. After the murder, you returned to your room and loaded the bullet into the gun. You then hid the empty shell in a candle.\nAs you watched the candle solidify, you smiled triumphantly.",
        "Relationship": "Qi Liu (First Mate): He is your high school classmate and the leader of the drug smuggling operation on the ship.\nCaptain Hong: You don’t have much interaction with him.\nCrew Member Han: She has a good opinion of you and despises Qi Liu. You often drink together and badmouth Qi Liu. Once, when drunk, she revealed to you that she would kill Qi Liu if given the chance.\nSinger Lin: She works in your bar, and you are her direct supervisor.\nSecond Mate Zhang: You know he is in charge of the guns on the ship, and there is a revolver in the wheelhouse.",
        "Performance": "You and the deceased were high school classmates, which you only learned after joining the ship two years ago. From 20:00 to 20:25, there was a fireworks show outside, and guests were on the deck watching it. At 20:00, after preparing the fireworks, you returned to your room to rest. The fireworks show was arranged by the bar.",
        "Purpose": "Conceal the fact that you killed the victim and frame someone else for the crime.",
        "Ability": "You are the only person who can lie, and everyone else cannot lie."
    },
    "Second Mate Zhang": {
        "Story": "Second Mate Zhang, full name Wenyuan Zhang, male, 34 years old, graduated from the International Ocean Shipping University, has worked on ships for 7 years, and is the second mate on the Eastern Star. You are a direct subordinate of the victim. You are the most educated person on the ship.\nYou have great respect for the former captain Yang Chenlin, whom you see as a second father. When he died in an accident a year ago, you were very saddened, and you even posted the old captain's crew contact list on your desk.\nYou vape, so you have nicotine liquid in your drawer.\nEveryone knows that you are the ship's gun keeper. You keep the gun in a locked box in the wheelhouse, and the key is in your drawer.\nRecently, ammunition was distributed, and there are still 3 bullets unused.\nA few days ago, you texted Qi Liu, asking him why he was targeting you, but he denied it.\nYou have just received a report from the board, informing you that you have been fired because you offended a VVIP (the VVIP had a peanut allergy, and you served her peanut ice cream). This VVIP was someone Liu, the first mate, asked you to personally receive, and he was the one who told you to serve her the peanut ice cream.",
        "Script": "At 18:30, Qi Liu asked you to go to the restaurant to receive the VVIP. Since she was an extremely important client, he insisted that you personally attend to her and told you that she had ordered peanut ice cream, asking you to serve it. Since Qi Liu was your superior, you had no choice but to agree. Who would have thought that after the VVIP ate the ice cream, she flew into a rage, saying that she had informed you earlier about her peanut allergy. She demanded that you kneel and apologize in public. You complied, and later Captain Hong appeared, apologized along with you, and then took you away.\nAt 19:10, you received a fax in your office from the board stating that you were fired. You hid the report in your drawer and went up to the deck to watch the sea.\nAt 20:00, the fireworks show began, and the deck was full of passengers. You wanted to steer the Eastern Star one last time, so you returned to the wheelhouse. Until 20:30, you were informed that Qi Liu was found dead in the warehouse.",
        "Relationship": "Qi Liu (First Mate): You dislike him. A year ago, he was just the third mate, your subordinate. After the old captain's accident, when the original first mate, Hong, was promoted, Qi Liu was quickly promoted to first mate, becoming your direct superior. Qi Liu is arrogant towards you and constantly targets you, so you started investigating his mistakes at work. Recently, you discovered that Qi Liu had signed the warehouse inventory list himself, even though it should have been signed by the captain. You reported this to the captain.\nCaptain Hong Zilian: You are unhappy with him for promoting his junior, Qi Liu.\nCrew Member Han Yimu: You have no special interactions with her, but you know she is a busybody.\nManager Xiu Renjie: You have no special interactions with him, but you know he likes to drink.\nSinger Lin Ruotong: You have no special interactions with him.",
        "Performance": "You think Qi Liu is a lazy and careless person.\nFrom 20:00 to 20:25, you were in the wheelhouse watching the ship's navigation and reviewing business reports.",
        "Purpose": "Collaborate with others to find the culprit while avoiding suspicion falling on you.",
        "Ability": "The culprit is the only one allowed to lie, but you cannot lie. However, you can withhold evidence that may implicate you."
    }
}