{
    "Emerald Residence": [
        "Back in the day, Fan Jinkui was the foreman, leading the Li brothers to work for others. A Qiang, afraid of exhaustion, didn’t go. Later, the Li brothers had an accident and went missing. Fan Jinkui took a knife, claiming he would seek justice from the employer's superior. After that, A Qiang never saw Fan Jinkui again—until Fan's fiancée discovered his body. A Qiang is a regular at 'Emerald Residence'; he almost got taken to work by Fan back then, and thinking of it now still gives him cold sweats.",
        "Big-eyed A Kun has a friend named Li Zhu who was hired to transport goods by a nearby villa over ten years ago. When Li Zhu came to buy alcohol, he said the items the family had him carry smelled horrible, and he refused to do it for little pay! Big-eyed A Kun remembers that the young master of the Yao family once had them capture a thief named Zhang Decai and send him to jail. Big-eyed A Kun is a regular at 'Emerald Residence'; he heard that patients escaped from the Shanghai mental hospital, some of whom liked to impersonate doctors.",
        "'Emerald Residence' owner A Cui recalled a few days ago. She saw Di Zhu bring an outsider to 'White Frost Pavilion.' Di Zhu was very respectful. Uncle Gui arrived the day before yesterday to stay, and yesterday morning, he wandered around the village. Yesterday afternoon, Renyu Hu came to the tavern; upon hearing that Yao Changshou married Madam Hong, he smashed his wine bowl. A Cui is Madam Hong's sister; she remembers how Yao Changshou harassed her sister and almost fought with her fiancé, Fan Jinkui.",
        "A Da said his son definitely saw 'ghosts.' And not just one! First, there was an 'old man ghost' glowing all over, scaring his son to scream. Then someone came, and the 'old man ghost' hid in the bushes, frightening out venomous snakes. Later, a 'woman ghost' appeared, and the 'old man ghost' tried to strangle her from behind, but his son saw a light and ran away. The 'old man ghost' also hid back. A Da is a regular at 'Emerald Residence'; his son got lost in the woods before, and it was thanks to Young Master Yao Er who helped find him."
    ],
    "White Frost Pavilion": [
        "There are a few 'bellflower flowers' on the ground, and nearby a pit is emitting a pungent, rolling black smoke, making it impossible to approach for investigation."
    ],
    "Woods": [
        "Dead pigeons (the foot’s message tube is empty), and the woods are filled with pungent, rolling black smoke, making it impossible to approach for investigation."
    ],
    "Memory of Junmeng Chen": {
        "Torn Map": "When you were a child, you saw your father treating a 'torn map' as a treasure. Once, he sighed, saying: Yao Changshou's half surely marked the location. If only he had known it would be too deep to live beyond the third year, he would have dug it out long ago. You saw the servant Chen Shitian steal the 'torn map.' After he came to claim the silver you gave to the beggar, he was never seen again. The contents of the memory cannot be read by others; they can be retold or fabricated.",
        "Wuchang": "Your husband Yao Mengren mentioned more than once after marriage that he wanted to go to Wuchang, saying many unfilial things during the late Qing Dynasty. Your father-in-law, Yao Changshou, was very worried, fearing outsiders would hear. Yao Zhairen even sought her out before Madam Hong married in. If she was unwilling to marry, he would use that chance to send her to Wuchang and leave her there. The contents of the memory cannot be read by others; they can be retold or fabricated.",
        "Bellflower": "Your husband Yao Mengren insisted you wear a 'bellflower' at the wedding. And also 'Asparagus'. You found it hard to understand. He said it was what Sister Minyue said. They represent 'eternal love' and 'pure heart.' Sister Minyue is a very opinionated and independent woman, but unfortunately, he couldn’t put it on her himself. The contents of the memory cannot be read by others; they can be retold or fabricated.",
        "Special Magazine Handgun": "Your husband Yao Mengren always carries such a handgun. He says it's unique and has a great backstory: over ten years ago, Mr. Tang passed through 'Baili Village' with his daughter for lodging. They encountered bandits, and he led everyone in resisting them. After driving away the bandits, Mr. Tang gave this gun to Yao Changshou. Later, Yao Mengren took it back. The contents of the memory cannot be read by others; they can be retold or fabricated.",
        "Tunnel": "Your father kept an old newspaper featuring news about the butler Du encountering a ground collapse at a villa near 'Baili Village,' which led to his accidental death. Your father said that villa probably had a tunnel underground; a similar accident had occurred in the 'Baili Village' tunnel back then. The truth was covered up by Butler Du, and it could have been revenge. The contents of the memory cannot be read by others; they can be retold or fabricated.",
        "Balcony Railing": "Your husband Yao Xuren mentioned a secret about his mother, Madam Xu. When he was young, he saw his mother doing something on the balcony railing. Later, his mother became very afraid of the dark and wouldn’t dare turn off the lights until her death. You think he’s hiding something. When you asked him, he wouldn’t say. The third day, he took you back to your family home. That was the last time you spoke to him. The contents of the memory cannot be read by others; they can be retold or fabricated."
    },
    "Guest Room (Doctor Yu)": [
        "A 'special magazine handgun'★, with two bullets missing from the magazine, was found at Doctor Yu's guest room's balcony.",
        "Brother Yu: It has been three years since we parted in the capital. How have you been? I miss you greatly. Recently, a strange event has occurred in my family; you must be interested. Could you come to Suzhou for a visit and discuss this in person? A letter from 'Zhongyi Yao' with the address 'Yu Family, Jinshi Fang Street, Inside Fuchengmen, Beijing.'"
    ],
    "Servants' Room": [
        "A 'wooden cage' containing a white feather was found in Anqiao Chen's room."
    ],
    "Balcony": [
        "A 'green cloth' was found hanging on the broken railing, discovered on the second-floor balcony."
    ],
    "Miscellaneous Room (Rooftop)": [
        "'Blood-stained rags and other cleaning tools' that should have been stored in the second-floor storage room were found in the rooftop miscellaneous room."
    ],
    "Guest Room (Xu Boqing)": [
        "Bloodstains were found on the railing on the west side of the guest room's terrace, extending to the neighboring terrace (Di Zhu's guest room). The 'bloodstains' have already coagulated; note: the terrace railing is not high and was found on Xu Boqing's guest room terrace.",
        "Last year, a batch of 'Kaili rifles' was lost by the 'Jiangnan Manufacturing Bureau,' and the suspect, nicknamed 'White-headed Snake,' has been captured at a restaurant in Shanghai. 'White-headed Snake' revealed that there was an 'insider' in 'Baili Village' preparing to meet with a bandit nicknamed 'Golden Beard' for an arms deal. 'White-headed Snake' possessed a token from 'Golden Beard,' 'half a map'%, this item is now handed over to Lieutenant Xu Boqing of the Republic of China stationed in Jiangnan; please proceed to that location immediately, thoroughly investigate this matter, and capture the 'insider' and 'Golden Beard.' A 'confidential mission' assigned by Zheng Rucheng of Shanghai has been discovered in Xu Boqing's guest room.",
        "A 'golden longevity lock' with the character 'Meng' engraved on the back was found in Xu Boqing's guest room."
    ],
    "Guest Room (Ling Yun)": [
        "A handwritten 'note' stating, 'I will wait for you on the second-floor balcony tonight at midnight,' was found in Ling Yun's guest room.",
        "A 'special Hanyang rifle'◎, with one bullet missing from the magazine, was found in Ling Yun's guest room."
    ],
    "Guest Room (Renyu Hu)": [
        "A 'tablet' naming the deceased brothers Li Kuansheng and Li Guangsheng was found in Renyu Hu's guest room.",
        "'Two hundred taels of gold' and a 'Fa Lan ornament' (Fa Lan key) were found in Renyu Hu's guest room.",
        "A 'Ma Pai pistol'*, with one bullet missing from the magazine, was found in Renyu Hu's guest room."
    ],
    "Guest Room (Di Zhu)": [
        "A pair of 'sunglasses' was found in Di Zhu's guest room.",
        "A set of 'keys' (backup keys for upstairs) was found in Di Zhu's guest room.",
        "A box of 'matches' was found in Di Zhu's guest room."
    ],
    "Guest Room (Doctor Fang)": [
        "A 'torn map (upper part)' (with brown bloodstains) was found in Doctor Fang's guest room, hand-drawn on letter paper.",
        "A 'letter' written long ago, stating: 'Minyue: I made a fortune and will come to find you soon, then marry you. Zhang Decai.'",
        "A 'name tag' for Nurse Fang Minyue, Shanghai Zhabei West Hospital, was found in Doctor Fang's guest room."
    ],
    "First Floor (Old House)": [
        "'Boric acid solution' and 'golden tetracycline'—some agents were discarded and found in the old house (Junmeng Chen's room) on the first floor.",
        "A 'golden longevity lock' engraved with the character 'Meng' was found in the old house (Junmeng Chen's room) on the first floor."
    ],
    "First Floor (Kitchen)": [
        "A medicine bottle labeled 'Anshen' was found in the kitchen on the first floor; the bottle lacks further description."
    ],
    "First Floor (Zhongyi Yao's Room)": [
        "Someone came at night, fell down, and ran away. The child was scared. Junmeng. A 'jazz hat' containing a note (see above) was found in Zhongyi Yao's room on the first floor."
    ],
    "First Floor (Uncle Gui's Room)": [
        "An empty bottle of 'sedative' was found in Uncle Gui's room on the first floor, with ingredients including 'atropine.'",
        "An empty 'paper bag' was found nearby with burnt ashes in Uncle Gui's room on the first floor.",
        "A 'striped outfit' and a sharp 'surgical knife' were found in Uncle Gui's room on the first floor."
    ],
    "First Floor (Master Bedroom)": [
        "【Owner】Meng Shen.【Head Steward】Du Xinhui (deceased).【New Steward】Du Guicheng.【Assistant Steward】Fang Chengshan (missing).【Consultants】Yu Beichen, Tang Maoguang (left).【Employees】Yao Changshou (in charge of rent for 'Baili Village'), Chen Qingwu (in charge of Suzhou shops). A burnt 'list' of the members of 'Falange Trading Company' from 1900 was found in the master bedroom on the first floor.",
        "A 'Kaili rifle'◆, with no bullets inside, was found in the master bedroom on the first floor.",
        "【All three of us work for Master Meng. However, his steward Du only trusts those with the surname Fang; he entrusts all good things to him, it's too hateful...】【The Fang wants to return the things, how foolish! We can't let him do that even if it kills us...】【This time there's no turning back, but how could the body go missing? Could it be he didn't die...】【...He came to tell me he wants to go to Wuchang; that's a treasonous crime, the whole family would be executed. If he dares to go, I'll treat him as dead...】【I finally found the entrance; I must fix something above to prevent her from discovering it...】 A burnt 'paper,' with only a few lines legible, was found in the master bedroom on the first floor.",
        "A 'torn map (lower part)' was found in the master bedroom on the first floor, collected by Yao Changshou."
    ],
    "Scene (Body)": [
        "The body is located outside the window of Yao Changshou and Madam Hong's master bedroom. The deceased has a head injury (blood has coagulated), with a shocked expression on the face and an 8mm penetrating wound in the chest."
    ],
    "Scene (Bloodstains)": [
        "The deceased's 'white scarf' is stained with blood, with a small hole of 9mm. The ground has coagulated blood. The bloodstains start from the left side of the entrance door and extend all the way to outside Uncle Gui's room window, then to outside Yao Changshou and Madam Hong's master bedroom window, ultimately reaching the location of the body."
    ],
    "Scene (Ground)": [
        "Under the body lies a broken 'balcony railing,' the breakage itself has previously been patched, with a new bullet hole mark present."
    ]
    }    