{
    "Ling Yun": {
        "Story": "Ling Yun\nFemale. In her twenties. Short-haired with a spirited demeanor, wearing a light-colored deer leather jacket, long pants, and leather boots. Moves briskly, dislikes idle chatter.\nYou are a woman who acts based on mood, disliking constraints, having cut your long hair yourself and preferring to wear men's clothing. Born in Taiyuan, Shanxi. During the Qing Dynasty, your father, Liao Yiqiao, went to trade beyond the Great Wall, sending you, your brother, and your mother, Tang Wanfeng, to live with your uncle, Tang Maoguang, in Hangzhou—your uncle had previously led troops in the army, and you asked him to teach you shooting when you saw his firearms.\nYour father is now the president of the 'Shanxi Merchant Association' in the Republic of China, running the 'Liao Trading Company,' which deals in many foreign affairs and factories. Various people often come and go at the 'Liao Mansion.' After your father brought you back, he was busy with business and official duties, rarely returning home. You dislike this family environment and often make excuses to go out after reaching adulthood. The mansion is managed by the butler, Ren Grandpa (Ren Zhongyuan)—he practices martial arts, helps the weak with medicine, is upright, and once saved your father's life, earning respect from the Liao family.\nAmong the frequent guests is a young military officer named Xu Boqing, whom you have met a few times. He was transferred to Taiyuan after the Xinhai Revolution (1911) and is about to return to the south. You plan to visit your uncle in Hangzhou (having not seen him since your mother's death), and upon hearing this, Xu Boqing volunteers to be your 'flower protector'—though you’ve traveled far before and never needed protection, your father agreed to his request.\nBefore you set off, Xu Boqing receives a telegram from the army directing him to report to Suzhou, and seeing his dilemma, you offer to accompany him to Suzhou first—planning to continue alone to your uncle's house after he goes to the army.\n(On July 25) You arrive in Suzhou, staying at the 'Linchih Inn.' Xu Boqing urges you to wait for him—he will return in three days. You agree readily, but once he leaves, you head to Hangzhou.\nYour uncle's daughter (your cousin) is studying at a university in Shanghai and hasn't returned for the holidays; only your uncle is home. He is very happy to see you and gifts you a finely crafted 'Hanyang Rifle'—this rifle was 'test-manufactured,' with powerful gunpowder in its bullets and strong recoil, and it was never mass-produced. Your uncle warns you to use it carefully; when you ask if this gunpowder is expensive, he chuckles, saying, 'My old friend said it's more precious than gold...' You wrap the 'Hanyang Rifle' in a piece of blue cloth, and your uncle jokes that your hobby is boyish; if this were during the Qing, no one would dare marry you.\n(On July 28) A reporter from 'Shenbao' comes to visit your uncle, and you remember Xu Boqing should be done with his business by now. You bid farewell to your uncle—planning to surprise your cousin in Shanghai without letting your uncle tell her first. Back at 'Linchih Inn,' Xu Boqing still hasn't returned, so you explore Suzhou while waiting for him.",
        "Script": "Yesterday (August 2nd) afternoon,\nyou received a letter from 【Xu Boqing】, saying he was at the 【Yao】 family in 'Baili Village' and, due to his tasks, asked you to wait a few more days. 'Baili Village' is located between Suzhou and Shanghai; you would pass through on your way to Shanghai. You didn't actually need company and planned to meet 【Xu Boqing】 to let him know not to worry.\nYou hired a carriage to 'Baili Village'—there is only one road into the village. The 【Yao】 family residence is located in the northern part of the village, a western-style building with a terrace, backed by a forest.\nYou knocked on the big door, and a maid led you to the living room on the first floor, where you saw a 【beautifully made-up woman】 and two young men. You said you were looking for 【Xu Boqing】, and one of the young men took you upstairs—he is 【Yao】 family’s second son 【Zhongyi Yao】, and the 【beautifully made-up woman】 is his father's stepmother, 【Madam Hong】.\n【Xu Boqing】 was staying in a guest room on the second floor. He was inside wearing a “black jazz hat,” covering his face with a “white scarf,” and wearing “sunglasses.” When he saw you, he was both surprised and delighted. He took off his disguise, sent 【Zhongyi Yao】 out, and instructed him not to disturb you. You came here just to say goodbye, but he seemed to misunderstand something.\n【Xu Boqing】 whispered to you that “White-Headed Snake” mentioned that a “wanted dangerous person” would appear here, advising you not to go out alone— you didn't understand what “White-Headed Snake” or “Black-Headed Snake” meant, and you disliked his commanding tone. You told 【Xu Boqing】 you could help him, and he laughed heartily—you could see he didn't take your words seriously. You bid him farewell, saying you were going to Shanghai.\n【Xu Boqing】 frowned and said “Baili Village” can't compare to the city; there are no carriages out of the village in the afternoon, so you wouldn't be able to leave until tomorrow at the earliest. He suggested you stay here tonight. Then he called 【Zhongyi Yao】 to take you to your guest room.\n【Zhongyi Yao】 gave you the key to the guest room and escorted you inside. You set down your luggage and stayed in the guest room for a while before locking the door and leaving. You went for a walk in the village. Just as you entered the northern woods, you saw thick black smoke rising from deep within, along with flames. A “white bird” burst out from the smoke but fell not far outside the woods. A 【disheveled man】 ran out from inside. You asked him what happened, but he looked panicked and couldn't answer.\nYou saw a young man (whom you had just met in the living room) dragging a 【long-haired girl】 out of the woods, covering her mouth with his hand. You wanted to rescue her, but your “Hanyang rifle” was left in the guest room. If these two men were working together, how could you handle it without a weapon?\nSuddenly, the young man collapsed into the arms of the 【disheveled man】 and passed out. You supported the 【long-haired girl】 and saw that she was already unconscious.\n【Zhongyi Yao】 rushed into the woods, supporting the young man. He said the young man was his invited 【Doctor Yu】, and the unconscious 【long-haired girl】 was his sister-in-law 【Junmeng Chen】. The 【disheveled man】 introduced himself as 【Uncle Gui】, claiming to know some medicine and offering to help. 【Zhongyi Yao】 asked you to help carry 【Junmeng Chen】 into a clean bedroom on the first floor of the mansion (an old room). You noticed her pale, beautiful face, with tightly closed eyes and tear stains at the corners. 【Uncle Gui】 brought 【Madam Hong】 in with some medicine to examine her.\nSeeing you couldn't help, you left the room and encountered 【Xu Boqing】 in the hallway, wearing a “black jazz hat,” covering his face with a “white scarf,” and still wearing “sunglasses” inside the mansion. He told you not to speak first and led you upstairs to his guest room.\nYou asked 【Xu Boqing】 what he was playing at. He said he couldn't be recognized. Then he asked if you knew 【Junmeng Chen】. After you replied that you only knew the name, he sighed in relief. You ask him what’s in the woods behind the house? Xu Boqing sneers and says there’s the 'shame' of the Yao family buried there... Just as you want to press further, Xu Boqing suddenly grabs your hand and confesses: “Ling Yun, I actually fell in love with you the first time I saw you...”\nYou shake him off and warn him to watch his boundaries; you’re not even friends right now. You turn to leave, and Xu Boqing chases you to your guest room door. You push open the door (it’s unlocked). You return to your room and lock the door, noticing that the 'Hanyang rifle' inside has been tampered with, and the 'blue cloth' outside has been opened... You check your luggage; nothing is missing.\nLast night (August 2) at (22:20), someone slipped a handwritten 'note' under the door, saying: “I’ll wait for you on the second-floor balcony at midnight (23:00)” (unsigned).\nAt (23:00), you arrive at the balcony, this time bringing the loaded 'Hanyang rifle'—there’s only one person there, wearing a 'black fedora,' covering his face with a 'white scarf,' still wearing 'sunglasses' at night. You immediately recognize it’s Xu Boqing and ask, “What do you want?”\nHe gestures for you to be quiet and lowers his voice, saying smugly, “I know you came to 'Baili Village' to find me—tomorrow I’ll bring the things we agreed on—I’ll leave with you.”\n“I’ve changed my mind about our previous agreement,” you say, not wanting to continue this topic—you don’t need anyone’s company, especially not a “flower protector” with ulterior motives.\n“Changed your mind?” He seems agitated, “You don’t know, the situation with the troops has been exposed, 'White-headed Snake' is dead, and I’ll soon be implicated because of your family’s 'deal'—it’s okay, the 'deal' can be half price, as long as we leave together tomorrow!” You’re clueless about your father’s business dealings and never imagined they were connected to him and the military.\nSeeing you silent, he pulls out a “Quick Rifle” from behind and points it at you, saying, “Do you see this gun? At this point, either we leave together, or neither of us will leave!”\nYou see the weapon in his hand and immediately pull down the 'blue cloth,' raising the 'Hanyang rifle' to aim at him. He stubbornly says, “If you’re capable, shoot me now!” You don’t want to hurt him and aim for the balcony “railing” beside him, firing a shot. He’s scared back several steps, leaning against the “railing.” You drop a line: “I don’t want to see you again,” and return to your guest room.\nAt (23:10), you hear a thud from outside.\nAt (23:20), wanting to check, you push the door and feel it blocked. You grab the 'Hanyang rifle' and push the door again; this time it opens. You see only Xu Boqing, dressed in disguise, walking towards his room. You don’t want to talk to him again, close the door, and go back inside.\nAt (23:40), thinking Xu Boqing has returned to his room, you step out and see a figure flash by the stairs (you didn’t see clearly).\nAt (23:50), you follow the figure to the stairs and see a man on the first floor (the light is dim, and you can’t see his face) supportingJunmeng Chen, saying, “If anyone bullies you, I’ll take their life!” You remember Zhongyi Yao mentioned thatJunmeng Chen is his sister-in-law, so this man must be her brother. Not wanting to eavesdrop on their couple talk, you go upstairs to your room.\nAt (00:40), you hear a “bang” from outside, and you open the window, seeing someone at the door. Madam Hong peeks out, then brings a man into the house. You smile bitterly, close the window, and go back to bed to rest.\nThis morning (August 3), at dawn, you pack your luggage, wanting to check on the carriage. You leave your luggage and walk out the door, noticing blood stains on the ground, leading to the window of the master bedroom on the east side of the house. At the end of the blood trail lies a person on the ground.\nYou approach and see it’s Xu Boqing! His disguise is reduced to a blood-stained “white scarf.” You notice a wound on his head and a bloody hole in his chest; the blood has congealed, indicating he’s been dead for some time—looking up, you see the second-floor balcony where you shot last night; the railing is right above Xu Boqing’s body...\nYou hurry back to the living room to notify everyone that there’s been a death, knowing the true culprit must be hiding here since there were no carriages leaving the village last night...",
        "Relationship": "1. Xu Boqing: Deceased. In his twenties, he participated in the uprising in Wuchang, later assigned to Shanxi, often visiting your home. You guessed he disguised himself to come to 'Baili Village' to complete a mission from the army.\n2. Zhongyi Yao: The second young master of the Yao family, acquainted with Xu Boqing.\n3. Doctor Yu: The physician invited by Zhongyi Yao, who kidnappedJunmeng Chen from the woods.\n4. Madam Hong: The lady of the Yao family.\n5. Uncle Gui: You notice his wandering gaze, recalling Xu Boqing's mention of 'dangerous wanted individuals.'\n6.Junmeng Chen: Zhongyi Yao's sister-in-law, keeps her eyes closed; you don't know what happened to her.\n7. You are not familiar with other people at this time.",
        "Performance": "In this phase, you must act according to the following 'performances' while concealing the truth that has not been discovered by others:\n1. While exploring Suzhou, you encounter a military inspection of private firearms—luckily, they don't suspect women of carrying guns, strictly checking men only—previously, a smuggler of arms was executed on the spot.\n2. Conceal that you are carrying the 'Hanyang Rifle.'\n3. Xu Boqing informs you that there are no horse-drawn carriages leaving 'Baili Village' in the afternoon.\n4. You ask Doctor Yu why he kidnappedJunmeng Chen.\n5. You find Doctor Yu familiar, recalling having seen him come to the 'Liao Mansion' during the New Year to find Ren Grandpa.\n6. Conceal that Xu Boqing confessed to you and was rejected.",
        "Purpose": "1. Identify the true culprit.\n2. Prevent others from identifying you as the true culprit.\n3. Uncover the truth of the events that occurred yesterday (August 2) in the woods.\n4. Discover the 'dangerous individual' Xu Boqing mentioned.\n5. Identify the person who sneaked into your guest room yesterday afternoon.\n6. Find out the truth behind the 'transaction' you overheard last night.\n7. Conceal that you fired a gun on the balcony.",
        "Ability": "You can identify the following 'identifications' of firearms by model and caliber:\n1. 【*】 (Browning M1903, made in the USA) 9mm handgun bullets.\n2. 【◆】 (Produced by Jiangnan Arsenal, the first automatic firearm designed and manufactured in China) 8mm rifle bullets.\n3. 【◎】 (Marked with 'test-manufactured') 8mm rifle bullets. Your 'Hanyang Rifle.'\n4. 【★】 (Marked with 'test-manufactured', resembling a Mauser, with specially made bullets) 8mm handgun bullets."
    },
    "Zhongyi Yao": { 
        "Story": "Zhongyi Yao\nMale. In his early twenties. Short hair, fair complexion, and elegant demeanor. Speaks with a humble and polite tone. Never gets angry with the servants.\nYou are the illegitimate second son of [Yao Changshou], your mother [Zhang Yadi] is the handmaid of your father's first wife [Madam Xu], making you and your brother [Yao Mengren] (your legitimate elder brother) always inferior to them. The only person who sees you as equals is [Sister Minyue], who lives in the big house with you and has a good relationship with your cousin [Zhang Decai] (your mother's nephew, who lives with you). She even taught you and your brother about 'enlightenment thoughts'.\nYour only friend is named [Yu Junhong], whom you met over ten years ago (in 1900) when he came to 'Baili Village'. (In 1903), after your mother fell from the second-floor balcony and died, your father sent you to study in the capital, lodging at his home. Three years ago (in 1911), you received a letter saying your brother passed away; by then, [Madam Xu] had already died, and your father remarried [Madam Hong] as his second wife. After returning home, you stayed in 'Baili Village' and only corresponded with your friend through letters.\nYour father did not send your brother's remains to the ancestral grave, but buried him deep in the woods to the north of the village (where outsiders don't know how to enter): there is a patch of yellowing land with a two-story villa in the center, your brother's grave is to the east of the villa, built with bricks and stones, and the inscription reads 'Grave of the Unworthy Son Mengren of the Yao Family.' The main door of the villa is secured with a 'big lock' (the lock has blue and white painted decorations, and the keyhole is specially made with a flat mouth), and your father does not have the key; instead, he broke open the back wall of the villa and arranged for your brother's new wife [Junmeng Chen] to live there in mourning, sending someone daily to deliver meals—this is the first time you meet [Junmeng Chen]; she changed from her red wedding gown into mourning clothes, transforming from a bride into a widow.\nYou often go to the woods to look at [Junmeng Chen] from a distance. One day, you see her standing on the balcony releasing a white dove, her beautiful face pale and enchanting—your heart is deeply moved by this scene.\nAbout half a month ago, a mischievous child ran into the woods at night, and you found him; he kept babbling about seeing a 'ghost'—wherever that 'ghost' walked, there were no living creatures, not even venomous snakes dared to come... You notice that this place is not far from the villa and worry about [Junmeng Chen]; after sending the mischievous child away, you go to find her.\nYou see [Junmeng Chen] standing in front of the villa, holding an 'empty wooden cage', the moonlight falling on her, as if she were enveloped in a halo; at that moment, you sense something is wrong—it's July, and the temperature in the woods is much lower than outside, the surrounding insects have gone silent... Under the silent night, only you and she are breathing. You muster the courage to walk over, using the child's topic to converse with [Junmeng Chen] for the first time—she mentions she encountered the mischievous child surrounded by venomous snakes, and when she went to rescue him, the snakes all fled; she doesn't know why.\nYou immediately think of your friend [Yu Junhong]; he is knowledgeable and very enthusiastic. You assure [Junmeng Chen] that you will quickly uncover the truth of the matter—seeing [Junmeng Chen] smile, you feel an urge to embrace her, but her white mourning clothes remind you that she is your brother's widow!\nYou write to [Yu Junhong], inviting him to Suzhou to help you investigate the 'strange happenings'—you have a very bold idea: this year marks the third year of [Junmeng Chen]'s mourning for your brother, and once her mourning period ends, you can remarry her in place of your brother!\nThe next day, your father fell ill; [Madam Hong] invited a female Western doctor [Doctor Fang] to treat him, but you feel it is not effective—sometimes your father sits motionless on the bed, unable to speak clearly.\n(On August 1) A mysterious person wearing a 'black gentleman's hat', covering his face with a 'white scarf', and wearing sunglasses came to your home looking for you. Upon seeing you, he removed his disguise—surprisingly, it is your brother [Yao Mengren].\nYour brother takes you to the guest room on the second floor, informing you that he is now posing as a Republic military officer [Xu Boqing], assigned to 'Baili Village' for official business, only staying home for a few days—he warns you not to disclose his identity—if anyone asks, just say he is [Yao]'s 'debtor'.\nYou inform him that [Junmeng Chen] is in mourning for him, and he mutters to himself, 'I have already sent her home, why has she come back...?' You were about to inquire about the events from three years ago, but he asks if your father is sick. After you nod, he says, 'A curse—this is a curse! I warned him long ago...'\nYou cannot imagine what [Junmeng Chen] would do upon learning that your brother is alive—at that moment, you receive a telegram, revealing that [Yu Junhong] has already arrived in Suzhou, waiting for you to meet him.", 
        "Script": "Yesterday (August 2nd) afternoon\nElder brother asked you to deliver a 'letter' to the 'Linchike Inn' in Suzhou, coincidentally【Renyu Hu】 is staying there. After you deliver the 'letter' to the inn, you meet up with your friend and take a horse-drawn carriage back to 'Baili Village'.\nOn the way, you chat about stories from all over, from the late Qing Dynasty to the Republic of China. Just as you are enjoying the conversation,【Renyu Hu】 suddenly asks about that 'strange event'—after elder brother returned, the 'strange events' around【Junmeng Chen】 no longer concern you, so you can only explain to your friend: 'When I wrote to Brother Yu, I indeed wanted to invite him to investigate the 'strange event'—I didn't expect it to be a 'curse'...' You use 'curse' to describe elder brother's return, then say: 'I have a request that may not be appropriate; Brother Yu must agree!'\nYou mention your family's situation to【Renyu Hu】, wanting him to play the role of a 'doctor' who has returned from overseas, under the guise of checking on a patient, to privately ask your sick father about something. 【Renyu Hu】 is curious about what the matter is. You clench your fist and say: 'How did my elder brother Yao Mengren really 'die'!'\nAfter the carriage arrives at 'Baili Village', you take your friend to a second-floor guest room (you prepare a room with a low balcony railing for him). After settling in, you go down to the first-floor living room to see【Madam Hong】—she is talking with【Doctor Fang】, who leaves when he sees you come in—taking the opportunity, you introduce your friend (Doctor Yu) to【Madam Hong】 as planned.\nWhile【Madam Hong】 is talking with【Renyu Hu】,【Junmeng Chen】's maid【Anqiao Chen】 comes in with a short-haired woman carrying luggage. She says she is looking for【Xu Boqing】. You immediately take her to elder brother's room on the second floor—while going upstairs, you exchange names and learn her name is【Ling Yun】.\nWhen【Xu Boqing】 sees【Ling Yun】, he is very happy and tells you to leave—you're unsure what they talk about in the room, but you hear elder brother's laughter, and then he asks you to send【Ling Yun】 to a guest room on the second floor to settle down.\nThe guest room key is in the main bedroom on the first floor; when you grab the key, you see your father lying on the bed, his chest rising and falling. You hurry to grab medicine (only you,【Madam Hong】, and【Doctor Fang】 have keys to the locked medicine cabinet, and you see the cabinet door is open). The floor-to-ceiling windows in the room are draped with heavy curtains, one of which has been pulled back—you don't pay much attention, find the key, and take【Ling Yun】 to the guest room closest to the second-floor balcony. Then you go to ask elder brother who this woman is? Elder brother says: 'She will be Xu Boqing's wife.' You immediately ask what should happen to【Junmeng Chen】, who is still in mourning?\nElder brother casually replies: 'I didn't expect her to come back—it's already the Republic; what mourning is there to keep... wait until her mourning period is over, and then remind her to marry someone else.' You are both surprised and delighted, but seeing elder brother seeking a new love, a sense of unease rises in your heart...\nYou want to see【Junmeng Chen】, but you're unsure if you should reveal the truth. After hesitating several times, you finally walk to the edge of the woods, where you see thick black smoke rising from deep in the forest, along with firelight. A【disheveled man】 at the edge of the woods grabs the injured and unconscious【Renyu Hu】. You rush over to support your friend, explaining your identity, at which point you see【Ling Yun】 supporting the already unconscious【Junmeng Chen】.\nThe【disheveled man】 introduces himself as【Uncle Gui】, claiming to know some medicine and wanting to help. You don’t have time to think much and ask【Ling Yun】 to help carry【Junmeng Chen】 into the old house on the first floor of the manor (which used to be elder brother's bedroom), while you assist【Renyu Hu】 to the second-floor guest room. Soon【Uncle Gui】 comes up to help treat【Renyu Hu】's arm injury; at this point,【Renyu Hu】 wakes up, and you bring him water, continually thanking【Uncle Gui】. He gives【Renyu Hu】 water mixed with medicine (you think it's to help your friend recover), and【Renyu Hu】 falls into a deep sleep.\n【Uncle Gui】 tells you about【Junmeng Chen】's condition—her eyesight is affected by toxins, and he has already applied medicine to her eyes. She shouldn't open her eyes for the next few days and just needs a few more rounds of medication to be fine. After【Uncle Gui】 leaves, you notice【Renyu Hu】's breathing is unsteady, so you stay to accompany him until his breathing normalizes, then feel relieved.\nBy this time, it has turned dark; you go to check on【Junmeng Chen】—she is with her eyes closed. You gently greet her, and she asks you to take her to the main bedroom to see your father.\nYou support her hand to the main bedroom, where you see【Madam Hong】 and【Uncle Gui】. At this moment, your father is agitated, struggling to get up from bed, saying: 'My Mengren has come back... I saw him...\nThe lamp in【Madam Hong】's hand falls to the ground, the flame flares up, and your father tears open his 'diary' (the content inside, you have never seen), tossing it into the fire. 【Uncle Gui】 steps in to extinguish it like he's seen a ghost. No one speaks, only【Yao Changshou】 looks at the 'burned paper' saying: 'I found it... you can't take it away from me...'【Junmeng Chen】 starts to cry, and【Uncle Gui】 asks you to take her back, reminding you to change her medication again tonight. You help her back to her room to change the medicine, seeing the tear stains at the corners of her eyes, suddenly feeling resentment towards elder brother. But thinking that once elder brother leaves with【Ling Yun】, you can officially marry her after her mourning period, you feel happy again—when【Junmeng Chen】 asks about what father said, you reply that father is very ill and starting to talk nonsense.\nLast night (August 2nd) at\n(21:50) you go to the kitchen to find food for【Renyu Hu】, who hasn’t eaten dinner. You see a plate of 'Taihu silver fish' (this is【Madam Hong】's specialty), and take it out on a tray. \n(22:00) You walk up to the second floor, and elder brother opens the door to his guest room. He is holding the 'black jazz hat,' 'white scarf,' and 'sunglasses' he used for disguise, and you know he acts on a whim, which makes you a bit worried. Elder brother asks you to go to the rooftop terrace (after you go up, you put down the fish), and he follows you, throwing the 'three disguises' off the terrace in front of you, then says, 'I'm done! What kind of Republic soldier am I? Investigating what criminals? This is all meaningless. Ling Yun can't see my intentions; why should I still act as Xu Boqing!' You immediately ask if he intends to come back?\n'Of course! Let Xu Boqing go to hell!' elder brother says viciously, 'I want to be Yao Mengren again, and then punish that woman who talks about mourning and being honest with me, yet is still 'fooling around' outside...' You can't help but retort, 'How can you say that about her!' 'Less nonsense! You're just a concubine's child, and you dare to interfere with my affairs! I have evidence!' He kicks you down and continues to beat you—just like when you were young.\nBut you are no longer the【Zhongyi Yao】 of the past. As you resist him, you pull out a 'handgun' from his waist. He sees it and starts laughing: 'If you have the guts, shoot me here!' He points to his forehead and even helps you take off the gun's safety, then leans against the terrace edge, mocking you: 'Zhongyi Yao! You and your mother are my Yao family's servants, lowly beings...' His words make you doubt he is a soldier of the new era; how can he embody any semblance of equality in this time!\n(22:30) You want to warn elder brother, lifting the gun and pulling the trigger. Unexpectedly, the recoil is so strong it almost makes you fall—elder brother tilts back, letting out a scream as he falls off the terrace. Your hands are still trembling as you muster enough strength to throw the 'handgun' off the terrace, then collapse to the ground. The gunshot leaves you momentarily deaf, blocking your ears as elder brother's voice calling your name echoes in your mind.\n(23:00) Your hearing finally returns, and you look down from the terrace: elder brother's body lies on the west side terrace of the second floor, blood pouring from his chest, staining the terrace red—at this moment, your heart is surprisingly calm, only filled with fatigue after the shock.\n(23:10) You see【Renyu Hu】coming out of his room at the bottom of the terrace stairs; recalling that you wanted to find him and bring him food, you return to the terrace to pick up the 'Taihu silver fish.' \n(23:20) You knock on【Renyu Hu】's door and ask, 'Brother Yu, are you back?' There is no response from inside, so you place the 'Taihu silver fish' outside his door and head downstairs.\n(23:30) You return to your own room and hear someone ask, 'What time is it?' The voice is very close. You open the door a crack and see【Madam Hong】, flushed, coming out of【Uncle Gui】's room.\n(23:50) Unsure if your friend has returned, you head upstairs again, noticing elder brother's 'black jazz hat' on the floor at the entrance of the second-floor storage room. You pick it up and run back to your room, feeling a surge of panic.\n(00:10) You really want to see【Junmeng Chen】, so you go to the old house on the first floor, finding your beloved sitting on the bed, wearing a new 'ornament' around her neck. You ask her how her eyes are, but she doesn't answer and suddenly asks you, 'Is there anyone else in the room?' After looking around, you tell her no. She shakes her head and says, 'I met your elder brother...' This sentence feels like a bolt from the blue, and you hurriedly say, 'Impossible! He is dead—I saw it with my own eyes!' Then you turn and run out.\n(00:20) You hide back in your room, unable to sleep, recalling that your father's medicine had calming effects. You go to the main bedroom to get some. At this time,【Madam Hong】is not in the room, and your father is sleeping soundly. You find that the cabinet is already empty of medicine. You search the bedroom thoroughly but find nothing.\n(00:50) Disappointed, you return to your room. The moment you close the door, you see【Madam Hong】bringing a man into the main bedroom. You've encountered too many unexpected situations tonight and finally feel exhausted, drifting into a deep sleep.\nToday (August 3rd) morning\nYou are plagued by nightmares, struggling until dawn. You knock on【Renyu Hu】's door, and when he opens it, you lead him to the living room—you suspect that elder brother's body has been discovered—【Ling Yun】 said that the carriage didn't leave the village last night; the real culprit must still be hiding here...", 
        "Relationship": "1. Yao Mengren: Your half-brother, disguised as [Xu Boqing], whom you shot down from the rooftop.\n2.Junmeng Chen: [Yao Mengren]'s wife, your beloved.\n3. Yu Junhong: Your friend, whom you initially invited to investigate the strange happenings surrounding [Junmeng Chen], now you ask him to pretend to be the overseas [Doctor Yu], seeking the opportunity to uncover the truth about your brother's 'death' from years ago.\n4. Madam Hong: [Yao Changshou]'s second wife, with whom you have little interaction.\n5. Yao Changshou: Your father, the wealthy landlord of 'Baili Village', now bedridden due to illness.\n6. You currently do not know the other characters.", 
        "Performance": "In the following 'performance', you must do the following at this stage while concealing the truth that has not been discovered by others:\n1. [Yu Junhong] is the physician you invited back from overseas (you can mention some experiences that won't raise suspicion).\n2. The door of the guest room can be locked from inside; aside from one key given to the guests (you arrange accommodations and always give them the room key), there is also a set of 'spare keys' in the master bedroom on the first floor.\n3. You do not know [Xu Boqing]; he claims to be the 'debtor' of the [Yao] family. You plan to arrange for him to meet your father (but your father seems a bit delirious lately), hence leading him to stay in the guest room on the second floor.\n4. You are unaware of the family's plans to sell the land.", 
        "Purpose": "1. To prevent others from identifying you as the real culprit.\n2. To prevent others from discovering that [Xu Boqing] is actually [Yao Mengren].\n3. To prevent others from identifying [Junmeng Chen] as the real culprit.\n4. To conceal your shooting of your brother.", 
        "Ability": "" 
    },
    "Doctor Fang": { 
        "Story": "Doctor Fang\nFemale. Twenty-nine years old. Her cheeks are thin, and her hair is shoulder-length. She wears a white coat, dressed in a neutral style with a tie. She has been single until now.\nYou haven't studied medicine, so you are naturally not a doctor. Your real name is 【Fang Minyue】. Your father 【Fang Chengshan】 worked for the owner of “Falan Villa”, 【Meng Laoye】, as an assistant to the villa's manager, 【Du Laogong】. Your father, along with you and your mother, lived in the big house in “Baili Village” (later known as the Yao family mansion), together with 【Yao Changshou】’s family, who also worked for 【Meng Laoye】.\nYour father appreciated modern education and taught you to read from a young age, and you respected him greatly. In the big house, there were also 【Yao Changshou】's two sons: 11-year-old 【Yao Mengren】 and 6-year-old 【Zhongyi Yao】. You taught them the 'enlightenment thoughts' you learned, and 【Yao Mengren】 was fascinated by it. 【Yao Changshou】’s concubine 【Zhang Yadi】's nephew 【Zhang Decai】 also lived in the big house; he was about your age and treated you well. At that time, you were 15, vaguely feeling love, yearning for the flower language of the “bellflower” – eternal love.\nBeautiful times are the easiest to pass. (1900) Not long after 【Du Laogong】 passed away, your father disappeared without a trace, and you were heartbroken, taken back to your maternal home in Shanghai by your mother. When you left the big house, 【Zhang Decai】 chased after you, promising to make a fortune in the future and come back to marry you in a grand red bridal sedan.\nYour mother was in poor health, and you had no siblings, so you had to interrupt your studies and help at your uncle’s “Jiashantang” clinic in Pudong, Shanghai, to earn money. Unfortunately, not long after, “Jiashantang” went bankrupt, and an elder introduced you to care for patients at “Zhabexi Hospital” — those days were tough, but 【Zhang Decai】's letters kept coming, and when you replied, you always told him good news and rarely mentioned difficulties.\nThree years later (1903), you received 【Zhang Decai】's last letter, in which he said he made a fortune and would come to find you soon to marry you. You treasured this letter, waiting for his arrival. Days passed, but 【Zhang Decai】 never contacted you again…\nYou had to support your mother and relied on hard work to get through the emotional difficulties — your father's and lover's disappearance made you afraid of losing loved ones again, so you remained single and had fewer worries. This year, you were promoted to “head nurse” at the Western hospital (the term “nurse” was just translated from English this year, 1914). \nThree years ago (1911), your cousin 【Tian Hongjiao】 (she ran a tavern called “Feicui Ju”, and the villagers called her “Selling Wine Ah Hong”, good at dealing with guests) married 【Yao Changshou】 (by then, he had become a big landlord, old enough to be your cousin's father). You attended the wedding feast and got drunk, unwilling to be looked down upon by your relatives, boasting that you were a doctor at “Zhabexi Hospital”, a female doctor named 【Doctor Fang】.\nLast week, you received a letter from your cousin — she said 【Yao Changshou】 fell ill and asked you to diagnose him. You braced yourself and went to the 【Yao】 family, where you saw 【Yao Changshou】 looking older than his actual age, spiritless, with jaundice and abnormal eye color. You secretly noted these down and returned to Shanghai to find 【Doctor Song】 from the internal medicine department at the Western hospital (Song Ducheng), who gave you some medication, including “boric acid solution” and “golden streptomycin”, along with usage instructions. You sold them at a high price to your cousin (taking care of your mother had exhausted you, and you really needed extra income).\nBy this method, you disguised yourself as 【Doctor Fang】 and made money; although 【Yao Changshou】 did not recover, your cousin still trusted your treatment — you never mentioned your past life to her, and neither 【Yao Changshou】 nor 【Zhongyi Yao】 recognized you.\nDuring this time, you overheard a secret about the 【Yao】 family — 【Yao Changshou】 once yelled at your cousin: … there are treasures underground … whoever dares to sell it will be killed! Then he scolded your cousin out of the bedroom — you disliked 【Yao Changshou】’s arrogance and went back to the Shanghai hospital to get some “sedatives” to give to your cousin. After 【Yao Changshou】 took them, his emotions stabilized, but he never mentioned the “treasure” again.\nYou suspect there is a story behind 【Yao Changshou】 becoming the master of the big house and a big landlord, possibly related to your father's disappearance. Under the pretense of caring for patients, you asked your cousin to arrange a guest room for you on the second floor (she gave you the room key) — this way, you could stay in the house until you uncover the truth.", 
        "Script": "Yesterday afternoon (August 2nd)\nYou were chatting with your cousin in the living room when 【Zhongyi Yao】 brought a guest to meet her. You took the opportunity to find 【Yao Changshou】—you had heard from the doctors at the Western Hospital that some patients, after taking 'sedatives,' could easily reveal things they normally wouldn’t say. You went to the master bedroom on the first floor and first made 【Yao Changshou】 take his medicine (only you, 【Madam Hong】, and 【Zhongyi Yao】 have the keys to the locked medicine cabinet), then you tried to ask him something. He told you an unexpected story:\n【Yao Changshou】 had been looking for the “treasure” that the 【Meng】 family initially had 【Chief Steward Du】 hide in “Baili Village.” The person who came to hide the items was already deceased, and the only one who knew the secret had also disappeared... You immediately asked him, “Who is the missing person?”\n“He was named 【Fang Chengshan】, a colleague of mine and Old Chen's, but Master Meng only trusted him and Chief Steward Du...” You had already guessed the missing person was your father, but hearing 【Yao Changshou】 say it out loud made your heart tremble. At this moment, 【Yao Changshou】 became agitated, shouting, “Why are you asking him? Who are you? Why do you want to know!” Just then, you heard someone push the door open and quickly hid behind the curtains (the windows in the master bedroom are covered with floor-to-ceiling curtains).\nYou peeked through the curtain gap and saw a figure wearing a “black jazz hat,” with a “white scarf” covering their face and “sunglasses” on—this was the 【Mysterious Person】. The 【Mysterious Person】 walked to 【Yao Changshou】’s bedside, and before 【Yao Changshou】 could speak, the 【Mysterious Person】 covered his mouth.\nThe 【Mysterious Person】 said, “You didn’t expect me to come back, did you?” 【Yao Changshou】 struggled continuously, and the 【Mysterious Person】 let go, saying, “The once-mighty 【Yao Changshou】 now can only lie on the bed, barely alive. How ridiculous! I warned you back then, those treasures were just nonsense. You, and the Chen family, what you conspired for ended up being nothing!”\n【Yao Changshou】 was gasping for breath, and the 【Mysterious Person】 handed him a cup of water, saying, “You’ve already gained so much land, it’s time for you to live your old age honestly—your young wife is nice—our pursuits are different; I have my own goals, otherwise I would have come back sooner.” After saying that, he helped 【Yao Changshou】 lie back on the bed. When he was about to leave, he turned back and said, “I actually know what the treasure is—this is of no use to you anymore.”\nNow you knew that the “treasure” must be related to your father’s disappearance, so you secretly followed the 【Mysterious Person】 upstairs. He entered the guest room, and you hid on the stairs leading to the terrace, secretly observing the 【Mysterious Person】’s door (from the stairs, you could only see this area): you saw 【Zhongyi Yao】 first bring a 【short-haired woman】 into the 【Mysterious Person】’s guest room. Then, after 【Zhongyi Yao】 escorted the 【short-haired woman】 out, he returned to the 【Mysterious Person】’s guest room. You didn’t know what they talked about. Shortly after 【Zhongyi Yao】 left, the 【Mysterious Person】 also came down from the guest room. You wanted to enter his room but found the door locked—so you returned to your own room, determined to find out the truth and whereabouts of your father’s disappearance at any cost.\nLast night (August 2nd) (10:10 PM)\nYou heard someone speaking in the corridor and quietly opened your door, seeing 【Zhongyi Yao】 and the 【Mysterious Person】 walking one after the other onto the terrace—the 【Mysterious Person】’s room door was left ajar. Just as you were about to enter, your cousin called you—she came to inquire about 【Yao Changshou】’s condition. You casually replied, “I diagnosed 【Yao Changshou】's condition as quite troublesome. He is suffering from a virus, causing unusual skin symptoms and a weak pulse—killing the virus can only rely on the special medicine from the Western Hospital, which is quite strong; no virus can withstand it... but it’s not cheap!”\n(10:20 PM) The maid asked your cousin to come downstairs, and you slipped into the 【Mysterious Person】’s guest room. After closing the door, you began searching the room—you were very nervous, always alert to any sounds from outside—you heard someone leave the neighboring room (【Di Zhu】's room).\n(10:30 PM) You found the “torn map,” which had 【Fang Chengshan】’s “signature” on it—you finally found solid evidence related to your father’s disappearance—you remembered the last time you saw your father leave, he had a temporary “map” drawn on a piece of writing paper (you had him sign it, saying it was a piece of art), and a specially made “flan key” (a flat key), which 【Chief Steward Du】 had given him to keep, to return to 【Master Meng】. You also noticed there were brown stains on the map!\nYou knew blood would take a long time to turn brown, fearing that what you had been “worried about” had already happened, you walked onto the terrace to see in the moonlight, and indeed, it was blood—now you understood your father had already been harmed—the murderer killed him to take the “map.” A loud “thud” came from the terrace, and a man fell from above, landing in front of you. You wanted to dodge, but it was too late, an “object” fell at your feet.\n(10:40 PM) The man got up, his forehead bleeding from the fall, his expression furious and twisted.\n(10:50 PM) The man stared at you, then turned his gaze to the “object” on the ground, which was a “handgun” (you knew in Shanghai that pulling the trigger could kill), and you quickly picked it up. The man shouted angrily, “【Zhongyi Yao】!”\n(11:00 PM) The man noticed the “torn map” in your hand and yelled at you, “Give me back the map!” You raised the gun, pointing at your father’s “signature” on the map, asking him, “Where is the original owner of the map?” The man sneered, “I shot him dead a long time ago—if you don’t give me the map, you’ll meet the same fate!” You couldn’t believe the murderer would admit it so easily; the power of the treasure made them utterly disregard killing... The moonlight shone on your face, cold tears streamed down your cheeks, and your heart was filled with anger and grief. The man’s expression changed dramatically upon seeing this, and he suddenly shouted your name: “Fang Minyue, I recognize you—you are 【Fang Chengshan】’s daughter!”\nThe man stretched out his arms to grab you. But you wanted revenge for your father! You pulled the trigger (the safety of the gun was off), and the bullet hit the man’s chest at close range. The gunfire was loud, and for a moment, you couldn’t hear anything—you saw the man speaking but couldn’t hear him, then he fell backward, crashing onto the neighboring terrace (to the west), blood spraying upwards. The recoil of the gun knocked you to the ground, and the “handgun” was thrown to the opposite terrace (to the east). You got up and ran back to your room, covering your mouth with your numb hand.\n(11:20 PM) A knock came from the neighboring room (【Doctor Yu】's room), and you realized your hearing had returned. You held your breath, hearing 【Zhongyi Yao】’s voice: “Brother Yu, are you back?” No one responded.\n(11:30 PM) After hearing the person outside leave, you immediately came out and saw a plate of “Taihu silverfish” placed on a tray outside 【Doctor Yu】’s room to the east. You quickly returned to your own guest room (your room is adjacent to 【Doctor Yu】's), thinking you could use what you just heard and saw as evidence of your presence in the room.\n(00:40 AM) You stood in front of the window, seeing someone dragging an object on the ground below—you couldn’t see clearly as it was too dark outside.\nThis morning (August 3rd)\nYou woke up to find the 【Yao】 family in chaos— the corpse of the man you killed had been discovered. The first to find the body was the 【short-haired woman】, who said there hadn’t been a carriage leaving the village last night, meaning the real culprit must still be hiding here. You acted as if you knew nothing, alongside everyone in the living room...", 
        "Relationship": "1. Fang Chengshan: Your father, he was 【Du Laogong】's assistant, and disappeared after 【Du Laogong】 died in 1900. You conclude he has died and is related to the “treasure” mentioned by 【Yao Changshou】...\n2. Yao Mengren: 【Yao Changshou】’s eldest son, already deceased, you were his enlightenment teacher.\n3. Zhongyi Yao: 【Yao Changshou】’s second son, he was only six when you taught him and does not recognize you now. You remember he had to endure a lot from his elder brother 【Yao Mengren】, who was born to the main wife, as he was born to a concubine.\n4. Yao Changshou: The big landlord of “Baili Village”, who used to be your father's colleague.\n5. Madam Hong: Real name 【Tian Hongjiao】, your cousin and 【Yao Changshou】’s second wife. You remember she had a fiancé with the surname 【Fan】, who died before their wedding (she found his body in the woods north of the village).\n6. Zhang Decai: Your first love, now missing.\n7. You currently do not recognize any other individuals.", 
        "Performance": "In this stage, you must act in the following ways while concealing the undiscovered truth:\n1. The plants you like are “bellflowers” and “asparagus”, their meanings are “eternal love” and “pure heart”. You once fantasized about wearing them at your wedding — only later did you learn that “white bellflower” also symbolizes “hopeless love”…….\n2. When you went back to Shanghai to get “sedatives”, you encountered a major military operation by the local troops. They dragged out a drunken man from a restaurant, and he drunkenly shouted: “I am the ‘White-Headed Snake’, who dares to touch me, I’ll go to ‘Baili Village’ and call the bandits to kill his whole family!”.\n3. You heard at the hospital that murderers with mental illness can be exempt from the death penalty.\n4. Your father once mentioned that 【Du Laogong】’s son is named 【Du Guicheng】, and you unexpectedly learned in “Zhabexi Hospital” that 【Doctor Song】 (the one who gave you the medicine) was his classmate.", 
        "Purpose": "1. To prevent most people from identifying you as the real culprit.\n2. To find out the truth behind your father's death.\n3. To discover the whereabouts of the 【Yao】 family’s “treasure”.\n4. To find out the whereabouts of 【Zhang Decai】.", 
        "Ability": "" 
    },
    "Di Zhu": {
        "Story": "Di Zhu\nMale. In his early thirties. Curly hair, mustache. Dressed in a suit, often mixes in some foreign words while speaking. Has a habit of smoking.\nYou are not a compradore; [Di Zhu] is your alias. Your real name is [Zhang Decai]. Your parents died young, and you grew up under your aunt [Zhang Yadi], who is [Yao Changshou]’s concubine. Although she gave birth to the second young master [Zhongyi Yao], her status can never compare to the main wife [Madam Xu] and the legitimate first son [Mengren Yao].\nAt that time, [Yao Changshou]’s colleague [Fang Chengshan] lived in the big house with his family. His daughter [Fang Minyue] was around your age, and she received a new-style education that made you envious. [Fang Minyue] treated you very well—that was your happiest time in the big house, but it ended quickly—In 1900, [Fang Chengshan] suddenly disappeared, and his wife took [Fang Minyue] back to her family in Shanghai. You chased after her, promising your beloved that you would make a fortune one day and marry her in a grand procession.\nAfter that, you only exchanged letters with [Fang Minyue], learning that she was very distressed about her father's disappearance. But she was strong, interning at a clinic in Pudong, and later worked at a Western hospital while you remained at your aunt's home, starting to worry about the growing distance between you.\nLater, [Yao Changshou] became the wealthy landlord of 'Baili Village,' and [Madam Xu] grew increasingly dissatisfied with your aunt. The eldest son [Mengren Yao] treated you and [Zhongyi Yao] like servants, ordering you around, and you didn’t dare resist. Three years later (in 1903), your aunt fell from the second-floor balcony and died. [Madam Xu] had [Zhongyi Yao] sent to the capital for school—by then, you had come of age and felt it was time to leave.\nBefore you left the [Yao] family, you stole something valuable—you wrote a letter to [Fang Minyue] that day, telling her you had made a lot of money and would soon come to marry her. Just as you sent the letter, [Mengren Yao] discovered it, captured you, and sent you to the authorities. After you were released from prison, you went to Shanghai empty-handed, too ashamed to see [Fang Minyue], and could only wander in the city, adopting the name [Di Zhu], still dreaming of one day achieving success and marrying your beloved—many years have passed, and you not only achieved nothing, but you also don’t have a decent job.\nLast week, with nothing to do, you returned to 'Baili Village,' only to learn that [Madam Xu] had long since passed away, and [Mengren Yao] had also died from illness. At this time, [Yao Changshou] had remarried a woman named [Madam Hong]. You arrived at the [Yao] family, claiming you had been a compradore for Westerners in Shanghai and were back to visit relatives (you concealed your true identity and only said you were a relative of the Yao family). [Madam Hong] welcomed you warmly.\nWhile chatting, [Madam Hong] mentioned a piece of land (the woods north of the village) that had been idle for years, which [Yao Changshou] wanted to sell for cash. You thought this was a chance to earn a commission, and without even seeing your cousin [Zhongyi Yao], you ran back to Shanghai to find a buyer—you had met a person nicknamed 'White-headed Snake' while in prison, who claimed to have many connections. When you inquired with him, he suddenly asked if there was a place in 'Baili Village' to hide things.\nYou recalled that over a decade ago, [Fang Minyue]’s father [Fang Chengshan] had hired a foreman named [Fan Jinkui]. When you went to find her father for [Fang Minyue], you saw him and his men digging and transporting things near 'Bai Shuang Pavilion' in the northern part of the village—later, a collapse occurred underground, and you ran to the big house to alert them that something had happened. The 'Li brothers' brought by [Fan Jinkui] never made it out...\nYou led 'White-headed Snake' to find an entrance long buried by weeds near 'Bai Shuang Pavilion.' There was a tunnel underground, empty inside, and at the end, you found a mechanism that opened to an exit. When you surfaced, you saw that the exit was a movable tombstone with the inscription 'Grave of Mengren, the unworthy son of the Yao family.' To the west of the grave was a gray-white two-story Western-style villa standing on a patch of yellowed land, its exterior walls covered with wisteria. The main door of the villa was secured with a big lock (decorated with Fa Lan painting), the oval-shaped keyhole covered with signs of age, locked for an unknown time. Surrounding it were dense woods.\n'White-headed Snake' laughed heartily, saying this place was excellent, with no signs of human presence—later, he transported many wooden boxes into the tunnel, hiding them beneath the tombstone at the end of the tunnel. Before he returned to Shanghai, he gave you a task, saying that if anyone came to see the goods in the next few days, you should host them, and you'd receive benefits afterward.\nYou lied to [Madam Hong], claiming you had found a buyer, and that the buyer would come soon to see the land, so you needed to stay here for a few days. [Madam Hong] arranged for you to stay in a guest room on the second floor with a terrace (the terrace railing was not high) and gave you the room key—you waited a few days, but no one came. You went to Shanghai to find 'White-headed Snake,' only to hear he had been captured by the troops stationed in Shanghai. 'White-headed Snake' attempted to escape during interrogation and was shot dead by the lieutenant who had been assigned to investigate!",
        "Script": "Yesterday (August 2) afternoon\nYou rushed back to 'Baili Village' and encountered a 【disheveled man】 outside 'Bai Shuang Pavilion.' Fearing he would see you, you pretended to be wandering around and lit a cigarette. He asked you for a “match.” After he walked away, you slipped into the tunnel and ran to the place where “Baitoushe” hid things, pried open a box, and saw it filled with “rifles.”\nYou were scared, dizzy, and sweating. You quickly wrapped a “rifle” in your coat, opened the mechanism, took a few breaths of outside air, and began to pace around the Western-style mansion ——you knew you had been caught up in an arms smuggling operation, a deadly illegal transaction that might have already been exposed—suddenly, you saw a girl in a white dress with 【long hair】 standing on the second floor balcony, releasing a white dove into the sky.\nAfraid she would see you when you returned to the tunnel, you struck a “match” and set the dry leaves on the ground alight, hoping to divert 【the long-haired girl】’s attention. Unexpectedly, the fire flared up in the wind, and blue flames quickly engulfed the first floor of the Western-style mansion . You hurried back to the tunnel, thinking you had made a fatal mistake—thankfully, you ran fast; when you left the tunnel and looked back, thick black smoke was billowing inside, with a pungent smell.\nYou ran back to 【Yao】’s house and found 【Madam Hong】 talking to a guest in the living room. Out of politeness, you greeted them—at this point, you could only hope to get escape funds or information from the “Baitoushe”’s trading partner. You quietly asked 【Madam Hong】 if any strange people had come today; she whispered to you that a 【short-haired woman】 had come to the second floor, looking like a female bandit.\nA bandit? Great!—You didn’t wait for 【Madam Hong】 to introduce the guest, using the excuse of not feeling well to rush off and confirm the identity of the 【short-haired woman】.\nYou came out of the living room and saw 【Zhongyi Yao】 coming out from the main bedroom on the first floor (where Yao Changshou and Madam Hong lived) and heading upstairs (you hid on the stairs, and he didn’t notice you). You saw him escort the bandit-like 【short-haired woman】 to a guest room on the second floor. You knew there was a “spare key” in the main bedroom on the first floor, so you sneaked in and found 【Yao Changshou】 lying on the bed. You waited by the bedside for a while; seeing he wasn’t moving, you quietly took the “spare key,” went upstairs, and knocked on the 【short-haired woman】’s door. Confirming no one was inside, you unlocked it: there was a long package wrapped in “blue cloth.” You opened a corner and saw a “rifle” inside.\nYou concluded she was “Baitoushe”’s trading partner, but you didn’t dare approach her recklessly. Back in your guest room, you pondered how to conduct a “transaction” with her—you lay in bed thinking and soon fell asleep.\nYesterday (August 2) night\nYou didn’t sleep well and were quickly awakened by noise. You opened your eyes to see a “black jazz hat,” a pair of “sunglasses,” and a “white scarf” on the terrace of the room.\n(22:10) You wanted to approach the 【short-haired woman】, and just as you stepped out of your guest room, you saw 【Fang Minyue】, whom you hadn’t seen in years—she looked even thinner than before, but you recognized her at a glance. You were not only struggling but also in trouble, and you didn’t want her to see you—thankfully, at that moment, 【Madam Hong】 called her. The door to your neighboring guest room happened to be open, so you hid in the next room and listened as she said to 【Madam Hong】, “I... uncle... Qing... killed...” You hurriedly hid back in your own room before hearing the rest.\n(22:20) You put on the “black jazz hat” and “sunglasses” from the terrace, covering your face with the “white scarf”—even if you were seen, no one would recognize you (especially not Fang Minyue). You wrote a “note”: “At midnight (11 PM), I’ll wait for you on the second-floor balcony.” Taking advantage of no one being in the second-floor corridor with all doors closed, you slid the “note” under the door of the 【short-haired woman】’s room and went to the east balcony on the second floor to wait for her—taking the “rifle” you had brought back from the tunnel, hidden behind you, ready as a sample.\n(22:30) On the balcony, you heard a “thud” sound coming from the west.\n(22:50) You heard someone shouting “Zhongyi Yao” from the west on the second floor.\n(23:00) The 【short-haired woman】 arrived on the balcony with the long package and asked you, “What do you want to do?” You guessed she already knew you had been in her room, and making a gesture for her to speak quietly, you lowered your voice and said, “I know you came to ‘Baili Village’ to find me—tomorrow, I’ll bring what we agreed on and leave with you.”\n“Forget about the previous agreement; I’ve changed my mind.”\n“Changed your mind?”You are anxious. 'You still don't know, the situation on the military side has been exposed, 'White-headed Snake' is dead, and I will soon be implicated. It's all because of your family's 'deal'—it doesn't matter, the 'deal' can be half price, as long as we leave together tomorrow!'  You see her hesitating, so you quickly take out the 'rifle' as a sample and say to her, 'Do you see this gun? At this point, either we leave together or no one gets to leave!' You know in your heart that the lieutenant who killed 'White-headed Snake' will soon find this place, and by then, it will be impossible to escape.   You didn't expect the [short-haired woman] to suddenly turn hostile; she unwraps the 'blue cloth,' raises her 'rifle' and aims it at you. You become increasingly anxious and shout, 'If you have the guts, shoot me now!' To your surprise, she really fires at you, luckily hitting the balcony 'railing' next to you—frightened, you back away and lean against the 'railing.' Only then do you realize how ruthless the female bandit who made a deal with 'White-headed Snake' truly is! At the same time, you are relieved she didn't see your true face. The [short-haired woman] throws down a line, 'I don't want to see you again,' and leaves.  (23:10) You feel the 'railing' behind you wobbling, and a [young man] walks up to you and asks who you are. Not wanting to complicate things, you lower your voice and say, 'Kid, mind your own business and go back to your room!' You see the [young man] still scrutinizing you, so you raise the 'rifle' to intimidate him, saying, 'Kid, are you tired of living?' The [young man] immediately raises his hands. Just as you're about to lower your gun, he rushes forward, strikes your wrist, knocking the 'rifle' from your hands, and then slaps your chest. You crash back into the balcony 'railing,' and he kicks the 'rifle' away and ties your arms with the 'blue cloth.' You struggle a few times but can't break free. Suddenly, the balcony's 'railing' falls away; thankfully, the [young man] grabs the 'blue cloth,' preventing you from falling—this reminds you of your aunt [Zhang Yadi], who fell from here years ago, and you suspect the 'railing' has been tampered with...  (23:20) Sweating profusely, you say to the [young man], 'Thank you!' He releases you, and you quickly move past him back to your room.  (23:30) Back in your room, just as you take off your 'sunglasses,' you see a dead body on the terrace! You muster your courage to glance at the corpse's face: it’s covered in blood, shocked, and somewhat familiar, the terrace stained red with his blood!  (23:40) You push the body hard until it falls off your terrace—deciding to escape the next day, you can't let anyone suspect you now.  (23:50) Thankfully, you took the 'spare key' earlier; you use it to open the second-floor storage room—now sweating profusely, you throw the 'black fedora' at the storage room door, take out the 'rag' and 'cleaning tools' to wipe the blood off the terrace, and hide these items in the rooftop storage area.  (00:20) When you return to the second floor, you find the 'black fedora' you tossed at the storage room door is missing, so you hurry back to your room.  (00:30) At this point, you notice you are still wearing the 'white scarf,' which is stained with blood, so you throw it off the terrace. Then you hear a 'thud' sound from downstairs; you dare not peek and crawl back to bed.  (00:40) You hear voices downstairs, seemingly a man and a woman; you are very tired by this point and soon fall into a drowsy sleep.  This morning (August 3), you wake up early wanting to leave, but the body has already been discovered. Everyone gathers in the living room; the [short-haired woman] who found the body says that the carriage did not leave the village last night, and the real culprit must still be hiding here... You avoid [Fang Minyue]'s gaze, pretending to know nothing, hoping to get away with it...",
        "Relationship": "1. Mengren Yao: [Yao Changshou]’s eldest son, born of the main wife, domineering, died three years ago. He discovered your theft and beat you.\n2. Zhongyi Yao: [Yao Changshou]’s second son, born of your aunt [Zhang Yadi]; he was still a minor when you left, so he probably won't recognize you.\n3. Yao Changshou: You remember he was not the master of the big house and the landlord before; you now claim to be his relative.\n4. Madam Hong: [Yao Changshou]’s second wife, very welcoming to you.\n5. Doctor Fang: Her name is [Minyue]; she is your first love, whom you promised to marry. You are now very afraid of being recognized by her. Her father [Fang Chengshan] disappeared in 1900; you once saw [Fang Chengshan] leave with a makeshift map drawn on letter paper and a specially made 'Fa Lan key' (oval key).\n6. You do not currently know anyone else.",
        "Performance": "The following 'performance' must be maintained at this stage; you need to conceal truths that others have not discovered.\n1. You are currently [Di Zhu], a compradore for Westerners in the Shanghai concession, with many deals involving 'foreign fire' and 'foreign cloth,' and you've made a lot of money.\n2. You are a relative of the [Yao] family, who came back to visit relatives and will leave today.\n3. Inquire about [Fang Minyue]’s situation over the years, being careful not to be recognized as [Zhang Yadi]’s nephew.\n4. You want to know who is interested in firearms.",
        "Purpose": "1. Identify the real culprit.\n2. Prevent others from identifying you as the real culprit.\n3. Conceal your identity as [Zhang Decai].\n4. Conceal that you set fire outside the villa yesterday afternoon.\n5. Conceal your work for 'White-headed Snake' and that you attempted a 'deal' on the terrace last night.\n6. Conceal that you pushed the body off the terrace.",
        "Ability": ""
    },
    "Madam Hong": {
        "Story": "Madam Hong\nFemale. Twenty-nine years old. Wearing a wide-sleeved top with golden embroidery and a red long skirt. Her makeup is bright, and her laughter is charming.\nYou are a local from \"Baili Village,\" originally named 【Tian Hongjiao】. Due to your family's tavern \"Emerald Residence,\" you were once known as \"Selling Wine Ah Hong.\" More than ten years ago (1900), a guest (Zhongyi Yao, much older than you) harassed you in the tavern; you hit him, and he blocked the tavern outside with his people until your fiancé 【Fan Jinkui】 drove them away.\nYou introduced 【Fan Jinkui】 to your good brothers 【Li Kuansheng】 and 【Li Guangsheng】 for work with your uncle 【Fang Chengshan】. Soon after, the \"Li Brothers\" had an accident, and 【Fan Jinkui】 also went missing. You searched for him everywhere, only to find his decaying, disfigured corpse in the woods north of the village. You could only identify him by his clothing. Since then, you've often been awakened by nightmares and fear these \"bad things\" (ghosts or corpses)—you resolved to live well no matter what happens. During this time, you had suitors like 【Big-Eyed Ah Kun】 and 【Guo Lizhu】, but you considered them fleeting.\nThree years ago (1911), the village's big landlord 【Zhongyi Yao】 sent a marriage proposal, claiming he wanted to marry you for over ten years, but his wife was still alive at that time. His eldest son 【Yao Mengren】 came to ask you not to accept his father's proposal and to leave here—if you agreed, he would send you to the south to see the outside world. At this time, you had decided to marry into the 【Yao】 family and wanted 【Zhongyi Yao】 to make it official. 【Yao Mengren】 warned you would regret it! You knew he was the heir of the 【Yao】 family and didn’t dare offend him.\nAfter marrying, 【Yao Mengren】 also got married, but he soon fell ill and died—【Zhongyi Yao】 called his second son 【Zhongyi Yao】 home to bury 【Yao Mengren】 in the woods north of the village. 【Yao Mengren】’s bride 【Junmeng Chen】 stayed there to mourn, with her maid 【Anqiao Chen】 responsible for bringing meals daily—you had been afraid to enter the northern woods after your fiancé's death and feigned illness on the burial day.\nAbout half a month ago, someone saw a “bad thing” in the woods north of the village: a mischievous boy ran in and hadn’t come out by nightfall. 【Zhongyi Yao】 found him—the boy had encountered something evil and kept saying he saw a \"ghost\"... After hearing this, you were very frightened and recalled your fiancé's death.\nThat same night, 【Zhongyi Yao】 returned home covered in dirt and fell ill the next day—he looked older, lethargic, and his skin and eyes were discolored. You remembered he often left the bedroom at night, taking a long time to return.\nYour cousin 【Fang Minyue】 (daughter of Fang Chengshan) mentioned during your wedding that she is a female physician at Shanghai’s \"Zhabei Western Hospital.\" You wrote to invite her to diagnose 【Zhongyi Yao】; after her visit, she returned to Shanghai with two kinds of \"expensive medicine.\" After paying, you found there wasn’t much cash left at home and discussed with your husband about selling a piece of land to raise funds. Upon hearing this, 【Zhongyi Yao】 got excited, saying there are treasures beneath the land, and whoever sells it will be killed! He even scolded you away. Your cousin then gave you a bottle of \"sedatives,\" which you fed to 【Zhongyi Yao】; he became stable and no longer opposed you.\nA few days ago, a relative of the 【Yao】 family, 【Di Zhu】, visited. He works as a comprador in the Shanghai concessions, making big money with foreigners. You welcomed him warmly and mentioned a piece of idle land (the northern woods, which you detest). You pretended 【Zhongyi Yao】 wanted to sell it for cash, and 【Di Zhu】 agreed to help find a buyer—true to his role, he quickly found one—he planned to stay at the 【Yao】 family for a few days until the buyer arrived to see the land together. You arranged for him to stay in a guest room on the second floor with a terrace (the terrace railing is low).\n(On August 1st) 【Zhongyi Yao】 led in a mysterious person wearing a \"black gentleman's hat,\" covering their face with a \"white scarf,\" and wearing \"sunglasses\" to stay in the second-floor guest room.",
        "Script": "Yesterday (August 2nd) afternoon\nYou and your cousin were chatting in the living room when 【Zhongyi Yao】 brought in a young man, and your cousin excused herself to go out. 【Zhongyi Yao】 introduced the young man as the【Doctor Yu】 he had invited to treat his father, who had also studied abroad. You welcomed him enthusiastically, just like when you used to run the tavern, but felt uneasy inside.\nA short-haired woman with luggage came into the hall. She looked in her twenties, dressed in a light-colored suede jacket, long pants, and leather boots, carrying a long package wrapped in “blue cloth” (you thought she looked like a female bandit). She said she was looking for【Xu Boqing】. 【Zhongyi Yao】 immediately stood up and took her to the second floor. You sensed that 【Zhongyi Yao】 was planning something and didn’t dare to let【Doctor Yu】 meet her husband just yet, so you made an excuse: “Since【Doctor Yu】 has traveled a long way, please rest for the night first and see your husband tomorrow.” 【Doctor Yu】 mentioned wanting to stroll around the village, and you told him that “Jade Residence” was nice (you had entrusted it to your sister A Cui after getting married and even asked her to help you find land buyers). You suggested the young man should try the “One-Day Drunk” there but warned him to avoid the northern woods of the village, as there were “bad things” there.\nYou wanted to ask your cousin about your husband’s condition, but she wasn’t in the room (you knocked but got no response), so you had to go downstairs—just then【Anqiao Chen】 led some guests looking at land into the living room to meet you—the guest named【Renyu Hu】 didn’t haggle over your asking price. You found him quite reliable during your conversation.\n【Di Zhu】 came in, sweating profusely, holding his coat and reeking of a strong odor. He greeted【Renyu Hu】 and quietly asked if any unusual people had come today; you told him about the【short-haired woman】.\n【Di Zhu】 said he wasn’t feeling well and left the living room. You chatted with【Renyu Hu】 for a while, but since【Yao Changshou】 hadn’t taken his medicine, you didn’t dare let them meet, so you invited【Renyu Hu】 to stay in a guest room on the second floor, saying you would confirm the “transaction” once【Yao Changshou】 felt better.\nAs you were contemplating how to arrange their meeting,【Zhongyi Yao】 came in with several people, including the【short-haired woman】, who brought the unconscious【Junmeng Chen】 into the old house on the first floor (the bedroom of Yao Mengren when he was alive). A disheveled man named【Uncle Gui】 claimed to understand medicine and wanted to help check【Junmeng Chen】—not finding your cousin, you went to the master bedroom on the first floor to get all the medicine, accompanying【Uncle Gui】 (only you,【Zhongyi Yao】, and your cousin had the keys to the locked medicine cabinet, and when you entered, you saw the cabinet door open and【Yao Changshou】 sleeping).\nAfter【Uncle Gui】 examined【Junmeng Chen】, you noticed his skilled way of preparing medicine and praised his medical skills, asking him to stay and diagnose【Yao Changshou】 (you were very eager to know your husband’s condition and the treatment cost before【Doctor Yu】 diagnosed him).【Uncle Gui】 said he would first check on【Doctor Yu】 upstairs before coming down to see【Yao Changshou】 (only then did you remember that【Uncle Gui】 was also brought in by【Zhongyi Yao】).\nAt nightfall,【Uncle Gui】 came to diagnose【Yao Changshou】—the floor-to-ceiling windows in the master bedroom were covered with thick curtains (as【Yao Changshou】 had recently been afraid of light), and you took a lamp to illuminate the room. Just as【Uncle Gui】 started examining【Yao Changshou】,【Zhongyi Yao】 helped【Junmeng Chen】 in, and【Yao Changshou】 suddenly became agitated, struggling up from the bed and saying: “My Mengren is back… I saw him…-”\nYou were startled, dropping the lamp to the ground, the flame flaring up. 【Yao Changshou】 tore apart his “diary” (which he never let you see) and threw it into the fire. 【Uncle Gui】 stomped it out, and nobody spoke; only【Yao Changshou】 kept staring at the “burned paper,” murmuring, “I found it… you can’t take it away…”\n【Junmeng Chen】 began to cry, and【Uncle Gui】 asked【Zhongyi Yao】 to take her back—only then did you regain your calm. 【Uncle Gui】 said he was tired and would continue the diagnosis tomorrow. You arranged for him to stay in a guest room on the first floor.\nLast night (August 2nd)\n(21:30) You needed to prepare the “sedative” for your husband to take before meeting【Renyu Hu】 tomorrow and recalled that you had taken it all to the old house on the first floor in the afternoon. You went to the old house on the first floor to look for the medicine and saw【Junmeng Chen】 with her eyes closed, groping for something. When you went to get the medicine,【Junmeng Chen】 touched your hand and asked who it was, but you didn’t dare to speak, picking up a bottle labeled ‘Calm’ and going out.\n(21:40) You went to the kitchen to prepare to put medicine in your husband's food, only to realize that the medicine you took was not the usual\n“sedative.” But thinking that 'calming' meant something similar, you crushed the medicine and put it in a plate of “Taihu silver fish” (your signature dish). The medicine didn’t dissolve immediately, so you had to put the plate down.\n(21:50) You entered the old room on the first floor again, wanting to get the usual “sedative,” but couldn’t find it. On the table beside 【Junmeng Chen】, there was only the potion prepared by Uncle Gui.\n(22:00) You wanted to ask your cousin about the medicine and your husband’s condition, so you went upstairs to find her.\n(22:10) You met your cousin in the upstairs hallway and asked her about your husband’s condition. She said, “I diagnosed Yao Changshou’s condition, and it’s quite troublesome. He has been infected by a virus, causing unusual skin symptoms, and his pulse is weak—only special medicine from Western hospitals can kill the virus. That medicine is very potent, it can handle any virus... but it’s not cheap!” You began to hesitate about whether to continue spending money on your husband’s treatment.\n(22:20) A maid (not 【Anqiao Chen】, as she rests early and you’ve never sought her out at night) came to call you, saying 【Uncle Gui】 was waiting for you in the living room.\n(22:30) With your husband’s medical expenses on your mind, you went to the main bedroom on the first floor and saw 【Yao Changshou】—he was sitting on the bed, his gaze blank, his skin wrinkled, which made you feel disgusted from the bottom of your heart.\n(22:40) You went to the living room to see 【Uncle Gui】. He asked you if 【Yao Changshou】 had been to the woods north of the village before falling ill. You remembered that day when 【Yao Changshou】 returned covered in yellow dirt, not as if he had gone to the woods, and you answered no. You decided then to stop spending money on 【Yao Changshou】; you wanted to keep the money from selling the land for yourself—so you informed 【Uncle Gui】 that 【Yao Changshou】 would meet a guest (【Renyu Hu】) tomorrow morning, so you didn’t need his diagnosis for now.\n(22:50) You said you were going to get food for your husband and headed to the kitchen.\n(23:00) The “Taihu silver fish” that had been spiked with medicine was gone, and you became anxious.\n(23:10) You thought of asking the maid on the second floor, but at the stairway, you found a long iron pipe with a wooden handle that you had never seen before. When you took it into the main bedroom, you heard something fall outside the window. You felt scared and knocked on 【Zhongyi Yao】’s door, but there was no response. At that moment, you heard someone in 【Uncle Gui】’s room shout, “A life for a life!” You knocked on 【Uncle Gui】’s door; he didn’t open it right away but made you wait outside for a while before letting you in.\n(23:30) Inside 【Uncle Gui】’s room, you smelled something that had burned. You noticed that 【Uncle Gui】 had an injury on his face, almost bleeding, and his eyes were unfocused. You asked him if he had been to the kitchen, and he said no. Then he suddenly asked you loudly what time it was. You were startled, covered your mouth with your hand, and realized your face was very hot. You told him it was “Zi Shi Er Ke” (11:30 PM) and left, still feeling shaken.\n(23:40) Outside the main door, you heard something fall—you walked to the entrance, your heart racing faster and faster—you didn’t dare to move your feet, squatting on the ground, and various terrifying images began to appear in your mind...\n(00:20) You encountered 【Renyu Hu】, who asked what you were doing so late. You pointed to the entrance and said you had just heard a noise there and didn’t dare to go out, fearing it was “something bad.”\n(00:30) 【Renyu Hu】 went outside to check for you, and there was a “thud” sound outside.\n(00:40) 【Renyu Hu】 told you not to come out, saying there was a snake outside. After a while, he let you out to look, but you didn’t dare to open your eyes; instead, you poked your head out with your eyes closed and quickly hid back in.\n(00:50) 【Renyu Hu】 escorted you back to your room to rest. 【Yao Changshou】 was on the bed, staring at you and rambling: “Meng Ren said he knows the treasure, you go call him over…” You worried that 【Renyu Hu】 might tell 【Yao Changshou】 about the land, so you hurriedly told 【Renyu Hu】 to go back and rest, saying that “the transaction” could wait until tomorrow.\n(01:10) You felt extremely tired, but once in bed, you couldn’t fall asleep. You were constantly restless, even feeling like someone was outside the window... You didn’t know how long you tossed and turned until you finally fell asleep.",
        "Relationship": "1. Yao Mengren: The eldest son of 【Zhongyi Yao】, born of the first wife, opposed your marriage to his father before his death.\n2. Zhongyi Yao: The second son of 【Zhongyi Yao】, he returned home only after 【Yao Mengren】's death. You don’t have a good relationship, rarely speaking or inquiring about each other. His biological mother was a maid of the first wife, who has also passed away.\n3. Zhongyi Yao: Your husband, the big landlord of \"Baili Village.\" You let him rest in bed today since he still seems dazed and unable to communicate.\n4.Junmeng Chen: The widow of 【Yao Mengren】, who returned to her family early on the day he died.\n5. Doctor Fang: Your cousin, a female physician at Shanghai’s \"Zhabei Western Hospital,\" invited to diagnose your husband, known for her expensive prescriptions.\n6. Di Zhu: A relative of the 【Yao】 family, a comprador who helps you find a buyer for the land.\n7. Fan Jinkui: Your former fiancé, who died in the woods north of the village in 1900. He had some yellow hairs in his beard, and you were very frightened, not daring to look closely at his decaying face... \n8. Anqiao Chen: The maid accompanyingJunmeng Chen, who stays at the big house. You trust her more than other maids.\n9. You don't know the other people currently.",
        "Performance": "In this phase, you must do the following while concealing truths not discovered by others:\n1. Selling the land was 【Zhongyi Yao】’s idea; his current medication is very expensive—you tell everyone that although your husband is older, he has always admired and treated you well. You have spent a lot of money on medicine for his treatment, hence needing to sell the land—people coming to buy the land, like 【Renyu Hu】, haven’t even bargained.\n2. Each guest room has one key for the guests (you have provided room keys when arranging their stay), and there is also a set of \"spare keys\" in the master bedroom, which has gone missing today.\n3. You have never seen a \"gun\" and are very afraid of the dead; you dare not say \"corpse\" or \"ghost,\" calling them \"bad things.\" You show fear when hearing these words—you will never \"investigate\" the corpse or scene.\n4. Although \"Baili Village\" is not as large as big cities, there are many drivers in the village who work before dark, transporting guests to and from Suzhou or Shanghai.\n5. You remember your cousin had a lover back then, but you don’t know why she is still unmarried.",
        "Purpose": "1. Find out the real culprit.\n2. Prevent others from identifying you as the real culprit.\n3. Conceal your plan to use \"sedatives\" to trick your husband into selling the land and embezzle the money.\n4. Discover the real purpose of 【Zhongyi Yao】 bringing 【Doctor Yu】 and what they are concealing.\n5. Uncover the truth behind 【Fan Jinkui】’s death years ago.",
        "Ability": ""
    },
    "Renyu Hu": {
        "Story": "Renyu Hu\nMale. About thirty years old. Thick eyebrows and broad shoulders, with a bushy mustache extending to his temples, his chin clean-shaven.\nYou are not called 【Renyu Hu】; you are actually the wanted bandit “Golden Mustache,” and your real name 【Fan Jinkui】 is even less known.\nMore than ten years ago (1900), you lived in your hometown “Baili Village,” where your fiancée 【Tian Hongjiao】 ran the “Jadeite Pavilion” (a tavern)—the villagers called her “Drunken Hong,” and she was very good at dealing with customers. In the village, there was a lecher named 【Yao Changshou】 who, taking advantage of his job with wealthy merchants, disregarded his age and the fact that he already had a wife and a concubine, and harassed her at the “Jadeite Pavilion.” 【Yao Changshou】 was soon slapped by 【Tian Hongjiao】 for his shamelessness, and then he blocked the tavern's entrance with a few people. You chased 【Yao Changshou】 away (you were ready to fight, but they were just bluffing). 【Tian Hongjiao】 cautiously peeked out from the tavern and asked you, “What’s going on outside?” Seeing her quickly retreat, you thought she was incredibly cute.\n【Tian Hongjiao】 introduced you to 【Fang Chengshan】 (he is Tian Hongjiao’s uncle and also an assistant to the “Chief Steward” of a nearby villa). You brought your good brothers 【Li Kuansheng】 and 【Li Guangsheng】 to make money together. 【Fang Chengshan】 arranged for you to dig under the “Bai Shuang Pavilion” behind the village—you only then learned that there were tunnels beneath “Baili Village.” The employer wanted you to excavate a huge cavity at the side of the tunnel's end. Each time some space was dug out, 【Chief Steward】 and 【Fang Chengshan】 would have you move some goods inside at night.\nJust as you were about to finish, 【Fang Chengshan】 brought in a visitor named 【Yu Beichen】 to inspect the project. 【Yu Beichen】 took your tools and said the cavity was very dangerous, telling you to leave quickly. You argued with him, dragging him and 【Fang Chengshan】 to find 【Chief Steward】. The “Li brothers” stayed behind to continue working—suddenly, the cavity collapsed, and by the time people rushed to rescue, it was too late; the cavity, along with the people and goods inside, was buried under rubble...\n【Chief Steward】 used his connections to cover up the accident—you were very angry and, carrying a knife and the “Li brothers'” memorial tablets, secretly went to a nearby villa. You encountered 【Chief Steward】 in the study, who was cautiously holding a candle and a small package. You jumped out, brandished your knife, and demanded he give you justice!\n【Chief Steward】 was terrified; he placed the small package and candle on the ground. You pulled him out, but he suddenly turned and ran away, shouting “Thief!” You hurriedly escaped. 【Chief Steward】 ran back to the study, where an explosion suddenly occurred, shaking the ground as if an earthquake had struck.\nYou knew you had caused a great disaster and didn’t dare return home, hiding in the woods north of the village, surviving on wild fruit until you encountered three people—you were afraid they were there to capture you, so you hid and watched. The three argued, one trying to tear a piece of paper apart, stopped by the other two. He only managed to tear it in half before being killed—one of the dead was 【Fang Chengshan】, and one of the murderers was 【Yao Changshou】, while the other you didn’t recognize. After they committed the murder, they argued for a long time, finally taking one piece of the torn paper each and swearing an oath to become in-laws.\nYou waited for them to leave, destroyed 【Fang Chengshan】’s face with a knife, and swapped clothes with him. You also found a “Fa Lan ornament” (a piece of jewelry you liked, which you wore), and you couldn’t bear to throw away the “Li brothers'” memorial tablets—you believed anyone who saw the corpse would think 【Fan Jinkui】 was dead.\nYou fled to Suzhou, mingling among beggars and living a few years of miserable life. One cold winter, you hid outside a house, where a little girl came out alone, wearing a “golden longevity lock” around her neck. You had malicious intentions, pretending to beg for alms, planning to snatch it away.\nSeeing you, the little girl took out a silver ingot and placed it in your hand, saying her mother told her to help those in need. Your heart warmed instantly, secretly vowing to repay her a hundred or a thousand times in the future.\nAn adult from that family came out, called the little girl back, and then confronted you, demanding you return the silver, scolding you as despicable for deceiving a child! You held back your anger, placed the silver on the ground, and when he bent down to pick it up, you grabbed a piece of blue brick and smashed it on his head, again and again... You watched as blood stained the blue brick, feeling an indescribable thrill. You also looted a few copper coins and a “torn map” from the corpse, noticing 【Fang Chengshan】’s “signature” on it, which you kept with you.\nFrom then on, you became a bandit, known for your bravery and quick wits, decisively carrying out your tasks, continuously increasing your criminal record and followers. Due to a few yellow hairs in your mustache, you earned the nickname “Golden Mustache”—“Golden Mustache” roamed Jiangnan, and the incompetent Qing government could only post wanted notices, unable to do anything about you.\nNow in the Republic of China, last year (1913) there were uprisings in Nanjing against Yuan Shikai, and Jiangnan was engulfed in turmoil. You wanted to take the opportunity to shift from “bandit” to “official”—to raise a troop, you first needed firearms— you heard about a person nicknamed “White-headed Snake” who had smuggled a batch of military supplies from Shanghai's “Jiangnan Arsenal” during the turmoil last year and was looking for buyers. You went to Shanghai to negotiate with “White-headed Snake,” who requested you to trade in “Baili Village”—you immediately became alert—could he have detected your background?\nYou invited “White-headed Snake” to a tavern, continuously persuading him to drink, being sincere, even offering the “torn map” as a token (you lied, saying it was a treasure map). You finally discovered that he chose “Baili Village” because there was an “inside man” from the 【Yao】 family in the village—you then breathed a sigh of relief.\nYou returned to prepare the payment of “two hundred taels of gold,” but couldn’t contact “White-headed Snake”—you feared someone else was also eyeing this batch of firearms and decided to go to “Baili Village” to find his “inside man” for a direct transaction—in order to avoid attracting attention, you instructed your men to meet you three days later.",
        "Script": "Yesterday afternoon (August 2nd)\nAfter disguising yourself, you returned to 'Bai Li Village,' first taking the 'tablet' of the 'Li brothers' to the north of the village to pay respects, then at 'Emerald Residence,' you learned that your fiancée, Tian Hongjiao, had married Yao Changshou—in a fit of anger, you smashed a wine bowl. At the tavern, you also found out that the Yao family was selling a piece of land, so you planned to use this as an excuse to enter the Yao family and look for an 'insider.' \nYou introduced yourself as Renyu Hu, and the maid led you to the first-floor living room to meet Tian Hongjiao—she is now called Madam Hong. The land for sale is in the northern woods of the village; you casually agreed to the price she offered—this woman should have been your wife, but now she calls Yao Changshou her husband. Though she is elegantly dressed, her exhaustion is evident. \nAt this moment, a man entered, holding an outer garment and smelling strongly of something unpleasant. He greeted you, and you responded politely, then he whispered to Tian Hongjiao. After he left, Tian Hongjiao arranged for you to stay in a second-floor guest room and handed you the room key, saying to confirm the 'transaction' with Yao Changshou after he rested—you're not interested in the land, so you pondered how to get the 'insider' to find you as you rested in the guest room. \nLast night (August 2nd)\n(22:10) You heard a noise outside the door and opened it slightly, seeing Tian Hongjiao talking to someone in the guest room next door on your left. From your room, you vaguely heard a woman say: '…Yao Changshou… trouble… kill… Western Hospital… no problem… the price isn't cheap!' \n(22:20) Someone called Tian Hongjiao away. \n(22:30) A 'bang' sounded from outside the window, and you immediately became alert, retrieving a 'handgun' (your beloved—Ma brand pistol) from your luggage. \n(23:00) Another 'bang' echoed from outside, clearer than before. \n(23:10) You opened the window and heard someone talking on the balcony. Leaving your room, you peeked around the corner in front of the right staircase and saw a mysterious person wearing a 'black jazz hat,' with a 'white scarf' covering their face, still wearing 'sunglasses' at night, being pushed by a man against the balcony's 'railing.' You retreated to the corner, leaning against the door of the guest room, wondering if they might be the 'insider' you're looking for. Then you heard something fall to the ground. \n(23:20) Just as you were about to lean out for another look, you noticed someone behind you in the guest room pushing the door, so you hurried back inside. \n(23:40) You thought about checking on Tian Hongjiao to ask about her situation. \n(23:50) You went to the first floor and saw a long-haired girl at the entrance of an old room; she leaned against the wall of the corridor, wearing a 'golden longevity lock' around her neck—exactly what you swore to repay the 'little girl' for. You realized she couldn't see, so you rushed over to support her. She suddenly asked, 'Is it you?' Without thinking, you replied, 'It's me, I haven't forgotten you all these years—Suzhou girl… When I saw you in Suzhou, you were wearing this ‘longevity lock’...' Before you finished, tears streamed down her face, and you immediately said, 'If anyone bullies you, I'll take their life!' You finished speaking, helping her into the old room and sitting her down on the bed. \n(00:00) You heard movement in the corridor and quickly hid behind the curtains. A fair-skinned youth entered, whispering to the long-haired girl, and you caught the words: '…he's already dead—I saw it with my own eyes!' Then the fair-skinned youth ran out. \n(00:10) You regretted your impulsiveness—your purpose here was 'specific,' and you could repay her later once your goals were achieved. Calmly, you slipped out without disturbing the long-haired girl. \n(00:20) There was light coming from the living room, and you went to see Tian Hongjiao squatting at the entrance, looking terrified, her clothes soaked with sweat. You asked what she was doing so late, and she pointed to the front door, saying she heard noises there and was afraid to go out, fearing it might be 'bad things'—you knew she was scared of 'ghosts,' referring to 'frightening things' as 'bad things.' You discreetly pulled out your 'handgun' and went outside to investigate. \n(00:30) Outside lay a corpse—you were surprised but not shocked—apparently, you were not the only one with ulterior motives; perhaps someone was eyeing your arms. At that moment, something fell from above, and you immediately fired, only to realize it was a blood-stained 'white scarf.' When Tian Hongjiao asked what happened outside, it reminded you of old times. \n(00:40) You told her not to come out, saying there was a snake outside, then you used the 'white scarf' to pull the corpse to the window sill on the east side, letting Tian Hongjiao come out to see—watching her cautiously peek her head out before quickly retreating looked just like back in the day. \n(00:50) You sent Tian Hongjiao back to rest, noticing her husband, Yao Changshou, lying in bed, old and ugly, looking half-alive—just as you were about to test her 'insider,' Yao Changshou suddenly glared at Tian Hongjiao, saying, 'Meng Ren said he knows about the treasure, go call him here…' Tian Hongjiao's expression changed instantly, urging you to return to your room and saying the 'transaction' could wait until tomorrow. \n(01:00) You went back to your second-floor room, closed your eyes, and rested until dawn. \nThis morning (August 3rd)\nThe Yao family was already in chaos early in the morning—the corpse had been discovered—the first person to find the body, a short-haired woman, said that there had been no horse-drawn carriages leaving the village last night, meaning the real murderer must still be hiding here…\nYou went to the living room and saw everyone there, thinking that as long as you found the 'insider' and completed the 'transaction,' after another day, your subordinates would come to 'Bai Li Village' to welcome you.",
        "Relationship": "1. Tian Hongjiao: Your former fiancée, now the wife of [Zhongyi Yao], known as [Madam Hong].\n2. Du Huixin: The [General Manager Du] of a villa near 'Baili Village', who died in an explosion caused by your intrusion.\n3. Zhongyi Yao: The major landlord of 'Baili Village', who previously worked for a wealthy merchant and is known for his lustful nature. You witnessed him and another person murder [Doctor Fang] (Tian Hongjiao's uncle).\n4. You don't know the others at this time.",
        "Performance": "In the following 'performance', you must act this way at this stage, hiding the truth that hasn't been discovered by others.\n1. You come from Suzhou and are the manager of the well-known local business 'Falang Trading Company'. The owner [Anqiao Chen] is looking for a piece of land with residents nearby to establish a factory.\n2. The world is currently unstable; last year (1913), after the revolutionary army attacking Shanghai's 'Jiangnan Arsenal' was defeated, some arms were smuggled out from there (you are testing the reaction of the 'internal supporter').\n3. [Boss Chen]'s 'Falang Trading Company' is being threatened by [Liao Yiqiao] from Shanxi Taiyuan, who has come to Suzhou to establish a foreign affairs factory and poached many from 'Falang Trading Company'. Therefore, you must acquire the factory land (you explain why you won't bargain).\n4. You heard that more than a decade ago, corpses were found in the woods behind 'Baili Village'.\n5. If anyone shows hostility towards [Tian Hongjiao], you will speak up for her.\n6. If anyone shows hostility towards the 'Suzhou little girl' from back then, you will speak up for her.",
        "Purpose": "1. Find out the real culprit.\n2. Prevent others from identifying you as the real culprit.\n3. Conceal that you are the wanted 'Golden Bearded Man' and that you faked your death to escape as [Fan Jinkui].\n4. Find the 'internal supporter' and the whereabouts of the arms.",
        "Ability": "You can recognize the models and bullet calibers of the following 'marks' firearms.\n1. [*] (Browning M1903, made in the USA) 9mm pistol bullet. Your 'Ma牌橹子'.\n2. [◆] (produced by Jiangnan Arsenal, the first type of automatic rifle designed and manufactured in China) 8mm rifle bullet.\n3. [◎] (marked with 'trial production') 8mm rifle bullet.\n4. [★] (marked with 'trial production', Mauser gun appearance, specially made bullets) 8mm pistol bullet."
    },
    "Doctor Yu": {
        "Story": "Doctor Yu\nMale. In his early twenties, approximately 173 cm tall. Wears a cap, dressed in an outer coat, paired with woolen trousers.\nYou are not a true 'doctor.' Your name is [Yu Junhong], from the capital. Your father [Yu Beichen] is a geologist who studied in England (he switched to geology after abandoning the imperial examinations in the year of Wuxu). Your mother’s surname is [Ren], from a family known for practicing medicine and martial arts in the capital. As a child, you lived with your mother at your grandfather's house until he was hired as a steward in Taiyuan, then you moved to live with your father. Due to frequent relocations for work, you would only reunite with your grandfather during the New Year—under their influence, you have some knowledge of local customs and medicines, and you learned martial arts from your grandfather, which you have continued to practice.\nIn your youth (1900), you visited a villa in the suburbs of Shanghai with your father, whose owner, [Meng Shen], is a chemist and a friend of your father. Your father often helped him find experimental materials (like sulfur, nitrate, coal, etc.). Once, your father found a batch of special 'fluorspar,' which was processed and stored in 'Baili Village' nearby. There, you met [Zhongyi Yao], who is the same age as you, and his father [Yao Changshou] managed the rent for [Meng Shen] in Baili Village, where their family lived in a large house.\nThe person responsible for hosting your father was [Du Laogong], the assistant of [Meng]'s family. One day, you saw him and your father being dragged back to the mansion by a foreman named [Fan], shouting about wanting to see [Du Laogong]. Then someone rushed in and said: something happened at the back, and the 'Li brothers' didn't escape… [Fang Chengshan]'s daughter looked after you and the other children while the adults went out… When your father returned, he looked grave.\nIn 1903, [Zhongyi Yao] came to the capital for school and stayed at your home, seeming like brothers. Three years ago (1911), he returned home for mourning after his elder brother's death, and you haven’t seen each other since, only exchanging letters.\nAbout half a month ago, [Zhongyi Yao] mentioned a 'strange matter' in a letter, asking you to come to Suzhou to see him. Curious about the 'strange matter' and eager to meet a long-lost friend, you carefully saved the 'letter' and immediately headed south, beginning an unexpected and thrilling journey.\nYou arrived in Suzhou and checked into the 'Linchik Inn,' sending a telegram to [Zhongyi Yao] to wait for him to meet you.",
        "Script": "Yesterday (August 2nd) afternoon\n【Zhongyi Yao】 hurried over to pick you up. You took a horse-drawn carriage to 'Baili Village,' chatting about various topics from the late Qing Dynasty to the Republic of China, yet never mentioning the 'strange incident.' You finally couldn't help but ask, and 【Zhongyi Yao】, who had been animated, immediately lost his smile. He said, 'When I wrote to Brother Yu, I indeed wanted to invite him to investigate the 'strange incident'—little did I know it was actually a 'curse'... I have an unusual request now, Brother Yu must agree!'\nIt turned out that 【Zhongyi Yao】's father, 【Changshou Yao】, is now the village's major landlord. He suddenly fell ill not long ago, and his stepmother, 【Madam Hong】, hired a Western doctor at a high price for treatment. 【Zhongyi Yao】 wanted you to pretend to be a 'physician' returned from studying abroad, using the guise of a medical visit to avoid outsiders and privately ask 【Changshou Yao】 about something. Seeing his serious demeanor, you immediately asked what it was.\n'How did my elder brother Mengren Yao die?' He clenched his fists as he spoke.\nThe carriage had now arrived at its destination—the 【Yao】 family's grand residence (a Western-style house with a terrace) located in the north of the village, backed by a grove of trees—where you had met 【Zhongyi Yao】 years ago.\n【Zhongyi Yao】 led you to a guest room on the second floor (the room had a terrace with a low railing) and handed you the key. After settling your luggage, you went to the first-floor living room and saw the current mistress of the house, 【Madam Hong】 (who was speaking with a woman dressed as a doctor; the doctor left as you entered)—when 【Zhongyi Yao】 introduced you as planned, you were somewhat surprised by the warmth 【Madam Hong】 displayed.\nA short-haired woman with luggage entered the hall. She looked to be in her twenties, wearing a light-colored suede coat, long pants, and leather boots, carrying a long package wrapped in 'blue cloth.' She said she was looking for 【Xu Boqing】. 【Zhongyi Yao】 immediately got up and took her upstairs. 【Madam Hong】 frowned and told you, 'Physician Yu, you’ve traveled far; please rest for the night and examine my husband tomorrow.' \nYou were still thinking about the 'strange incident' and wanted to inquire. 【Madam Hong】's expression softened, and she told you there’s a tavern in the village called 'Jadeite Residence' that is quite nice; young people should try their 'daily intoxication.' Then she cautioned you not to go to the grove north of the village, as there are 'bad things' there.\nYou weren't very interested in fine wine, but were eager to know what the 'bad things' were. After leaving the residence, you immediately went there—the grove north of the village was lush, and you didn't dare enter recklessly until you discovered carved 'marks' on the trees. You knew this was a way to avoid getting lost, so you searched for 'marks' while venturing deeper.\nAfter walking for a while, you noticed something unusual—it's early August, and while the temperature in the grove was cooler than outside, the chirping of insects had mysteriously stopped... In the silent grove, it seemed you were the only 'living being.' \nYou ventured deeper into the woods. The last tree with a 'mark' had an empty 'wooden cage' hanging from it. Not far away was a patch of yellowed earth, with a gray-white two-story villa standing in the middle, overgrown with vines. The front door was firmly locked with a large lock (decorated with blue patterns), and the flat keyhole was already rusty, unsure of how long it had been locked.\nAs you walked to the east side of the villa, you saw a stone tomb, with a headstone reading, 'Grave of Mengren, the Unworthy Son of the Yao Family.' At that moment, there was a sound from the second floor of the villa. You climbed a tree and, through the branches, saw a long-haired girl in white holding a white dove, standing on the balcony. She was beautiful, but her complexion was very pale, as if she hadn’t seen sunlight for years, and she wore no makeup—an inexplicable chill gripped you as you wondered: who is she, and why is she locked inside?\nOut of the corner of your eye, you noticed the headstone move slightly. Thinking you were imagining things, you looked closely and saw the headstone slowly shifting aside, as a 'shadow' (whom you couldn’t see clearly) emerged from the ground, looking up to the sky as the headstone closed again slowly—you never believed in 'ghosts in daylight,' so you immediately thought there must be a 'mechanism' involved.\nAfter the 'shadow' left, you ran over to inspect, finding a track underneath the headstone, but couldn’t find the switch at the moment. You kept these questions to yourself and planned to return to 【Zhongyi Yao】—to ask him.\nOn your way back, you smelled a pungent odor, and upon turning around, you saw the villa on fire! You rushed back, and the flames had already engulfed the first floor, billowing black smoke that clawed at the air, accompanied by a foul smell. The long-haired girl stood on the second-floor balcony, swaying dangerously as her eyes were tightly closed. Just as you were about to shout to her, she fell from above.\nYou rushed to catch her, and as you fell to the ground, both of your arms were injured, burning with pain. The fire was growing larger, and you didn’t care about the injuries and burns. You helped the long-haired girl up and saw she was unconscious. Without time to wake her, you used one arm to support her and ran towards the woods.\nYou hadn't run far when you felt dizzy, realizing the smoke was toxic—you didn’t dare stop, the relentless flames behind you forced you to grit your teeth and persist, covering the girl’s mouth and nose with your hand, desperately pulling her along, thinking you must save her. Finally, you encountered a disheveled man, who supported you, allowing you to finally close your eyes in relief.\nWhen you opened your eyes again, you found yourself lying in the guest room bed, with 【Zhongyi Yao】 and the disheveled man helping to tend to your wounds—all the scratches on you were treated and disinfected. Seeing you awake, 【Zhongyi Yao】 quickly brought you water and kept thanking the disheveled man. After drinking the water, you fell back into a light sleep.\nYesterday evening (August 2nd)\n(? :?) You heard a 'bang' in your dreams, but couldn't wake your body up.\n(23:00) You opened your eyes, and it was pitch black outside the terrace. The 'bang' sounded again, just like before—you confirmed it wasn’t a dream.\n(23:10) You stepped out of the guest room, noticing all the doors to the second-floor rooms were closed. You walked to the second-floor balcony and saw a【mysterious man】 wearing a 'black jazz hat,' a 'white scarf' covering his face, and sunglasses at night, leaning against the balcony railing, with a 'blue cloth' on the ground.\nYou asked who he was. The 【mysterious man】 lowered his voice and concealed his true voice, saying, 'Kid, mind your own business and go back to your room!' You studied him carefully in the moonlight, but still couldn’t see his features clearly.\nThe 【mysterious man】 raised a 'fast rifle' and pointed it at you, saying, 'Kid, are you tired of living?' You immediately raised your hands, and taking advantage of his moment of inattention, you swiftly stepped forward, striking his wrist to knock the 'fast rifle' away. You then slapped his chest; the 【mysterious man】 stumbled backward, crashing into the eastern railing of the balcony. You kicked the 'fast rifle' away and picked up the 'blue cloth' to bind his arms. He struggled a few times but couldn’t break free. Suddenly, the balcony railing gave way, and he started to fall; luckily, you held onto the 'blue cloth' binding him, preventing him from plummeting.\n(23:20) The 【mysterious man】, shaken, trembled as he said, 'Th-thank you!' You released him, and he quickly dodged away, walking fast. You felt pain in your arms and hung the 'blue cloth' on the balcony to stretch your limbs, relieved that you weren’t seriously injured.\n(23:30) Returning to your guest room, you saw a tray with 'Taihu silver fish' on the ground by your door. Remembering you hadn’t eaten dinner, you picked it up and took it back to eat.\n(23:40) Suddenly feeling very sleepy, you locked the door and lay back in bed—you had never been this drowsy before... Just before entering dreamland, the last sound you heard was something falling outside the terrace...\nThis morning (August 3rd)\nYou were awakened by a knock on the door and saw a 'metal object' (like a gun) on the terrace. The person knocking was 【Zhongyi Yao】,He took you to the living room on the first floor— it turned out there was a murder. The short-haired woman who discovered the body said that the carriage had not left the village last night, and the real culprit must still be hiding here.",
        "Relationship": "1. Zhongyi Yao: The second son of [Yao Changshou], your friend who invited you here; you have a lot to ask him—growing up together, you know he is modest and has always respected his elder brother.\n2. Yao Mengren: The eldest son of [Yao Changshou], [Zhongyi Yao]'s elder brother, who passed away three years ago. [Zhongyi Yao] asked you to impersonate [Doctor Yu] to inquire about the truth of his elder brother's death from their father, [Yao Changshou].\n3. Yao Changshou: The big landlord of 'Baili Village,' you remember he used to work for the [Meng] family.\n4. Madam Hong: The younger second wife of [Yao Changshou], much younger than him.\n5. You do not know the other people at this time.",
        "Performance": "In this stage, you must behave as follows, keeping hidden truths undiscovered by others:\n1. You are a doctor who studied abroad (create untraceable experiences).\n2. Inquire about [Yao Changshou]'s condition and its cause, and how [Madam Hong] plans to seek medical treatment for him.\n3. You will defend [Zhongyi Yao]; your friend is absolutely not the murderer!\n4. You heard in Suzhou that a suspect nicknamed 'White-Headed Snake' was executed on the spot by a lieutenant dispatched from Shanxi, and Suzhou is also rigorously investigating private gun possession.\n5. You remember in 1901, when your father returned from [Meng]'s villa, he shared his experiences with your mother, and you sneaked to listen—your father said that [Du Laogong]'s son killed [Meng Shen], and he suspected that he blamed [Meng Shen]'s research for [Du Laogong]'s death, but did not expect… your father found you eavesdropping and sent you back to your room to sleep.",
        "Purpose": "1. Find the real murderer.\n2. Prevent others from identifying your friend [Zhongyi Yao] as the murderer.\n3. Uncover the truth behind the mansion fire.\n4. Discover the truth about your drowsiness yesterday (August 2).\n5. Uncover the truth of the 'strange matter' mentioned by [Zhongyi Yao].\n6. Uncover the truth about [Yao Mengren]'s death back then.",
        "Ability": "You can identify the functions or uses of the following medicines:\n1. 'Boric Acid Solution': A colorless, clear liquid, disinfectant and antiseptic. Used for disinfecting skin, mucous membranes, and wounds. Long-term repeated use may cause chronic poisoning, manifested as fatigue, loss of appetite, rashes, hair loss, etc.\n2. 'Chlortetracycline': Also known as 'Chlortetracycline.' Used for pustular skin diseases like pyoderma; it can also be used to treat mild small-area burns and ulcer infections.\n3. 'Sulfur': Also known as 'sulfur.' Appears as pale yellow brittle crystals or powder, insoluble in water. It is acidic, warm, toxic, and enters the kidney and large intestine meridians. Can prevent and treat pests; burns with a blue flame, producing sulfur dioxide.\n4. 'Opium': Commonly known as 'Big Smoke.' Derived from the poppy plant, contains morphine and can be used for anesthesia.\n5. 'Platycodon Root': Also known as bellflower, monk's cap. Its taste is bitter and spicy, neutral in nature, associated with the lung meridian."
    },
    "Uncle Gui": {
        "Story": "Uncle Gui\nMale. Hair messy, beard unkempt. Age indeterminate. Slim figure, wearing a gray long gown.\n“I am the steward of ‘Fa Lan Zhuang’, it was I who killed...” you mutter these words. For many years, you have been repeating the nightmare of that year, the pain of regret ready to engulf you at any moment, and you can only rely on medication to temporarily escape.\nYour real name is [Du Guicheng], and your family has been the steward of ‘Fa Lan Zhuang’ (the owner's surname is Meng) for generations. You once went to Shanghai to study medicine, hoping to achieve something with a few friends, but unexpectedly, over ten years ago (in 1900), your father [Du Huixin] died unexpectedly, and you returned to ‘Fa Lan Zhuang’ to take over as steward, only to become a murderer the following year (in 1901)—you were already married with children when you were arrested.\nDuring your more than ten years in detention in Shanghai, you missed your wife and children every day, but never saw them again—until recently, you used a “knife” to take a hostage and escaped from detention, putting on a long gown over your “prison clothes” to go to an old friend's house to get some money and some medicine (sleeping pills and medicinal opium; you developed a dependency on these drugs while imprisoned). Someone helped you contact your son, arranging to meet at an “old place.”\n(On August 1) You know the police are searching for you everywhere, so you hide in a donkey cart to escape the city. After bumping around for half a day, you finally stop and get off the cart, arriving at “Bai Li Village,” not far from the agreed meeting place—there is only one road into the village, and there’s a Western-style building with a terrace to the north of the village, backed by a forest— you remember that the owner of ‘Fa Lan Zhuang’ [Meng Laoye] had a lot of land in “Bai Li Village,” and also owned the ‘Fa Lang’ business in Suzhou, where he hid a batch of important items. You have been confined for too long, and the mechanical days made you forget many things—you most want to find out these important items—they must be valuable, and you owe your wife and children too much; it would be great if you could prepare some compensation before the meeting.\nSeeing that it is getting late, you go to the village tavern “Feicui Ju” to rent a room to stay in.",
        "Script": "Yesterday (August 2nd) afternoon\nYou woke up early to search the village, walking for most of the day. Outside 'Baishuang Pavilion,' you encountered a man smoking and asked for a match (you planned to use it to light 'medicinal opium'). At that moment, you remembered the hiding place was in the woods north of the village, so you went there immediately.\nThe woods were dense, and not far in, you saw thick black smoke rising from deep within, along with flames. A 'white bird' burst out from the smoke, falling just outside the woods. Feeling scared of the fire, you turned to run out—when a【short-haired woman】blocked your way, asking what happened. You were even more nervous, stuttering to concoct a reasonable explanation while reaching into your pocket for the medicine—you were afraid your habit (drug addiction) might suddenly strike.\nYou sensed someone behind you, quickly turning around to see a【young man】dragging a【long-haired girl】(he had his hand over her mouth). They were coming straight at you; the oppressive feeling was unbearable, so you steadied the【young man】only to find he was already unconscious—once you felt the threat had vanished, you calmed down.\nThe【short-haired woman】helped the【long-haired girl】up, and you noticed her pale face, tightly closed eyes, resembling someone who was poisoned and unconscious. A【fair-skinned young man】ran over—he introduced himself as【Zhongyi Yao】, the second son of the Yao family, and the【young man】was the【Doctor Yu】he invited, while the unconscious【long-haired girl】was his sister-in-law【Junmeng Chen】. The【short-haired woman】was called【Ling Yun】.\n【Zhongyi Yao】helped【Doctor Yu】up, asking what had happened—you noticed【Doctor Yu】had an injury on his arm—your emotions shifted to deep guilt, so you introduced yourself as【Uncle Gui】, claiming to know some medical skills and could help. 【Zhongyi Yao】asked【Ling Yun】to help【Junmeng Chen】into a clean bedroom on the first floor (the old room), and he took【Doctor Yu】to the second floor.\nYou met the lady of the house,【Madam Hong】, who brought medicine and accompanied you to the old room on the first floor.\nAs you diagnosed【Junmeng Chen】, she quietly woke up but said nothing. You informed her that her eyes had started to be sensitive to light and tear due to exposure to 'sulfur toxins,' and she showed signs of 'toxic visual dysfunction,' along with some burns; however, with timely treatment, there would be no aftereffects (the medicine brought by【Madam Hong】included 'boric acid solution' and 'chloramphenicol'—they were inexpensive but effective, and you also noticed a bottle of 'sedatives'). While mixing the medicine, you found the container insufficient, so you pulled out a bottle labeled 'anxiolytic' (containing sleeping pills you took from an old friend's house) and used the cap to measure the medicine. After mixing, seeing there wasn't much 'boric acid solution' and 'chloramphenicol' left, you carelessly tossed them aside.\nYou finished applying medicine to【Junmeng Chen】(you used the cap of the sleeping pill bottle to measure the mixed medicine, leaving the open sleeping pills behind) and reminded her to change the medicine in an hour; she would be fine in a few days without opening her eyes. 【Madam Hong】praised your medical skills and insisted you stay; her husband was bedridden and hoped you could check on him. You were somewhat surprised that you could still save someone, which eased your internal pain. You said you would first check on【Doctor Yu】before attending to her husband.\nCarrying the bottle of 'sedatives,' you went upstairs to check on【Doctor Yu】. He woke up as you cleaned the wounds on his arm, and【Zhongyi Yao】brought him water, repeatedly thanking you. You quietly mixed the 'sedatives' into the water for【Doctor Yu】to drink (he gave you a dangerous feeling, and just looking at his face made you uneasy). After he fell into a deep sleep, you informed【Zhongyi Yao】about【Junmeng Chen】’s condition.\nWhen night fell,【Madam Hong】took you to the main bedroom on the first floor, where you met the head of the Yao family,【Yao Changshou】. 【Madam Hong】held the lamp for you, and you saw【Yao Changshou】was aging, spiritless, with jaundice appearing on his skin and abnormal eye color. At that moment,【Zhongyi Yao】helped【Junmeng Chen】enter; suddenly,【Yao Changshou】became agitated, struggling to sit up and exclaimed, “My Mengren has returned... I saw him...”\n【Madam Hong】dropped the lamp, flames leaping up;【Yao Changshou】tore a 'handwritten booklet' beside him and threw it into the fire, prompting you to quickly stomp it out. No one spoke, only【Yao Changshou】gazed at the 'burnt paper,' mumbling, “I found it... you can’t take it away...”\n【Junmeng Chen】began to cry, and you asked【Zhongyi Yao】to take her back, reminding him to change the medicine again tonight. You meant to inquire about【Yao Changshou】's illness but felt a wave of fatigue (you feared your addiction might strike soon), deciding to continue the diagnosis tomorrow. 【Madam Hong】arranged for you to stay in a guest room on the first floor, handing you the room key.\nYesterday (August 2nd) night\n(22:00) You felt【Yao Changshou】’s illness was similar to【Junmeng Chen】’s, both caused by 'chemical toxins.' You wanted to confirm where【Yao Changshou】 had been before falling ill.\n(22:10) You sent a maid to fetch【Madam Hong】 and waited for her in the living room.\n(22:40) When【Madam Hong】 arrived, you asked if【Yao Changshou】 had been to the woods north of the village before falling ill. She said no (it seemed she hesitated before answering), then【Madam Hong】 changed her tone, saying【Yao Changshou】 would meet a guest early tomorrow, so it wouldn’t trouble you to diagnose him.\n(22:50) You found it strange;【Madam Hong】said she was going to get food for her husband and left the living room.\n(23:00) You returned to your room, feeling fatigued, the drug dependency making you uncomfortable. You took off your 'prison uniform,' ignited 'medicinal opium,' sinking into an indescribable comfort.\n(? : ?) You felt incredibly relaxed, your behavior began to spiral out of control, and memories entwined in your heart resurfaced. You were once shouting, “Murder for murder!” when you killed someone—during your imprisonment, you forgot many things but always remembered that day of murder… blood stained your hands, and the body fell before you...\n(? : ?) A knock at the door startled you awake; you told the person outside to wait, then slapped your face hard to regain some awareness and rationality.\n(? : ?) You opened the door to see【Madam Hong】and invited her in. She asked if you had been to the kitchen. You replied no, then asked her what time it was. She said it was about 'two quarters past the hour of the rat' (23:30), and you realized you had been out of it for a while. After【Madam Hong】left, you shut the door.\n(00:40) You had mostly returned to normal when you opened the window for fresh air and saw a corpse outside! Looking at your hands, it felt as if the blood of the past had stained them again; you were terrified, even wanting to flee immediately.\n(01:00) You opened the door and, seeing no one in the corridor, quietly left the mansion to your window. By moonlight, you saw the corpse hanging with a blood-stained 'white scarf.' You absolutely could not let the body be discovered outside your window—tomorrow you would meet your own son; you couldn’t afford to be suspected—especially since you were still a fugitive.\n(01:10) You used the 'white scarf' to drag the corpse away, planning to throw it into the woods north of the village. Just as you pulled it to the easternmost window bottom (outside the main bedroom on the first floor), you heard a woman’s voice ask, “Is it you?” You hurriedly dropped the corpse and ran back to the mansion.\n(01:20) You returned to your room and drank the 'sedatives,' using the drug’s power to regain calm and sleep peacefully...\nToday (August 3rd)\nIn your dream, you saw your son close at hand but couldn’t touch him; his gaze was strange and terrifying... pointing at you, saying “murderer”... You awoke from bed, only then recalling you had escaped the place of confinement...\nYou came to the living room and saw many people—the corpse had been discovered—first discovered by【Ling Yun】, who said the horse carriage hadn’t left the village last night, so the real murderer must still be hiding here... You had to get through this ordeal and rush to meet your own flesh and blood at the 'old place,' and thinking of this filled you with courage.",
        "Relationship": "1. Du Huixin: Your father, once the chief steward of ‘Fa Lan Zhuang’ near “Bai Li Village,” who helped [Meng Laoye] (the owner of ‘Fa Lan Zhuang’, a chemist) transport a batch of goods to hide in “Bai Li Village.” He died in an accident in 1900. The assistant he valued most in life, [Fang Chengshan], went missing thereafter.\n2. Zhongyi Yao: The second son of [Yao Changshou].\n3. Yao Changshou: The big landlord of “Bai Li Village,” who developed symptoms from “sulfur toxins.” In your memory, his large residence, the forest to the north of the village, and the ‘Fa Lang’ business in Suzhou all belong to the [Meng] family.\n4. Madam Hong: The wife of [Yao Changshou].\n5. Doctor Yu: You feel uneasy when you see his face.\n6. You do not know any other people at this moment.",
        "Performance": "In the following 'performance,' you must do the following in this stage; you need to conceal the truth that has not been discovered by others:\n1. Inquire where [Yao Changshou] went before falling ill.\n2. When you were studying medicine, there was a classmate surnamed [Song] (Song Ducheng), who encountered a similar condition to [Yao Changshou] during his internship. He treated it with “boric acid solution” and “golden mold,” and was scolded by the teacher, but he still insisted on this— you heard he is now a doctor at “Zhabei West Hospital” in Shanghai.\n3. When you were young, you had a period of deep resentment towards your father. You did not accept the family arrangements, resulting in a rift with him—you always wanted to venture out and even thought of using medicine to save the country.\n4. Before your father [Du Huixin] died, he sought the help of a government official to handle a collapse accident as an “accident.” You later heard by chance that the collapse resulted in casualties... At that time, your father was working for [Meng Laoye], and besides, the [Meng] family's (Fa Lang business) operations in Suzhou were managed by [Chen Qingwu], while the land rent of “Bai Li Village” was collected by [Yao Changshou].",
        "Purpose": "1. Find out the real culprit.\n2. Prevent others from identifying you as the real culprit.\n3. Prevent others from discovering that you have escaped.\n4. Conceal your drug dependency (you are addicted to opium).\n5. Find out what the [Meng] family hid in “Bai Li Village.”\n6. Discover the cause of [Yao Changshou]'s illness.",
        "Ability": "You can identify the functions or uses of the following drugs:\n1. “Boric Acid Solution”: A colorless and clear liquid, disinfectant and preservative. Used for disinfecting skin, mucous membranes, and wounds. Long-term repeated use may cause chronic poisoning, manifested as fatigue, loss of appetite, rash, hair loss, etc.—though boric acid is toxic, it can be diluted for eye washing and swelling reduction.\n2. “Golden Mold”: Also known as “Chlorotetracycline.” Used for pustular skin diseases and can also treat mild small-area burns and ulcer infections.\n3. “Sulfur”: Also known as “sulfur.” Appears as pale yellow brittle crystals or powder, insoluble in water. Can prevent and control pests, and burns to produce a blue flame, generating sulfur dioxide.\n4. “Opium”: Commonly known as “big smoke.” Derived from the poppy plant, contains morphine, and can be used for anesthesia.\n5. “Scopolamine”: A type of tropane alkaloid. When patients consume narcotic agents containing this ingredient, they enter a special “sedative state,” allowing them to accurately answer questions in an unconscious state. However, it is ineffective for psychiatric patients—because the hallucinations and false memories they experience are caused by the brain, and they firmly believe in them."
    },    
    "Junmeng Chen": {
        "Story": "Junmeng Chen\nFemale. Twenty-one years old. Beautiful appearance, long hair past her waist, pale complexion without blood color, eyes closed. Wears a white bellflower in her hair and dressed in white.\nYou were born in Suzhou, betrothed from a young age to the eldest son of the wealthy landlord family in \"Baili Village\"【Zhongyi Yao】, married three years ago (in 1911) and became a bride.\nYour father【Qingwu Chen】 and【Zhongyi Yao】's father【Changshou Yao】 both worked for the wealthy boss of \"Falang Trading Company\"【Mr. Meng】. Your father mainly handled the Meng family business in Suzhou—both families had arranged the marriage when you were young. The first time you met【Zhongyi Yao】 as children, you both wore a \"golden longevity lock\" (yours engraved with the character “Meng”). Later, when the Meng family faced a crisis, your father took over all the Meng family's assets in Suzhou.\nYour father valued money greatly—when you were young, you gave a piece of New Year's money (a silver ingot) given by your mother to a beggar outside (your mother often told you to help those in need), and servant【Shitian Chen】 said your father was furious, demanding it be returned immediately.\nOn your wedding day, your father gave you a task—he asked you to find out what【Mr. Meng】 had hidden in \"Baili Village\" and where it was, and whether【Changshou Yao】 had found it—this matter must not be disclosed to anyone, not even your husband or father-in-law.\nAlthough your husband【Zhongyi Yao】 grew up in \"Baili Village\", he admired the progressive ideas from outside and often talked to you about \"equality\" and \"freedom\"—however, he could not shed the airs of a wealthy son, treating servants with casual reprimands.\nAt that time,【Changshou Yao】 married a new wife【Madam Hong】, causing【Zhongyi Yao】 to have a big argument with him. He often told you he was fed up with this \"cursed\" landlord family, and that staying here was worse than death! You didn’t know how to persuade him, and didn’t expect those words to soon come true...\nAfter marriage, the bride and groom are customarily to visit the bride's family (return home),【Zhongyi Yao】 let you take the horse-drawn carriage first, accompanied by the maid【Anqiao Chen】 you brought from your family. However, after returning to Suzhou, you waited until late at night, and he still did not show up. After a few days without seeing him, your father sent【Anqiao Chen】 to take you back to \"Baili Village\", only then did you learn that your husband had died on the day you returned home!\nDeep in the woods north of the village (the way in can only be known by the Yao family), there is a patch of yellowed land with a gray-white two-story western-style building in the center, covered in ivy. 【Zhongyi Yao】's grave is built to the east of the building, constructed of bricks and stones, with a stone tablet in front inscribed with \"Grave of Yao Family's Unworthy Son Mengren\".\nThe main door of the building is locked with a specially made large lock (the lock has remnants of Falang decoration),【Changshou Yao】had the back wall of the building dismantled and arranged for you to live inside in mourning, sending meals daily—you then lived inside—because the first floor often had a strange smell, you resided on the second floor.\nThe meal delivery is handled by【Anqiao Chen】, who also brought you a \"wooden cage\" containing two carrier pigeons, one white and one gray—you recognized them as those raised by your father, who told you to stay safely in the building, saying it was likely the place where treasures were hidden! If you discovered anything, you were to write to him immediately and send it back to Suzhou with the pigeons.\nNot long after you settled in, you noticed the peculiarities of the building; there were no mosquitoes, and there was very little dampness. You wrote these observations down and released the carrier pigeons to send to your father. After receiving your letter, he sent the pigeons back in the \"wooden cage\" through【Anqiao Chen】. Sometimes she would hang the \"wooden cage\" in a tree outside the building, and after you retrieved the pigeons, you would leave the empty cage for her to take.\nAbout half a month ago, one night, you heard noises on the first floor, so you took a lamp to check and saw someone rummaging around on the floor. When you shone the light, he tried to escape but stepped on a rotten plank and fell, stirring up a lot of dust from under the floor, with a pungent odor. You covered your nose and saw that person crawl out of the pit and run away... You wanted to write to your father about this incident but saw that the \"wooden cage\" in the room was already empty (you had released all the pigeons that morning and forgot to hang the empty cage back in the woods).\nHolding the \"empty wooden cage\", you went out and heard children's screams from the woods. You ran over and saw a mischievous boy hiding under a tree, with several venomous snakes raising their heads and flicking their tongues at him. You quickly picked up a branch to drive away the snakes. The snakes immediately scattered, and the boy, seeing you, ran for his life...\nYou were at a loss, holding the \"empty wooden cage\" in front of the building, when you met【Zhongyi Yao】—you told him about what just happened—you didn't know the reason the snakes had fled. 【Zhongyi Yao】 assured you he would get to the bottom of this. Seeing his serious expression, you couldn't help but smile.",
        "Script": "Yesterday (August 2) afternoon\nYou only retrieved the white dove from the 'wooden cage' in the woods today. You left the 'wooden cage' in the woods and simply noted the events of that night when you encountered the mischievous kids, tying it to the dove's leg before releasing it on the balcony.\nYou watched the dove circle in the air, feeling a twinge of envy—it seemed you were also trapped in a cage, waiting for your husband's mourning period to end before starting your own life... You calculated the time; there was less than a year left.\nA pungent smell wafted up from below the balcony, and you looked down to see the first floor of the villa on fire, billowing black smoke clawing at the sky, with green flames continually licking up toward the second floor. The dove struggled through the black smoke, flying out towards the woods... The room behind you was soon engulfed in flames, and the smoke forced you to close your eyes, desperately trying to climb higher—you felt dizzy, lost your footing, and fell from above... Just before hitting the ground, you felt a strong pair of arms catch you, but before you could see who it was, you lost consciousness.\nWhen you woke up, your vision was blurred, and it seemed like you were in the bedroom of the Yao family mansion where you had once stayed with [Zhongyi Yao] (the Yao family). You saw someone in front of you, but couldn’t make out their features. They identified themselves as [Uncle Gui], and were diagnosing you. You felt very scared. [Uncle Gui] said that your eyes had become sensitive to light and were tearing up due to exposure to 'sulfur toxins,' resulting in 'toxic visual impairment,' along with some burns, but if treated promptly, there would be no lasting effects.\nThen he applied medicine (which you didn’t know what it was), advising you to change the dressing in an hour and to keep your eyes closed for the next few days. You felt somewhat reassured by his earnest words.\nYou heard a woman praising [Uncle Gui]'s medical skills, and then they left you in complete darkness, enduring loneliness as usual. After a long time, someone finally spoke to you; it sounded like [Zhongyi Yao]'s voice. You asked him to help you to the master bedroom to see your father-in-law [Yao Changshou], to pay your respects as a daughter-in-law.\nYou arrived at the master bedroom on the first floor, and before you could speak, an aged voice said, 'My Mengren has returned... I see him...' You were taken aback; at that moment, something fell, making a noise on the ground. You heard hurried breathing and the old voice saying, 'I found him... You can't take him away...'\nYou didn’t know if this was real, and unable to confirm with your eyes, you were anxious and began to cry. Then you heard [Uncle Gui]'s voice, telling someone to take you back and to remember to change the dressing again tonight. [Zhongyi Yao] helped you back to your room and changed your dressing. You asked about your husband, and he replied that his father was very ill and starting to talk nonsense.\nLast night (August 2)\n(?:?) You were unaware of the time. The following events are in chronological order.\n(?:?) You couldn't fall asleep, constantly imagining a miracle happening and your husband suddenly returning. As you recalled your brief newlywed life, you got out of bed, searching for the 'Golden Longevity Lock' from the drawer beside the bed—it had been kept there since your husband's passing.\n(?:?) You suddenly touched a woman's hand and immediately asked who it was, but received no answer. When you reached out again, the hand was gone, but you managed to retrieve the 'Golden Longevity Lock' from the drawer.\n(?:?) You heard someone come in, searching for something nearby. You clutched the 'Golden Longevity Lock' tightly, only relaxing when you heard the person leave—you realized your hearing was sharper than usual.\n(?:?) You heard a 'thud' from outside the window, coming from the western building.\n(?:?) Someone from the western building shouted [Zhongyi Yao]'s name.\n(?:?) A 'thumping' sound came from outside, longer than the previous one, but you couldn’t tell where it was coming from in the upper floor.\n(?:?) Something fell to the ground on the eastern side.\n(?:?) You heard something fall outside the main door, fear surged in your heart again. You put on the 'Golden Longevity Lock,' praying quietly, and cautiously felt your way around the room, wanting to go out and ask someone what was happening—you couldn't see, only relying on your feelings and memories, taking a long time to find the door.\n(?:?) You arrived in the corridor, hoping for news of your husband. Suddenly, a pair of strong hands steadied you. You grasped his clothing and asked, 'Is it you?' He replied, 'Yes, it's me. I haven't forgotten you all these years—the Suzhou girl... When I first saw you in Suzhou, you were wearing this ‘Longevity Lock’...' His voice was hoarse and emotional, reminding you of the first time you met your husband in Suzhou; he called you 'Suzhou girl.' Your nose tinged with sorrow, and tears streamed down your face. He immediately said, 'If anyone bullies you, I’ll take their life!' You had spent very little time with him after your marriage, but his unwavering temper had never changed—after saying this, he helped you back into the room and seated you on the bed.\n(?:?) You heard footsteps, and his voice faded away. [Zhongyi Yao]'s voice appeared in your ear, asking how your eyes were. You asked if there was anyone else in the room. He answered no—you didn’t believe him and said, 'I met your elder brother...' [Zhongyi Yao] suddenly exclaimed, 'Impossible! I saw him die with my own eyes!' As soon as he finished speaking, someone ran out, and it seemed there was another person breathing nearby, but no other sounds followed, and no one spoke to you again.\n(?:?) There was a 'thud' sound outside the main door.\n(?:?) You heard someone conversing outside the main door, including a woman's voice.\n(?:?) You heard a sound from outside the window, reaching for it, you called out, 'Is it you?' Then something fell to the east, followed by hurried footsteps toward the main door. After that, it fell silent outside. You felt anxious and removed your jewelry to rest.\nThis morning (August 3)\n[Anqiao Chen] came early to help you change your dressing and assisted you to the living room. Suddenly, someone said a corpse had been found—because the horse cart hadn’t left the village last night, the real culprit must still be hiding here. You didn’t know if your husband was in the hall now, but your intuition told you he had definitely returned...",
        "Relationship": "1. Zhongyi Yao: Your husband, the eldest son of【Changshou Yao】, died three years ago (in 1911) from illness.\n2. Zhongyi Yao: 【Zhongyi Yao】's younger brother, born of a different mother; you met him only after your husband's death, as he had been sent to study in the capital.\n3. Changshou Yao: Your father-in-law, also a former colleague of your father【Qingwu Chen】 (their former boss was named Meng), now the wealthy landlord of \"Baili Village\". Last night, he suddenly said your husband had returned, which surprised and delighted you, but【Zhongyi Yao】 said he was already ill, speaking nonsensically.\n4. Madam Hong: The stepmother of【Changshou Yao】; she did not attend the funeral of your husband.\n5. Anqiao Chen: The daughter of【Shitian Chen】, older than you, she is your cousin by blood. She came with you to \"Huli Village\" and stayed in the main house as a maid, responsible for bringing you meals, secretly relaying messages and sending carrier pigeons. You have not seen her father【Shitian Chen】 since he demanded money from the beggar (you heard he stole your father's things).\n6. You do not yet know any other people.",
        "Performance": "In the following \"performance\", you must do the following, and you need to conceal truths that have not been discovered by others:\n1. You are currently \"blind\" and cannot \"investigate\", only relying on \"memories\" and conversations to uncover the truth.\n2. Your intuition tells you that your husband has returned (even though you cannot see him).",
        "Purpose": "1. Find out the real culprit.\n2. Discover the whereabouts of【Zhongyi Yao】.\n3. Uncover the truth behind the fire in the building where you are living.\n4. Conceal the fact that you married under your father's \"task\".\n5. Discover the reason for your current \"temporary blindness\".\n6. Gather all your memories.",
        "Ability": "When you hear or see the following keywords (you cannot say them yourself), you can gain memory fragments. The contents of these memories cannot be read by others, but can be paraphrased or fabricated. Conversely, you cannot use the action of【Clue Investigation】.\n【Torn Map】\n【Wuchang】\n【Bellflower】\n【Specialized Magazine Pistol】\n【Tunnel】\n【Balcony Railing]"
    },
    "Anqiao Chen": {
        "Story": "Anqiao Chen\nFemale. In her twenties. With lowered brows and respectful demeanor. Wearing a loose-sleeved printed top and coarse pink trousers.\nYou were born in Suzhou and are a cousin of Junmeng Chen, but her father, Qingwu Chen, is very capable and made a fortune working for wealthy merchants, later taking over the business and becoming the boss of 'Falang Trading Company.' Your unambitious father, Shitian Chen, became indebted due to gambling, forcing you to seek refuge with relatives and serve the Qingwu Chen family.\nOne winter, after drinking too much, Shitian Chen pulled you close, reeking of alcohol, and revealed to you that he had discovered Qingwu Chen's secret: 'This guy has a treasure map. I stumbled upon it and took it, but unfortunately, there's only half...' You cautiously looked at the 'torn map' he pulled out, thinking it was just scribbles.\nAt that time, you were already a maid to your cousin Junmeng Chen, who was playing in the yard while you watched from a distance. There was a beggar outside, but you didn't dare approach. However, your cousin gave the beggar a piece of silver! You told your father.\nHe first called your cousin back to the house and then went out to demand the silver back from the beggar. The beggar refused, and your father scolded him for being despicable and cheating children! The beggar dropped the silver on the ground, and when your father bent down to pick it up, he struck him on the head with a brick, again and again… Blood stained the brick as your father collapsed. You were so frightened that you curled up in the corner, unable to speak. The beggar rummaged through your father's body for money and the 'torn map,' then left.\nThe murderer was gone for a long time before you began to cry, your father's blood soaking the ground... After the officials came to examine the body, a reward notice was issued. You only remembered that the beggar had a few yellow hairs in his beard and was a young man, but this was of no help in catching the murderer, and your cousin couldn't describe the man's appearance at all. Qingwu Chen vented his anger that day, and the matter faded away.\nThree years ago (1911), your cousin married the eldest son of the wealthy landlord Yao Changshou from 'Baili Village,' who was a childhood betrothal; you accompanied her to the Yao family. Before the wedding, Yao Mengren requested the bride to wear 'borage' and 'asparagus,' and you didn't know the custom, but your cousin complied.\nAfter your cousin returned home, Yao Mengren asked you to accompany her back to Suzhou, but after returning, you waited until late at night, and he still hadn't appeared. A few days later, he remained absent. Qingwu Chen urged you to quickly take your cousin back to 'Baili Village,' giving you some silver and instructing you to return immediately to inform him of any developments — none of you expected that Yao Mengren had died on the day of the visit!\nYao Changshou said Yao Mengren had contracted a contagious disease and was immediately prepared for burial. Your cousin changed from a bride into a widow, wearing mourning clothes. Yao Mengren's brother, Zhongyi Yao, also hurried back from school for the funeral.\nYao Changshou buried Yao Mengren's remains deep in the woods north of the village (the path into the woods was only known to the Yao family; you followed them for the first time): there was a patch of yellowing earth, covered by a grayish-white two-story western-style mansion, its outer walls draped in ivy. Yao Mengren's grave was built east of the mansion, constructed of bricks and stones, with a tablet in front inscribed with 'Grave of the Unfilial Son Mengren of the Yao Family.' \nThe mansion's main entrance was secured with a specially designed 'large lock' (the lock had remnants of blue decorations), and Yao Changshou had someone break open the back wall of the mansion, arranging for Junmeng Chen to live there in mourning, while you were responsible for delivering meals every day — afraid of getting lost, you carved 'marks' on the trees.\nTaking advantage of the chaos at the Yao family, you hired a carriage back to Suzhou to report everything to Qingwu Chen. After hearing you out, he paced back and forth, repeatedly murmuring 'woods,' 'mansion,' 'someone surnamed Fang,' and finally gave you a reward and a 'wooden cage' containing two carrier pigeons, one white and one gray. He instructed you to deliver the pigeons to Junmeng Chen, ensuring her safety in the mansion — this was likely where the treasure was hidden! If she made any discoveries, she should write to him immediately and send it back to Suzhou using the pigeons. You did as told.\nAfter receiving the letter, Qingwu Chen put the pigeons in another 'wooden cage' for you to bring back. Sometimes you hung the 'wooden cage' on a tree outside the mansion; when Junmeng Chen retrieved the pigeons, she left the empty 'wooden cage,' which you took back and hid in your room.\nFrom then on, you began a life of dual identities. One as a maid in the Yao family, earning the trust of Madam Hong, Yao Changshou's second wife, due to your carefulness and propriety, and the other as a liaison for Qingwu Chen and Junmeng Chen, traveling between Suzhou and 'Baili Village,' responsible for relaying messages and delivering carrier pigeons — hence, you would quietly leave 'Baili Village' in the afternoon by carriage.\nYou were not content with this life and envied Madam Hong. At this time, you learned that the second young master, Zhongyi Yao, and the deceased eldest master, Yao Mengren, were not born of the same mother; his biological mother was a maid who served the old lady, sharing your status.\nYou then had a bold idea: after Madam Hong married Yao Changshou, she did not become pregnant, and now the only heir of the Yao family was Zhongyi Yao. Although you were not a perfect match for him, the Republic had begun, and as long as he was willing to marry you, you could be like Madam Hong.\nYour only trouble was the lack of opportunity. You often followed Zhongyi Yao, hoping to find a moment alone to speak with him, but he always went into the woods alone — you could not be seen doing what you did in the woods!\nAt that time, you discovered that Yao Changshou went to the woods every night. You followed him and found he went to the grave outside the mansion, which frightened you, prompting you to hurry back.\nAbout half a month ago, you went to the woods to retrieve the 'empty wooden cage' (sometimes Junmeng Chen would forget to hang it out), and you had to return at night. That evening, you saw Yao Changshou in the woods; he entered the mansion from behind — you knew Junmeng Chen was the only one inside.\nYou waited in the woods until Yao Changshou soon ran out, the moonlight casting a glow on him. You dared not make a sound, watching him run into the woods, when suddenly a child's scream pierced the air, and you saw Junmeng Chen come out with the 'empty wooden cage.' Yao Changshou hid in the bushes.\nYou signaled to Junmeng Chen with a lantern, but unexpectedly, Yao Changshou was right behind her; he had already seen you and even tried to grab you — fortunately, at that moment, the child fled, and other voices could be heard in the woods — Zhongyi Yao appeared, prompting you to quickly extinguish the candle.\nYou left the woods and hadn't returned to the mansion when Yao Changshou seized you. Covered in dirt, he looked fearsome, making you swear never to reveal what you saw tonight, or he would leave you in the woods forever... You promised, intending to escape back to Suzhou at dawn, but the next day, Yao Changshou suddenly fell ill. Madam Hong called a female doctor, Fang, to treat him, and when you saw Yao Changshou sitting motionless on the bed after taking his medicine, unable to speak clearly, you felt relieved to stay.\nWhen you returned to Suzhou, you didn’t tell Qingwu Chen about these events, but instead asked him for a reward — you now firmly believed that the 'treasure map' your father mentioned before his death was real, and both Qingwu Chen and Yao Changshou were searching for it — you needed to obtain it before them!",
        "Script": "Yesterday (August 2) afternoon\nYou returned from Suzhou and saw Madam Hong and Doctor Fang chatting in the living room, so you took the opportunity to go to the master bedroom on the first floor, where you found Yao Changshou sleeping. You rummaged through his things and found a \"torn map (below)\" in one of his records. You were very delighted, but unexpectedly, Yao Changshou woke up. You quickly put down the things and hid behind the medicine cabinet.\nAt that moment, you heard someone come in and take medicine. Then this person quietly asked Yao Changshou about the treasure (a woman's voice) — you could only hear Yao Changshou intermittently mentioning \"secret\" and \"missing.\" Yao Changshou became agitated: \"Why are you asking him? Who are you? Why are you asking him!\"\nJust then, someone pushed the door. You peeked and saw a mysterious person wearing a \"black jazz hat,\" hiding their face with a \"white scarf,\" and wearing \"sunglasses,\" but you couldn’t see the woman who was speaking. The mysterious person walked to Yao Changshou's bedside; before Yao Changshou could say anything while pointing at the mysterious person, they covered his mouth.\nYou quickly withdrew your head and heard the mysterious person say: \"You didn’t expect me to come back, did you… The once proud Yao Changshou can now only lie on the bed struggling for life. How ridiculous — I advised you at the time, those treasures were just nonsense. You and the Chen family, your conspiracy led to nothing… You have already acquired so much land, you should live honestly in your old age — a young wife is nice — our pursuits are different, I have my own goals, otherwise, I would have returned long ago… I actually know what the treasure is — for you, it’s already of no use.\" You were both shocked and delighted; when the room fell silent, you peeked out and saw Yao Changshou lying on the bed, so you hurriedly came out.\nYou saw a short-haired woman with luggage enter through the front door; she was in her twenties, wearing a light-colored deer skin jacket, long pants, and leather boots, carrying a long package wrapped in \"blue cloth.\" She said she was looking for Xu Boqing. You didn’t know the Yao family had such a person, so you took her to the living room, where you saw Madam Hong and Zhongyi Yao, and a young man whom Zhongyi introduced as Doctor Yu. Upon hearing the short-haired woman's purpose, Zhongyi immediately stood up and took her upstairs.\nYou didn’t know the relationship between Zhongyi and the short-haired woman, so you quietly followed them into a guest room on the second floor (the one with a terrace, the middle room).\nYou returned to the first floor, and a guest arrived at the front door. You took him to the living room to meet Madam Hong and heard them discussing the sale of the northern woods. You went to the old house on the first floor (which was once the bedroom of Yao Mengren and Junmeng Chen) pretending to clean, still keeping an eye on the direction of the stairs. Soon, Zhongyi went down to the master bedroom, and when he returned upstairs, you saw Di Zhu sneaking behind him — this person claimed to be a relative of the Yao family, had a good relationship with Madam Hong, and was left behind to stay in the guest room on the second floor.\nAt this point, you needed to go to the woods to get a \"wooden cage\" — to avoid being seen, you always left the mansion through the back door and took a detour. Unexpectedly, thick black smoke rose deep in the woods, along with flickering firelight. You saw the mysterious person picking up a carrier pigeon at the edge of the woods, extracting a \"note\" from the pigeon’s leg. After reading it, he angrily threw the pigeon on the ground (it was already dead and did not move). He stuffed the \"note\" into his \"black jazz hat\" and walked toward the back door — not knowing what happened, you were afraid of being caught and hid back in the servant’s room.\nLast night (August 2) evening\n(21:50) You went to the rooftop terrace and looked out at the northern woods still shrouded in black smoke, with sporadic flickers of fire deep inside.\n(22:00) You heard someone commanding Zhongyi to come up to the terrace, and you felt scared, so you hid in the storeroom (it was empty) and pressed your ear to the door.\n(22:10) You heard: \"I... a soldier of the Republic... a criminal... Ling Yun... let Xu Boqing go to hell!\" Then you heard: \"... an affair... born of a maid... I... have evidence!\"\n(22:30) You heard someone calling \"Zhongyi,\" followed by a loud crash! You were terrified, and after hearing no movement outside, you quickly ran out, nearly stepping on a plate of \"Taihu silver fish\" (Madam Hong's signature dish). You didn’t dare to look at what happened on the terrace and ran downstairs.\n(22:40) You hid back in the servant's room on the second floor, your heart racing.\n(23:00) You heard someone talking on the balcony outside, so you opened the door a crack and saw the short-haired woman holding a \"rifle,\" and facing her was the mysterious person, still wearing \"sunglasses\" at night, with a \"black jazz hat\" and also holding a \"rifle.\" You quickly closed the door. Then you heard a crash.\n(23:10) You opened the door slightly and saw a \"rifle\" on the ground at your door. Terrified, you kicked the \"rifle\" toward the stairwell and hid back inside, locking the door tightly. Soon you heard something fall to the ground from the balcony, and people were talking; you didn’t dare to look.\n(23:20) You opened the door a crack again and saw that the \"railing\" on the balcony was gone, and Doctor Yu was standing on the balcony — you suddenly remembered that when you returned to Suzhou, you saw him at the door of the \"Lin Chi Inn\" when Zhongyi went to pick him up. After they left, the short-haired woman walked out of the inn — you quickly returned inside, not being seen by him.\n(23:50) You heard someone using a \"key\" to open the storage room next door to get something. After waiting for no sound, you dared to come out and saw a \"black jazz hat\" on the ground at the storage room door, with a person wearing a \"white scarf\" walking down the corridor toward the west end of the guest room holding \"cleaning tools.\" You didn’t dare to look anymore and forced yourself to sleep.\nThis morning (August 3)\nYou heard that Junmeng Chen had an eye illness, so you went to help her change the dressing and supported her to the living room, where the short-haired woman discovered a corpse — the horse carriage that didn’t leave the village last night means the real murderer must still be hiding here.\nYou scanned the people in the living room, unsure who to trust at this moment…",
        "Relationship": "1. Yao Mengren: Yao Changshou's eldest son, who passed away three years ago.\n2. Zhongyi Yao: Yao Changshou's second son; you want to use him to change your fate.\n3. Yao Changshou: The landlord of \"Baili Village,\" scheming for a treasure with Chen Qingwu.\n4. Madam Hong: Yao Changshou's second wife, who trusts you greatly.\n5. Junmeng Chen: Your cousin, the widow of Yao Mengren, who lives in the villa in the woods since her husband’s death.\n6. You do not currently know the other people.",
        "Performance": "In the following \"performances,\" you must act in this stage; you need to conceal the truth that hasn't been discovered by others.\n1. Ever since you witnessed your father's death, you have been very afraid of blood — you would never \"investigate\" the corpse scene.\n2. Ask why Junmeng Chen is in the mansion and what happened to her eyes?\n3. You tell everyone that Zhongyi is kind-hearted and friendly to everyone.",
        "Purpose": "1. Find out the real murderer.\n2. Prevent others from identifying you as the murderer.\n3. Discover who killed your father.\n4. Uncover the truth and location of the \"treasure.\"\n5. Conceal the message you conveyed to Junmeng Chen and the carrier pigeon.",
        "Ability": ""
    }










}