{
    "Girl in White": [
        "A diary filled with curses against Taira no Masakado.",
        "Some oddly shaped biscuits."
    ],
    "Woman in Red": [
        "A knife with faint blue bloodstains visible on it.",
        "Some oddly shaped biscuits."
    ],
    "Boy in Black": [
        "Wearing a brand-new priest outfit.",
        "A diary, with slight changes in handwriting starting recently."
    ],
    "Woman in Blue-green": [
        "Wearing an old-fashioned priest outfit.",
        "Information on Twin Grass:\nTwin Grass is a special herb in the world of spirits. It is boiled into a potion and given to two children separately. Three days later, the child who develops a twin vine mark on their wrist becomes the 'secondary branch' to the other. Initially, the 'primary branch' will be extremely weak, but as they approach eighteen years of age, the vitality of the 'secondary branch' will gradually transfer to the 'primary branch.' The 'primary branch' becomes healthier, while the 'secondary branch' weakens. After dusk, the body of the 'secondary branch' will gradually become **. When the 'secondary branch' dies completely, all the Yin-Yang sorcery they have mastered will be directly transferred to the 'primary branch.' Conversely, before the 'secondary branch' matures into ***, the 'primary branch' must remain hidden underground, never to see sunlight. In the Hoshino family, both the 'secondary branch' and 'primary branch' undergo strict training from childhood. For the first eighteen years, the 'secondary branch' temporarily represents the 'primary branch' in front of others, and on their eighteenth birthday, the inheritance ceremony is held. On the day of the ceremony, the 'secondary branch' sacrifices their life, transferring all accumulated sorcery to the 'primary branch,' marking the day the 'primary branch' truly inherits the family legacy and can walk under the sun. To carry on the Hoshino family's mission, generations of ancestors have laid millennia-old spells over the land they lived in. If the 'primary branch' or 'secondary branch' leaves this land, they will perish immediately. Being born into the Hoshino family means you can never escape this fate."
    ],
    "Little Girl": [
        "A bunch of flowers in eerie colors. A pile of slips of paper with many names written on them: Hitomi Hoshino, Atsutaka Hoshino, Keita, Tsukika, Ryoko... Keita’s name has a question mark beside it.",
        "A family tree, with the odd detail that Chiharu Fujiwara’s grandfather passed away twenty years ago."
    ],
    "Elderly in Tattered": [
        "A pair of women's wooden sandals polished to a shine, along with some shoe-repair tools.",
        "Beneath the coat is a clothing style you have never seen before."
    ],
    "Bandaged Mysterious Figure": [
        "Half a jade pendant engraved with the characters 'Hitomi.'",
        "Detailed information on the Curse of the Star:\nThe Curse of the Star is a Yin-Yang sorcery that extends the duration of other spells. It originated from the innate sorcery of the 'Baili Tribe' spirits and was later adapted by the Hoshino family. The Curse of the Star is passed down through generations and can only be mastered by the Hoshino family's priests. It can be added to other active spells or attached to the caster before the spell takes effect. If applied in advance, it can only be done a day before at most, and during the attachment, the recipient must be within three meters of the caster."
    ]
}
  