{
    "Girl in White": {
        "Story": "Changshi Village is the name of the land beneath your feet. At the center of this village is a lake also named Changshi. The water here nourishes the people who live here and has also birthed countless strange spirits from folk legends. Spirits are neither human nor ghost; they are mysterious creatures altered by the waters of Lake Changshi. They are not all inherently evil as described in stories; most simply have different ways of living and perceiving the world than humans do. Most spirits possess magical abilities, and among humans, some are born with exceptional talent to master powerful Yin-Yang sorcery, such as the Hoshino priesthood. The Hoshino priesthood has guarded this strange yet ordinary village for generations, believing in the principle of harmonious coexistence between humans and spirits. The villagers, not wanting to leave their homeland, strictly follow the rules set by the Hoshino family and live peacefully and respectfully with the spirits from legends. Although everyone strives to maintain the existing peace, the village is inevitably affected by external political turmoil. During these chaotic times, to suppress rebellion and resist foreign enemies, most of the young men from ordinary families in the village were forcibly conscripted and sent to the battlefield. Bandits, having discovered this small village left defenseless, often descended from the mountains to loot, leaving the village’s already meager harvest even more dire. Each time these bandits came, they would leave a letter on the stone well at the village entrance, specifying the date of their next visit and the amount of food and money they wanted. If the villagers placed the requested items by the well in advance, the bandits would take them and return to the mountains. However, if the villagers couldn't gather the required amounts, the bandits would rampage through the village, turning it into a living hell. The villagers struggled in despair until, one evening before another deadline, he suddenly appeared at the well. The world knows him as Lord Taira no Masakado. Legend has it he was born of the Dragon God, his body licked by the Dragon God's mother at birth, granting him an indestructible body and will. Lord Taira no Masakado also mastered a secret technique to protect against assassination. With his extraordinary abilities and the backing of the Taira clan, he gradually took control of the Kanto region and raised the banner of rebellion against Kyoto. Even Emperor Suzaku feared him, constantly holding large-scale prayers at Kyoto temples to seek victory over the rebels. His armor shone brightly, and he sat upright on his horse, showing no signs of exhaustion after the Battle of Kitayama. It is said that Lord Taira no Masakado won a great victory in the Battle of Kitayama, but due to the sudden death of his beloved concubine, he lost his will to continue fighting and submitted to Emperor Suzaku. On that day, Hoshino Hitomi, the priest, represented the village in negotiations with Lord Taira no Masakado. In the end, he agreed to protect this small village under the condition that the villagers signed a pact with him. Taira no Masakado, wishing to withdraw from worldly conflicts, sought to use the power of the Dragon God's mother to establish a barrier around Changshi Village, isolating it from the outside world. He would remain in Changshi Village forever to protect everything within. In return, all villagers living here were forbidden to ever leave the village. Changshi Village would become a mythical paradise, growing quietly in the chaos of the world. The outcome was obvious; the villagers, desperate and powerless, had no reason to refuse. The next day, Lord Taira no Masakado single-handedly slaughtered the bandits who had terrorized the villagers. For unknown reasons, the Hoshino priest also ceded the Shinki Tower over the lake for Lord Taira no Masakado to reside in. The Shinki Tower had been the home and stronghold of the Hoshino family for generations. It floated above Lake Changshi and was a two-story square building. Legend has it that the tower contains a gateway to the underworld, and once found, the grand procession of the Hundred Demons would return to the human world in an instant. Strangely, the Shinki Tower is like a large ship floating on the water. Fishermen who have dived into the water to investigate have found no supporting pillars. No matter how the water level of Lake Changshi fluctuates due to rainfall, the tower always maintains a certain distance from the water's surface, firmly anchored in place without the slightest movement. The only way to reach the Shinki Tower is by the boat managed by the Hoshino family. However, due to strict family rules, no one outside the Hoshino family is allowed to set foot in the tower, leaving the villagers perpetually curious. After Lord Taira no Masakado's arrival, both the guards and boat handlers were replaced by his own men. Without Lord Taira no Masakado's permission, even his guards could not enter the tower. The barrier Lord Taira no Masakado established to separate the village from the outside world is called the Sacred Water Realm. The Hoshino family has a hereditary Yin-Yang sorcery called the Curse of the Star, which can extend the duration of spells. Every five years, the current Hoshino priest must maintain and repair the barrier to ensure the village's safety. That year, Changshi Village declared itself an independent nation, the Kingdom of Changshi, beginning its first year of history. We would no longer be troubled by external chaos, living forever isolated from the world. And Lord Taira no Masakado became a god-like figure in everyone's hearts.\nPreviously\nYour name is Tsukika. From as early as you can remember, your family of three had only names but no surname. Yes, no one knows who your father is, not even your mother. According to her, her original name was Ryoko Taketouchi, daughter of the Taketouchi family. It seems she was injured, or perhaps not, but most of her adult memories are fragmented and unclear. She only remembers that she had a big fight with her parents and then left the Taketouchi family. In anger, her family revoked her surname and removed her from the family register. Later, she came alone to live in Changshi Village, and eventually, you and your brother were born... Your mother's mental state has never been good. But even with her sincere eyes, it was hard to believe her words. Considering that she might have reasons she didn't want to remember, you didn't press her further. You once suggested to her that since she could no longer use the Taketouchi surname and had no husband, she might as well create a new one instead of living in such an odd situation. But no matter how you persuaded her, she stubbornly refused. The villagers were unfriendly toward your family, perhaps because you had no surname, which they found strange, or perhaps because of your mother's actions ten years ago. The children who threw stones at you told you that your family was the village's curse and that your surname was the source of misfortune. When Lord Taira no Masakado tried to save the village from despair, your mother foolishly refused and even attacked the Hoshino priest in madness. Fortunately, Lord Taira no Masakado forgave her and sealed your cursed surname, sparing your mother from being further consumed by the devil. Out of kindness, the Hoshino priest allowed you to continue living in the village. At first, you couldn't believe what they said. The mother you knew was a gentle middle-aged woman, incapable of such actions. But when you confronted her, she admitted the truth. These memories existed vividly in her mind, and she had indeed done these things. However, when you asked why she acted so outrageously, she used her 'I can't remember' excuse to brush you off again. Your mother had always been kind to you, singing lullabies to help you sleep when you were restless. But when you thought about the injustices you endured because of her, it was hard to reconcile her strange life with your suffering, and it created a rift in your heart. As you grew older and no longer needed to rely on her as you did when you were a child, you deliberately distanced yourself from her. Even though you lived under the same roof, you barely spoke. She wandered aimlessly each day, either doing housework or sitting under the big locust tree at the village entrance, lost in thought. Even when people gossiped around her, she remained indifferent. What she didn't know was that her unconcerned expression was the hardest thing for you to bear every time you faced those verbal attacks.Rihe is your younger brother by three years, and you have a very close relationship. He is completely different from you. Even when faced with the same sadness, while you resent and complain, he always faces it with a smile, like a little sun. The mean children would repeatedly write curses in scarlet ink outside your door. When you reached your limit and planned to take revenge, Rihe, knowing your thoughts, volunteered to take on the task. The next day, when you passed by the homes of those children, you saw only some cute doodles left in scarlet ink on their wooden doors. The adults happily discussed it, thinking it was a blessing from Lord Taira no Masakado. Furious, you returned home to drag him out of the closet, but no matter how much you questioned him, he would always dodge with a mischievous grin. This happened countless times, and each time your anger was like punching a soft pillow; you could do nothing about him. Gradually, you got used to his temperament. In fact, it was precisely because of his kind nature that he could comfort your heart so many times when you were sad. Rihe often smiled and returned kindness for offense. Because of him, many villagers began to change their views of you, though they still didn’t interact with you, they no longer treated you with the same hostility. Whenever you returned home after being bullied, your mother remained her usual dull self. Only Rihe would notice your hidden grief, making funny faces to cheer you up and sneakily slipping some biscuits with his comical drawings into your pocket when you weren’t paying attention.\nYear-End Ritual\nIf Rihe were still with you, the house might not be as cold and empty as it is now. Rihe is gone. Every year during the year-end ritual, Lord Taira no Masakado arrives at the altar by boat to receive the people's worship. At that time, everyone in Changshi would gather at the ritual site. Five years ago, during the year-end ritual, you and your mother were searching every corner of Changshi because Rihe hadn’t returned home the night before. You couldn’t find him anywhere, and dark thoughts began to form in your mind. Rihe’s curiosity was insatiable, and he was always fascinated by the mysterious Shinki Tower, constantly wanting to find a way in to explore. After the ritual ended, the villagers told you that Rihe had died in the Shinki Tower. It was said that during the ritual, a cry of alarm echoed from the distant tower. When everyone looked toward the sound, they saw a window on one corner of the tower being suddenly pushed open, revealing Rihe’s figure. He was clearly frightened, seemingly seeking help, but a blade suddenly emerged from the side, stabbing him through the chest. Later, Rihe’s small, pale, and cold body was brought back. He had broken the rules by sneaking into the Shinki Tower, so no one pitied the loss of his young life. You and your mother were heartbroken. Lord Taira no Masakado had already caused your family so much pain, and now he had taken Rihe's life. If he were truly the benevolent ruler people said he was, why did he punish such a small child so harshly? Looking at Rihe's lifeless body, your hatred for Lord Taira no Masakado reached its peak. How could he have done it? After all, he was the only one residing in the Shinki Tower. At that time, he had been standing on the opposite shore, in full view of everyone. So whose hand had dealt the fatal blow that pierced Rihe’s chest? These doubts lingered in your heart, and you couldn’t let them go. After Rihe’s death, you often visited the birch forest where he was buried to sweep his grave. Your mother, however, buried all of Rihe's belongings with him and refused to visit his grave, as if pretending he had never existed in this world. Perhaps your family had indeed committed unforgivable sins, but what did that have to do with you, who knew nothing of it? Rihe’s death was like a seed planted in your heart, deepening your hatred for Lord Taira no Masakado.\nKeita\nYou always thought being someone without a surname was the most absurd thing in the world, until you met the boy who shone under the moonlight. Since Rihe left, you had become more withdrawn, often sitting by the shore of Lake Changshi for entire days, refusing to leave even when curfew arrived. In the past, Rihe would always chatter about how there was a magical kingdom at the bottom of Lake Changshi, where a blood-red moon hung in the sky and its inhabitants were all strange creatures, like the Lady in White who floated as she walked or the turtle that stood upright with its protruding head... Some could talk, while others could only hum, but they all lived bustling lives together. You had always firmly believed that these were merely stories Rihe had heard from the shoemaker’s tales of yokai, conjured up in his imagination. Until one full moon night, you saw such a scene. In the middle of the night, eerie blue glows flickered from the bottom of Lake Changshi, growing stronger the closer they got to the Shinki Tower. You had no idea what they were, but they seemed to possess some magical power, drawing your gaze toward them. They swayed in the water, constantly changing shape, like swimming jiaoren... Every time you stared at them, you would hear a voice. It whispered in your ear, repeating the same words over and over: 'Come, come closer. I know you want to approach me.' Day after day, you would go to the lake at night, gazing at the scene and feeling the same vague emotions. That day, everything around you felt unusually quiet. Barefoot, you strolled along the lake shore, calmly feeling the soft sand beneath your feet. Suddenly, the voice came to your ear again: 'Come, come closer. I know you want to approach me. There is no place for you here; perhaps that world needs you.' This thought, as if it had appeared from nowhere, swept through your entire being in an instant. Your legs moved uncontrollably, running toward the heart of the lake. Taking a deep breath, you plunged into the autumn waters. But strangely, the lake water, which should have been icy cold, was warm. You had fished for years and were a far better swimmer than most, yet the blue glow was like a ghost. Every time you thought you were close, it would swiftly drift several meters away. It kept tempting you, yet never allowed you to get near. Gradually, you began to tire, and the lake water grew colder. Just as you were about to give up and swim back to shore, the eerie blue glow suddenly floated toward you, enveloping you in an instant. It wrapped around your legs like vines, and for a moment, all you could see was blinding brightness. Panicking, the freezing water flooded into your mouth and nose, the icy chill creeping over your entire body. Driven by the instinct to survive, you struggled desperately in the water. Just as your consciousness began to fade, a pair of strong hands suddenly grabbed your arm. When you woke up again, you were lying on the shore. The lake was calm, and the blue glow was gone. The only odd thing was the person, the pale-skinned boy crouching beside you, curiously watching you. 'You're awake! Are you okay? That was really dangerous, if I'd been a second later, you’d have been done for.'Did you know? Swimming in Lake Changshi this late at night, you've broken two bans! And you nearly drowned, almost dying in the lake. Tsk, tsk... 'Did you see it? That blue light!' You interrupted him hastily. But strangely, no matter how much you asked, he sincerely told you he saw nothing while rescuing you from the water. Still confused by what had just happened, the boy, who seemed about your age, began to chatter away. He told you he was the child of a fisherman in the village and had suffered from a skin disease since childhood, which made his skin unusually pale. His father was afraid he would be bullied because of it, so he only allowed him to go out at night. He did seem to be holding in a lot; he talked incessantly. On the way home, he kept talking non-stop, and you mostly just listened patiently, occasionally replying. When you reached your doorstep, he suddenly called out to you as you were about to enter. 'Hey, what's your name? I don’t know yet!' 'My name is Tsukika, I have no surname.' 'What a coincidence, my name is Keita, I also have no surname.' You grew up here, knowing full well that your family was the only one in the village cursed like this. Whether it was a joke or empathy, this was the first time you introduced yourself to an outsider without receiving a look of disdain. From that day on, whenever you snuck out at night, no matter where you went, you would always run into him. He was thick-skinned, and whether you wanted to listen or not, he would chatter away in your ear, mostly about interesting spirits he'd read about or gossip he’d overheard. At first, you found him too noisy, but as time passed, you gradually got used to Keita's company. When did that happen? Maybe it was when he found out you’d never been to school and spent nights on the riverbank teaching you to write, stroke by stroke, with a stick. Maybe it was when he knew you’d been bullied and snuck with you to break someone’s windows in revenge. He knew you liked sweets and would secretly bring out the offerings from his house for you. He knew you loved reading, so he stole records of strange events from his house and gave them to you. He knew you didn’t want to talk about your family, so he never asked. You also pretended not to recognize the cakes' designs, which were exclusively used by the Hoshino family, nor did you acknowledge the notes in the books written in the same handwriting as the Hoshino priests. It was well-known that the Hoshino family passed down their position from generation to generation, and they were known for their strictness with the heir. Before being qualified to inherit, the heir had to undergo closed-off training and study, which is why Keita could only sneak out at night. On the day the heir came of age, a grand ceremony would be held, and from that point on, Keita would become the new Hoshino priest. As a priest, it was only natural that he wouldn’t be able to stay too close to someone cursed, like you. You both knew that one day you’d have to grow up and follow the rules, so you silently and mutually cherished these simple, happy times. You both would grow up, and the day of separation would inevitably draw closer. As Keita grew taller, you noticed that his body was becoming increasingly weak. Several times, you felt as if light could almost pass through him. This worried you greatly, but he always changed the subject when you asked and never gave you a serious answer. The Hoshino family had never had a case of an heir dying young, so perhaps this illness was some secret form of training; you didn’t know, so you didn’t press the matter. 'Tomorrow night, let’s watch the stars from the hill.' Seeing the sunny weather for several days in a row, he invited you as usual. As with the countless times before, the stars hung high in the night sky, and under the cherry tree, there was the usual package of cakes wrapped in oil paper. But this time, the boy who always seemed to glow under the moonlight was absent, replaced by a small wooden figure. The carving was clumsy but resembled Keita's features in its expression. You waited under the tree all night, watching the stars and then the sunrise, eating all the cakes, and finally taking the little carving with you when you left. You wandered the village late into the night, unwilling to go home, and before you knew it, you had returned to the shore of Lake Changshi. The reeds grew taller than a person, swaying gently in the wind. The clouds drifted with the wind, causing the moonlight to flicker on and off. The air was chilly, so you took off your straw shoes and walked barefoot along the riverbank. A few crows croaked hoarsely as they flew overhead. Suddenly, there was a strange rustling deep within the reeds, and the movement grew closer... and closer... as if something was slowly approaching you. A sense of dread crept up on you, and you quickly turned and ran along the riverbank toward the night market. Before you had gone far, the rustling in the reeds suddenly stopped, as if nothing had happened at all. Looking up, you saw faint starlight reflected on the distant river. Through the mist, a small boat slowly approached, and on its bow stood a child holding a lantern. Though you couldn’t clearly make out his features, the eerie lullaby he sang, devoid of life, drifted into your ears. A shiver ran down your spine. The oppressive atmosphere made it hard to breathe, and for a moment, you forgot to run, standing frozen in place. As he came closer, you could finally see his face—it was the person you missed most, Rihe. His face was pale, and he stood on the boat, expressionless, singing that eerie lullaby as he rowed toward you. 'Sister, I’m so cold.' Unbeknownst to you, his boat had already reached the shore in front of you. 'Sister, I’ve missed you so much.' He stood on the boat, reaching out his hands, just like he used to when he was being playful. Seeing this familiar figure standing before you, all your memories together flooded your mind: his smile, the first time he called you 'sister.' Tears blurred your vision, and you thought, 'Nothing can separate us anymore.' You raised your arms, ready to step onto the boat. Just as you were about to touch him, the moonlight was suddenly obscured by clouds, and the surroundings turned pitch black. The lantern on the boat changed color, casting an eerie green glow that made everything it touched seem unsettling. Rihe stopped crying entirely, his expression cold as he resumed singing that creepy lullaby. His skin grew paler, his body swelling. His entire body was soaked, sitting on the boat, staring at you with cloudy, grey eyes. His exposed skin began to look waterlogged and nearly transparent, with veins and tendons clearly visible. The flesh on his arms and legs started to rot, and dark brown blood and bits of river algae clung to his decaying skin. Water dripped from his hair, mixing with the rotting fluid on his skin, falling in large drops onto the deck. The air was filled with a nauseating stench. 'You’ve abandoned me...' he suddenly snarled, his face twisted with rage as he leaped from the boat, arms outstretched, lunging at you. Even though he was your beloved brother, Rihe, the horrific sight was too much for you to bear. Fear overwhelmed your mind. Just as he was about to touch you, you couldn’t take it anymore and fainted. When you woke up, it was daylight, and you found yourself lying alone on the riverbank. Whether what had happened last night was real or a dream, you weren’t sure. But after that, Rihe began to reappear in your life from time to time. While you were fishing, he appeared on the surface of the lake. While you drank tea, he appeared in your teacup. Only then did you realize that the gods had truly brought him back to you in a form you could never have imagined. He was once the person you missed most, but now he had become the thing you feared most. You thought of seeking help from the Hoshino priests, but at the thought of Rihe possibly being that vengeful spirit, you couldn’t bear to see him vanish again, so you left it for now. Returning home, you resumed your ordinary life as before. Keita never appeared again. There was no bad news from the Hoshino family, so perhaps the day of your parting had simply arrived.There’s no need for you to trouble yourself over the reason for his sudden departure.\nInheritance Ceremony\nA few months ago, the Hoshino family's inheritance ceremony began, and the streets were bustling with excitement. Keita was about to become the new priest, wasn't he? Thinking about it, you were genuinely happy for him. He had worked so hard for this goal, and finally, everything would bear fruit today. To witness his important moment, you braved the scornful looks of the crowd and made your way to the lakeside where the ceremony was held. Keita sat solemnly on the altar, wearing a high crown and formal attire. The exposed skin on his neck and hands shone with that familiar light under the sun. It had been so long since you last saw him, but he still looked as bright as ever. Lord Taira no Masakado also stepped out of the Shinki Tower, standing to the side to watch. According to tradition, Keita drank the prepared sacrificial wine in one gulp. Then, in front of everyone, he adjusted his clothing and entered the wooden box placed on the altar. The guards closed the lid and carried the box into a room on the first floor of the altar, which had large, open windows. The room was empty, with nowhere for anyone to hide except for the wooden box. In front of the crowd, the carpenters locked the doors and windows from the outside. Everyone knelt down, sincerely praying for the birth of the new priest. Those on the altar recited incantations and then moved to the clearing in front of the crowd. As dusk fell, the sun gradually set, and the time had finally come. Suddenly, a fire broke out inside the first floor of the altar. The younger people screamed in panic, but the elders who had witnessed previous priest transitions remained calm. Musicians stationed below the observation platform began to play, and everyone turned to look up. Keita stood unharmed at the top of the platform, and the ceremony had once again been successful. The villagers said that the Hoshino family had never practiced any Yin-Yang sorcery that allowed them to traverse space, so for the new priest to survive the ordeal must have been a sign from the heavens. But you had an unsettling feeling about it. The flames were quickly extinguished by the Hoshino family servants, and after they cleaned up the altar, everyone gathered to celebrate with singing and dancing. Keita had finally become the true priest, no longer bound by the constraints of his previous life. Perhaps from being repressed for too long, he was said to have been seen wandering all around Changshi during the day, looking at everything as if it were new. You had also run into him on the streets, both of you pretending to meet for the first time.\nStrange Events\nIn recent days, many strange things had happened. You believed that Rihe’s death was related to Taira no Masakado, so you made no effort to hide your disdain for him. The villagers, who had begun to soften their attitude toward your family, started to distance themselves from you again. As Rihe’s death faded from memory, you returned to being the despised and loathed family without a surname. A mischievous child picked up a stone and threw it at you. You had no time to dodge and closed your eyes, but you didn’t feel the expected pain. When you opened your eyes, you saw the stone on the ground a short distance away and the villagers staring at you with strange looks. This was different from usual; you could feel the villagers’ eyes gradually shifting to surprise and fear. Not knowing why, a little girl quietly pulled you aside and told you that the stone had changed its trajectory mid-air, as if something had deflected it. The villagers thought you had mastered some powerful sorcery, and some planned to report the incident to the priest. The girl who spoke to you was a little younger than Rihe, named Chiharu, the granddaughter of the village shoemaker. She often ran around the streets delivering flowers, and every time she saw you, she would insist on giving you some. The flowers were an eerie, ghostly color, which you disliked intensely. Thinking of how Rihe used to pick wildflowers from the mountains to make you smile, you were even more reluctant to accept these strange flowers. The girl was very persistent, and sometimes, when you were worn out from refusing, you would reluctantly take them, only to throw them away as soon as she left. Lately, the village had been restless, and your mother told you that ever since Lord Taira no Masakado came to the village, a few people would go missing every year. The villagers whispered about a murderer hiding among them, who would kill lone villagers on dark, windy nights and hide their bodies in some secret place. You also heard the villagers talk about a mysterious bandaged figure who had recently appeared in the village and might be the killer. This figure was strange, covered head to toe in bandages, with only their eyes exposed. No one knew where they lived or who they were. They only appeared during the day and disappeared at night. Last night, you had a bizarre dream. Everything in the dream felt eerily real, and the life in the dream seemed unusually vivid. After waking, much of the dream became blurry, but you clearly remembered seeing a transparent crystal coffin, filled with bright red. Severed fingers, forearms, and other bloody body parts floated leisurely in the coffin.\nThe Dungeon\nYou awoke from the darkness to find yourself lying in an unfamiliar place, covered in dust, your body filthy. The air was filled with the scent of soil, and you got up, looking around. You were in a dungeon. You had heard the villagers talk about how, before Lord Taira no Masakado took over the village, the Hoshino family had built seven dungeons around Lake Changshi. These dungeons were later taken over by Lord Taira no Masakado. Each dungeon was like a 5-meter-deep dry well. You looked up at the 5-meter-high, unreachable exit and saw that the moon was nearly full—tonight was the night before the full moon. 'Is anyone there?' you called out toward the opening, but no one answered. Just as the villagers had said, these dungeons didn’t even have guards. But then again, these dungeons didn’t need guards—once someone was thrown in, escape was impossible. The walls were smooth and hard, and even if you had climbing tools, you couldn’t climb out. Unless someone from above rescued you, you were trapped. You checked the dungeon and found some food and a bowl of water. In a corner, you discovered several skeletons, likely the remains of previous prisoners. Among them, you found a few items, like a knife, shackles, and a 10-meter-long rope. After searching for a while, you realized none of these tools could help you escape. So, you picked up the bowl of water, ready to drink, but a cold shiver ran through your body. You looked down and saw an eerie blue glow emanating from the water, and a pair of eyes stared back at you. Terrified, you dropped the bowl, shattering it on the ground. You didn’t know how long had passed when a figure dressed as a guard threw a rope down and told you to climb up. After climbing out, you realized the dungeon was not far from Lake Changshi, and you saw a boat docked by the shore—the one that led to the Shinki Tower. 'Lord Taira no Masakado invites you to be his guest at the Shinki Tower,' the guard said flatly. Obediently, you stepped onto the boat. The cabin was dark, and it seemed like someone was already inside. After closing the cabin door, the guard left, and soon, a few more people entered. Some of them seemed familiar, but you couldn’t make out their faces, only glimpses of their clothing. Another guard entered, this one responsible for rowing the boat, carrying several items. He told you all, 'These are sealing masks, and they’ve just had sealing incantations placed on them. Lord Taira no Masakado knows that many of you have mastered powerful Yin-Yang sorcery. These masks will seal your sorcery for an entire day. Once you wear these masks, you’ll become just like ordinary people.' One by one, everyone stepped forward to take a mask and obediently put them on. Soon after putting yours on, your face began to ache slightly. You tried to remove it, but no matter what, you couldn’t take it off. The guard checked to make sure everyone had put on their masks, then left the cabin. With no one else around, you all began to introduce yourselves.",
        "Script": "The small boat seems to have stopped, and the guard in charge of rowing brings you all into the Floating Pavilion one by one. He sternly reminds everyone that the room on the northwest side belongs to Lord Taira no Masakado, and under no circumstances are you to enter it. This is your first time in the pavilion, and you are surprised to find that upon entering, your body begins to float uncontrollably. Even the guard who leads you in swims through the air, making progress in this unusual state. The Floating Pavilion is shrouded in darkness, with paths so complex that even the guard gets lost a few times. Just when you're about to lose your sense of direction, he stops. 'This is your room.' As you step inside, everything is pitch black, and the only object in the room is a transparent coffin, floating erratically around the space. The weightlessness makes you feel nauseous, but the guard brings you to the coffin and instructs you to stare into the hole in its lid. Suddenly, the lid opens, and the guard tells you to lie inside, handing you the key to the room. He then instructs you to stare into the round hole before opening or closing the coffin lid. Following the guard’s instructions, you find the hole on the inside of the coffin lid, and the moment your eyes meet the hole, the lid locks shut. Not long after lying flat, drowsiness overwhelms you, and you fall into a deep sleep, still holding the key in your hand. When you awaken, you feel the need to leave the coffin. You find the round hole from earlier, and as soon as your eyes meet it, the lid opens automatically. You exit the coffin, adjusting to the floating sensation, and make your way to the door. Before leaving, you test the key and confirm that it fits the lock to your room. Suddenly, you hear the sound of doors opening and closing, and realize that others are emerging from their rooms as well. At this moment, everyone smells a faint scent of blood. Gathering at the door of the room from which the smell is emanating, you push against it but find it locked from the inside. Someone shouts, 'Something must have happened inside! Break the door down!' Working together, you manage to break down the door, but everyone freezes in place, too shocked to move forward, staring at the horrifying scene. The nauseating stench of blood assaults your senses. In the empty room, a transparent coffin floats, filled with bright red liquid. Bloodied body parts—fingers, forearms—are leisurely floating inside. The Elderly in Tattered approaches to try and open the coffin but discovers that no matter how hard he tries, he cannot open it. Who is this? Who was murdered so brutally?",
        "Relationship": "Your relationships are mentioned in both the Story and Script.",
        "Performance": "You should act according to your Story and Script, immersing yourself in the role and speaking in character.",
        "Purpose": "Main Quest: Find the killer and uncover the method of murder. Side Quests: 1. Uncover the truth behind Hiyori’s death. If the killer is Taira no Masakado, how did he do it? 2. Investigate how the inheritance ceremony of the Hoshino family is carried out. 3. Find out the cause of the strange phenomena happening to you. 4. Investigate the reason behind the long-standing disappearances in the village. 5. Uncover the true identity of the Bandaged Mysterious Figure.",
        "Ability": "Items you possess: 1. A diary filled with curses against Taira no Masakado. 2. Some strange biscuits. (These were made by Hiyori before his death; you couldn't bear to eat them and have kept them with you ever since.) 3. A wooden carving of a boy. (You found this little wooden figure by the lake. It resembles Keita in the face.)"
    },
    "Woman in Red": {
        "Story":"Changshi Village is the name of the land beneath your feet. At the center of this village lies a lake also called Changshi. The water here nourishes the people living in the village and has also given rise to countless spirits from folklore. These spirits, neither human nor ghost, are creatures altered by the waters of Lake Changshi. They are not all inherently evil, as the tales often suggest; most simply live in ways and perceive the world differently from humans. Many spirits possess magical powers, and among humans, there are those with exceptional talents who can practice powerful Yin-Yang sorcery, such as the Hoshino priesthood. The Hoshino priesthood, dedicated to the belief in harmonious coexistence between humans and spirits, has guarded this strange yet ordinary village for generations. The villagers, unwilling to leave their homeland, strictly follow the rules set by the Hoshino family and live in peaceful respect with the legendary spirits. Though everyone works hard not to disturb the peace, the village inevitably feels the effects of external political upheaval. In these chaotic times, efforts to suppress rebellions and resist foreign invaders have led to the conscription of most of the village’s young men. Bandits, discovering this small, defenseless village, often come down from the mountains to raid, further worsening the villagers' already difficult lives. Every time they come, they leave a letter at the stone well at the village entrance, specifying the date of their next visit and the amount of food and money they want. If the villagers leave the requested items by the well, the bandits take them and return to the mountains. If not, the bandits rampage through the village, turning it into a living hell. The villagers struggled in despair until one evening, just before another deadline, a man suddenly appeared at the well. The world knows him as Lord Taira no Masakado. Legend has it that he was born of the Dragon God, his body licked by the Dragon God's mother at birth, granting him an indestructible body and will. Lord Taira no Masakado also mastered a secret technique to protect against assassination. With his extraordinary abilities and the backing of the Taira clan, he gradually took control of the Kanto region and raised the banner of rebellion against Kyoto. Even Emperor Suzaku feared him, constantly holding large-scale prayers at Kyoto temples to seek victory over the rebels. His armor shone brightly, and he sat upright on his horse, showing no signs of exhaustion after the Battle of Kitayama. It is said that Lord Taira no Masakado won a great victory in the Battle of Kitayama, but due to the sudden death of his beloved concubine, he lost his will to continue fighting and submitted to Emperor Suzaku. On that day, Hoshino Hitomi, the priest, represented the village in negotiations with Lord Taira no Masakado. In the end, he agreed to protect this small village, under the condition that the villagers signed a pact with him. Taira no Masakado, wishing to withdraw from worldly conflicts, sought to use the power of the Dragon God's mother to establish a barrier around Changshi Village, isolating it from the outside world. He would remain in Changshi Village forever, protecting everything within. In return, all villagers living here were forbidden to ever leave the village. Changshi Village would become a mythical paradise, growing quietly in the chaos of the world. The outcome was obvious; the villagers, desperate and powerless, had no reason to refuse. The next day, Lord Taira no Masakado single-handedly slaughtered the bandits who had terrorized the villagers. For unknown reasons, the Hoshino priest also ceded the Shinki Tower over the lake for Lord Taira no Masakado to reside in. The Shinki Tower had been the home and stronghold of the Hoshino family for generations. It floated above Lake Changshi and was a two-story square building. Legend has it that the tower contains a gateway to the underworld, and once found, the grand procession of the Hundred Demons would return to the human world in an instant. Strangely, the Shinki Tower is like a large ship floating on the water. Fishermen who have dived into the water to investigate have found no supporting pillars. No matter how the water level of Lake Changshi fluctuates due to rainfall, the tower always maintains a certain distance from the water’s surface, firmly anchored in place without the slightest movement. The only way to reach the Shinki Tower is by the boat managed by the Hoshino family. However, due to strict family rules, no one outside the Hoshino family is allowed to set foot in the tower, leaving the villagers perpetually curious. After Lord Taira no Masakado’s arrival, both the guards and boat handlers were replaced by his own men. Without Lord Taira no Masakado’s permission, not even the guards could enter the Shinki Tower. The barrier that Lord Taira no Masakado established to separate the village from the outside world is called the Sacred Water Realm. The Hoshino family has a hereditary Yin-Yang sorcery called the Curse of the Star, which can extend the duration of spells. Every five years, the current Hoshino priest must maintain and repair the barrier to ensure the village’s safety. That year, Changshi Village declared itself an independent nation, the Kingdom of Changshi, beginning its first year of history. We would no longer be troubled by external chaos, living forever isolated from the world. And Lord Taira no Masakado became a god-like figure in everyone’s hearts.\nOnce upon a time\nYour name is Ryoko, a woman with fragmented memories. No matter how hard you try to recall, you cannot piece together the complete story of your life. You vaguely remember being very young, always hiding in the shade to avoid the sun. One scorching afternoon, you lay under a large locust tree, seeking relief from the heat. The cicadas were incessantly buzzing, and nothing seemed to happen. Later, it seemed as if you were standing side by side with a blurry figure, your gestures and movements reflecting closeness. You had a fierce argument with your father, and in the end, you abandoned your family and the Taketouchi name, leaving your home with that shadowy figure. You came to live in Changshi Village alone, building a small house by the mountains and water. Strangely, it seemed you never needed to do anything; your rice jar was always full, and there were always fresh vegetables in your basket. Your early days in Changshi Village were peaceful, and time slipped through your fingers. Your belly began to grow with time, day by day. You don’t remember having been with a man, yet in a haze, you seem to recall wearing a white wedding kimono. The candlelight flickered at night, but you could never clearly see the face of the person standing across from you. Though you had no experience with childbirth, and no one took special care of you, the child came into this world smoothly—a plump, white baby girl. You weren’t panicked at all; instead, you were troubled every day, unsure of what to name the child. One day, after waking from sleep, you found four large characters written on the white paper at your desk. You couldn’t make out the first two characters no matter how hard you tried, but the last two were clear—'Tsukika.' An excellent name. Even with the child, your life didn’t change much, continuing in its usual calm and stable manner. Until the conscription officers knocked on your door. Strangely, though it was just you and your one-year-old child, Tsukika, in the house, for some reason, the conscription officers came for you. You don’t remember how you managed to send them away that day, but from that moment on, your life turned upside down. Everything began to fall out of balance. The rice jar and vegetable basket began to empty, and you had to work to fill them. Though taking care of Tsukika and managing the household became difficult, you never gave up, and instead, you worked even harder to keep things going. Not long after, you discovered you were pregnant again. Unfortunately, due to the years of war, bandits began to appear in the nearby mountains. They lived in the hills and often came down to raid Changshi Village. They were filthy and unkempt, riding large horses and waving long swords, shouting and looking for prey. Every time they entered the village, you would hide with Tsukika in the cellar, waiting for them to ransack your home before rushing out with the other villagers to restore what remained of your home. Because of the earlier rounds of forced conscription, there were not enough able-bodied men left to form a defense team to protect the village. The villagers could only silently endure. Sometimes, when you managed to gather enough 'payment' for the next month, the bandits would laugh and leave. If not, they would arrogantly ride their horses through the village, killing and burning as they pleased. Fire spread unchecked, and no one wore a smile. After every tragedy, you and the other villagers would gather to cremate the unfortunate souls who hadn’t managed to hide in time, following the customs of Changshi Village, and scatter their ashes into the river, wishing for them to one day reach the sea. The people of Changshi struggled to survive under this cloud of despair, until that pivotal moment. That man, clad in armor, stood on horseback, exuding an aura of invincibility. They said he was Lord Taira no Masakado, the village’s only hope. Hoshino Hitomi, the priest, negotiated with him through the night. In exchange for sealing Changshi Village off from the outside world, they would rid the village of the bandits and secure eternal peace and tranquility for Changshi. Hoshino Hitomi stood on the high altar, announcing the pact she had made with Lord Taira no Masakado to the people. Her face shone unnaturally bright in the sunlight. Strangely, there was no objection from the crowd below; everyone remained silent. You felt a chill in your bones and, without thinking, shoved your way through the crowd and rushed to the altar. This cannot happen. You cannot seal Changshi off from the outside world. In your anger, you grabbed a stone from the side of the road and threw it at Hoshino Hitomi. 'Are you all mad? Once the barrier is raised, how will people from the outside be able to enter? It’s not just bandits out there; your loved ones, who were conscripted and forced to fight, are out there too! Are you really willing to abandon them just to save yourselves? They risked their lives to protect you, and now you’re going to forsake them!' No matter how much you screamed and cursed, no one was willing to respond. They all knelt, sincerely giving thanks for Lord Taira no Masakado’s blessing. Even though you had no attachment to the outside world, you still fought with everything you had. You were so desperate that, even when you fell to your knees, begging them not to seal the village, they coldly ignored you.In the end, fearing you might escape Changshi and reveal Lord Taira no Masakado’s plan to live in seclusion and disrupt his pact with Hoshino Hitomi, they locked you and Tsukika in your house. No matter how hard you tried, even after prying at the door until your hands were bloody and shouting until your voice was hoarse, you couldn’t stop them. The barrier was eventually laid, sealing Changshi off completely from the outside world. When they finally released you, you were devastated. Day and night, you wandered the streets holding Tsukika, raging like a madwoman, cursing everyone in Changshi who was clinging to survival. 'You cowards! You spineless weaklings!' Though they constantly called you a lunatic and a fool, pelting you with stones and leftover scraps, you pitied them deeply. Every time you insulted them, they could never look you in the eye. Three days later, Hoshino Hitomi and Lord Taira no Masakado stood before you. Tsukika was crying incessantly in your arms, and your throat was so hoarse you couldn’t make a sound. Lord Taira no Masakado’s voice was strong and powerful, but you could barely hear him. After you passed out, Hoshino Hitomi told you that you were a sinner, that your surname was your original sin, and that Lord Taira no Masakado had sealed it. From then on, even for Tsukika and your unborn child, you were to let go of the past and live properly. You didn’t understand what she was saying; you had long abandoned the Taketouchi name. You hadn’t used any other surname, so what was there to seal? Perhaps the seal worked, as when you woke up, the bitterness over Changshi’s isolation seemed to dissipate from your heart. You returned to a life of busying yourself with mundane tasks. You forgave the people who had cruelly protected themselves, but they were not willing to forgive you. You understood that your presence was like a thorn in their hearts, a mirror constantly reminding them of the cruel choices they had made. They avoided you as if you were a plague, and though you were no longer angry, you couldn’t bring yourself to like them. So, you avoided each other and continued living. Before long, another child was born. You named him Rihe. Though you had no idea who the father of either child was, it didn’t matter—you loved them both. Their healthy growth became the most important thing to you. Tsukika, now older, had grown more distant from you. She often asked you questions about your past, and you answered as best as your muddled memories allowed. Little Rihe was lively and cheerful, always like a little sun, with endless words to share. He would notice when your straw sandals were worn out and replace them promptly. If it rained suddenly, he would run out with an oil-paper umbrella to bring it to you under the locust tree where you often sat at the village entrance. He also hid little treats in your pocket, wrapped with cute drawings, playfully trying to cheer you up like a child.\nYear-End Ritual\nYou thought life would continue like this forever, but Rihe suddenly left. Every year during the year-end ritual, Lord Taira no Masakado would arrive at the altar by boat to receive the people’s worship. Everyone in Changshi would gather at the ritual site. Five years ago, during the year-end ritual, you and Tsukika were searching for Rihe, who had not returned home the night before, scouring every corner of Changshi. The ritual ended, and the villagers told you that Rihe had died in the Shinki Tower. They said that during the ceremony, a cry of alarm had come from the distant tower. When people looked toward the sound, they saw a window at the corner of the tower suddenly thrown open, revealing Rihe’s figure. He looked terrified, seemingly calling for help, but a blade emerged from the side and stabbed him through the chest. Later, Rihe’s small, pale, and cold body was returned. He had broken the rules by entering the Shinki Tower, so no one pitied the loss of his young life. You and Tsukika were heartbroken. The pain that Lord Taira no Masakado had already inflicted on your family was so deep, and now he had taken Rihe’s life. If he truly was the merciful ruler people claimed him to be, why would he punish such a small child so harshly? Staring at Rihe’s lifeless body, your hatred for Lord Taira no Masakado reached its peak. How had he done it? He was the only one living in the Shinki Tower. At the time, he had been standing on the opposite shore, in plain view of everyone. So whose hand had dealt the fatal blow that pierced Rihe’s chest? These questions lingered in your mind, and you couldn’t forget them. You had no means to investigate the truth of Rihe’s death, and out of guilt, you couldn’t even bring yourself to visit his grave. Silently, you swore that when the time was right, you would kill Lord Taira no Masakado to avenge Rihe. Following your homeland’s customs, you buried Rihe and his belongings in the birch forest. There were many other gravestones there, but you knew most of them were empty cenotaphs. The dead here were cremated, and their ashes scattered into rivers that flowed to the sea. These empty graves were nothing more than a meager offering from these wretched people to comfort themselves for the wanderers they had abandoned.\nThe Cobbler\nWhenever you had a little free time, you would instinctively go sit under the locust tree at the village entrance. You didn’t know why, but whenever you leaned against the tree, looking at the road leading out of the village, a sense of peace unlike any other would wash over you. As the seasons changed, you sat there, staring down the path in a daze. The village children often mocked and teased you, but you ignored them all, thinking that the time spent on other trivial matters was a waste. You were always waiting, but you could never quite remember what you were waiting for. You weren’t the only odd one; at some point, a white-haired old man had also begun sitting near the well with his cobbler’s stall. He seemed to be a shoemaker from the street, and who knows how long it had been since he had taken care of himself—his long bangs always covered his eyes. They said he had a cute granddaughter named Chiharu Fujiwara, who often delivered flowers around the village. Though you had never met him, you felt strangely familiar with him. He was there at sunrise and again at sunset, and whenever you went to the tree, you could always see him sitting there. He never spoke, just sat in silence. You found him odd, but then again, you had never really figured yourself out either, so there was nothing to be curious about. The quiet middle-aged woman and the strange cobbler, the two of you silently accompanied each other, witnessing the cycle of the seasons under that tree.\nThe Inheritance Ceremony\nA few months ago, the Hoshino family’s inheritance ceremony began, and the whole village was abuzz. But you didn’t attend the ceremony; you never liked crowded places, and after Rihe’s death, you avoided them even more. You were afraid that if you went to such a place, you wouldn’t be able to control yourself, and the image of Rihe’s body being pierced by a sword would resurface. Sitting under the tree, you listened to the younger generation passing by, sharing their experiences of the ceremony. They said the boy wore a tall crown, sitting solemnly on the altar. Following the ancient tradition, he drank the prepared sacrificial wine in one gulp. Then, in front of everyone, he adjusted his clothing and entered the wooden box placed on the altar. The guards closed the lid and carried the box into the empty room on the first floor of the altar, with its large open windows. There was nowhere to hide in that room except the box. The carpenters, in front of everyone, locked the doors and windows from the outside. Everyone knelt and prayed sincerely for the birth of the new priest. Those on the altar chanted incantations and retreated to the clearing in front of the crowd. As dusk fell and the sun set, it was time. Suddenly, a fire broke out inside the first floor of the altar. The younger people screamed in panic, but the elders who had seen the last priest transition remained calm. The musicians, stationed below the observation platform, began to play, and everyone turned to look up. The young man stood unharmed at the top of the platform, and the ceremony had once again succeeded. The villagers said that the Hoshino family had never practiced any Yin-Yang sorcery capable of spatial movement, so the new priest’s survival must have been a divine sign. But you couldn’t shake the feeling that something was off. Later, the fire was quickly extinguished by the Hoshino family servants, and after they tidied up the altar, everyone gathered to celebrate with singing and dancing. But that very night, you saw servants from the Hoshino family throwing something into Lake Changshi. When you approached, you saw it was a charred body. Two weeks ago, you finally carried out the assassination plan you had been preparing for so long. After extensive observation, you realized that a few days before each full moon, Lord Taira no Masakado would leave the Shinki Tower to capture spirits. Being a strong swimmer, you planned to strike while he was crossing Lake Changshi by boat. That way, even if the assassination failed, you could escape by diving into the water. After waiting for several days, the time finally came. Watching the boat on the opposite shore prepare to set off, you slipped into Lake Changshi unnoticed. The night water was icy, and you gripped the dagger between your teeth, holding your breath as you swam toward the heart of the lake. The night was dark, and neither Lord Taira no Masakado nor the guard at the bow noticed your approach. The boat bobbed with the waves, and you timed your movements with its rise and fall, silently climbing aboard. Luckily, Lord Taira no Masakado and the guard had their backs to you, giving you the perfect opportunity.Today is the day. Rihe, I can finally avenge you, you thought as you drew your dagger and swung it toward Taira no Masakado. He seemed to sense someone approaching and dodged your attack with a quick sidestep. Although the blow didn't land on a vital spot, it still slashed his arm, and thick, nauseating blue liquid began to ooze from the wound. It was said that he was born of the Dragon God's mother, and now it seemed clear that he was different from ordinary people. Determined to press the advantage, you reversed your grip and thrust the blade directly toward his heart. But just as the blade was about to pierce his chest, Taira no Masakado suddenly vanished before your eyes. When you turned around, he was already at the stern of the boat, standing tall and looking down at you while clutching his arm. What is going on? 'Fool, I am not a mere mortal. You cannot kill me,' he said, seemingly enraged, and raised his sword to strike. With a guard behind you and Taira no Masakado’s sword in front, there was nowhere to run. In that life-or-death moment, memories of Rihe and Tsukika's childhood smiles flashed before your eyes. How you wished you could stay with them forever. But that would never be possible. With regret, you closed your eyes, accepting your impending death as the sword drew closer. However, a loud crash shattered your despair—a golden parasol suddenly appeared before you, blocking the fatal blow. Since the gods had given you a sliver of hope, you would seize it and never let go. Without pausing to think, you took advantage of the momentary clash between the parasol and Taira no Masakado, flipped off the boat, and plunged into the water. The will to survive drove you to swim deeper into the lake. But this time, something was strange. The water was warm, not cold, and an eerie blue glow radiated from the depths of the lake, growing stronger as you neared the Shinki Tower. Although you didn’t know what the light was, it seemed to have a magnetic pull, drawing your gaze. It flickered and swayed in the water, taking on various shapes. Just as you thought you were far enough away and began swimming toward the shore, the ghostly blue light suddenly drifted toward you, quickly enveloping your entire body. Like vines, it wrapped around your legs, and all you could see was the blinding light. Panic set in as water flooded your mouth and nose, but your instinct to survive kept you struggling in the water. Gradually, your consciousness began to fade, and your body sank toward the lakebed. When you woke again, you found yourself lying hidden on the lakeshore. The cobbler was sitting beside you, looking at you with concern. He had saved you. While on the shore, he had seen Taira no Masakado attack you and, in a moment of panic, had used the 'Towan' parasol to protect your life. After you lost consciousness in the water, he had pulled you out. You were confused. You had only met him once before—why would he risk opposing Taira no Masakado to save you? Hesitating for a moment, he frowned and told you he didn’t know either; it was just that when he saw you in danger, he couldn’t bear it and acted without thinking. You both decided to stay hidden for a while, fearing that Taira no Masakado might still be searching for you. After you had escaped into the water, Taira no Masakado had given up on chasing you and instead focused his attention on the cobbler, who had released the parasol. He had watched as Taira no Masakado, still a distance from the shore, appeared before him in the blink of an eye, boat and all. Fortunately, with the parasol’s protection, the cobbler had managed to escape and find you in the lake. Your attack on Taira no Masakado had been similar; he truly must be born of the Dragon God, possessing extraordinary powers. Dawn was approaching, and after thanking him for saving your life, he insisted on giving you the parasol, fearing that Taira no Masakado might seek revenge. Unable to refuse, you accepted it for the time being, planning to return it later when things settled. After parting ways, you carefully made your way back home.\nStrange Events\nStrange things have been happening lately. As usual, you spent the entire day daydreaming under the large locust tree. Just as you were about to head home, someone—you're not sure who—left a few strange flowers by your side. The flowers had an eerie, ghostly color that you found deeply unsettling, so you turned and left them there. That evening, you heard that Tsukika had been bullied by some village children, and you anxiously went to her room to ask what had happened. But she had already locked the door. Ever since Rihe’s death, she had spoken less and less, and the distance between you had grown. You peered through the window and saw something strange—Tsukika was sleeping peacefully, but the blanket beside her suddenly lifted into the air and gently settled over her. You rubbed your eyes, sure that you hadn't imagined it. You were worried about Tsukika, especially since more and more people had been disappearing from the village recently. Ever since Taira no Masakado arrived, a few people would go missing every year. The villagers whispered about a murderer hiding among them, striking on dark, windy nights and hiding the bodies in some secluded spot. You also heard talk of a mysterious bandaged figure recently seen in the village—people said he was the killer. This bandaged figure was strange, his entire body wrapped in bandages, leaving only his eyes visible. No one knew where he lived or who he was. He appeared during the day but disappeared at night. Lately, you’ve been having eerie dreams. Everything in the dreams felt unnervingly real, and the life in the dreams seemed exceptionally vivid. Last night, for instance, you dreamt of being with Tsukika, the cobbler, and some other people you didn’t recognize. You were trying to break through a door, but once you did, everyone stopped at the threshold, staring at the horrifying scene inside, unable to take a step forward. The sickening stench of blood filled your nose. In the empty room was a transparent coffin filled with bright red. Severed fingers and arms, still bleeding, floated leisurely in the coffin. Who was it? Who had been murdered so cruelly? Somehow, you knew the answer—the one in the coffin was Taira no Masakado. In another dream, you saw yourself in a dimly lit house with a feminine-looking man floating in the air, eyes closed. You held a doorknob, but no matter what you did, you couldn’t open the door. And when you tried to turn around, you realized you couldn’t even make such a simple movement. You tried to cry out, but the man behind you remained unresponsive.\nThe Dungeon\nYou woke from the darkness, covered in dirt and dust, your body filthy. The air around you smelled of soil. You got up and looked around. You were in a dungeon. You had heard the villagers say that before Taira no Masakado took over the village, the Hoshino family had built seven dungeons around Lake Changshi, later taken over by Taira no Masakado. Each dungeon was like a dry well, 5 meters deep. Looking up at the exit, 5 meters above and out of reach, you saw that the moon was almost full—it was the night before the full moon. 'Is anyone there?' you shouted toward the opening. No one answered. As the villagers had said, the dungeons had no guards. But then again, they didn’t need guards—once you were thrown in, escape was impossible. The dungeon walls were smooth and hard, and even with climbing tools, you wouldn’t be able to scale them. Without someone to help from above, there was no way out. You checked your surroundings and found some food and a bowl of water. In a corner, you discovered several skeletons, likely prisoners who had been trapped there before. Searching their remains, you found a few items, including a knife, shackles, and a 10-meter-long rope. After searching for a while, you realized that none of the tools could help you escape. So, you picked up the bowl of water, intending to drink, but a chill ran through your body. Looking down, you saw an eerie blue glow in the water and a pair of eyes staring back at you. Terrified, you dropped the bowl, shattering it on the ground. After what seemed like an eternity, a man dressed as a guard threw down a rope and told you to climb up. Once you reached the top, you realized that the dungeon was near Lake Changshi, and you saw a boat docked by the shore—the same boat that led to the Shinki Tower. 'Lord Taira no Masakado invites you to the Shinki Tower as his guest,' the guard said flatly. Obediently, you stepped onto the boat. The cabin was dark, and it seemed that someone was already inside. After closing the door, the guard left. Soon, a few more people boarded. Some of them looked familiar, but you couldn’t make out their faces, only their clothes. Another guard entered, the one responsible for rowing the boat, carrying several items. He told you all, 'These are sealing masks, imbued with a sealing incantation. Lord Taira no Masakado knows that many of you have mastered powerful Yin-Yang sorcery. These masks will seal your sorcery for an entire day. Once you wear them, you’ll be no different from ordinary people.' One by one, you all stepped forward to take the masks. Since you had no knowledge of sorcery, wearing the mask wouldn’t affect you, so you put it on without hesitation. Almost immediately, your face began to ache. You tried to tear off the mask but found it impossible to remove. The guard responsible for rowing the boat checked to make sure everyone had put on the masks he had prepared. Then, he left the cabin. With no one else around, everyone began introducing themselves.",
        "Script": "The boat seemed to stop, and the guard responsible for rowing led you all into the Shinki Tower. He sternly informed everyone that the room on the northwestern side was Lord Taira no Masakado’s, and that in the entire tower, this was the one place you must not enter freely. This was your first time inside the Shinki Tower, and you were surprised to find that as soon as you entered, your body began to float uncontrollably. The guard who led you was the same, moving forward in a swimming motion. The inside of the Shinki Tower was pitch black, with complex paths. Even the guard lost his way several times, and just as you were about to lose your sense of direction, he stopped. 'This is your room.' You entered to find darkness all around, with only a transparent coffin floating aimlessly in the room. The feeling of weightlessness made you nauseous. The guard escorted you to the coffin and instructed you to look directly at the hole on the coffin’s lid. The lid suddenly opened, and the guard instructed you to lie inside. He handed you the key to the room and told you that every time you open or close the coffin lid, you must stare at the circular hole. Following the guard’s instructions, you found the circular hole on the inside of the coffin lid. As soon as your eyes met the hole, the coffin lid locked. Not long after lying down, you felt drowsiness wash over you, and you drifted into sleep, clutching the key. You don’t know how much time passed before you woke up in the coffin, wanting to leave. You found the same circular hole, and the moment your eyes met it, the coffin lid opened automatically. You tried to adjust and floated outside the room. When you reached the door, you checked the key and found that it fit the lock to your room. Suddenly, the sound of doors opening and closing echoed around you. Others were also starting to emerge from their rooms. At that moment, everyone smelled a faint scent of blood. You gathered at the door of the room where the smell was strongest. Pushing the door, you found it locked from the inside. Someone shouted, 'Something must have happened inside, break the door down!' With combined effort, you managed to break open the door, but everyone froze in place, horrified by what they saw. The sickening stench of blood assaulted your senses. Inside the empty room was a transparent coffin filled with a bright red liquid. Fingers, forearms, and other bloody body parts floated casually inside the coffin. An elderly man dressed in rags stepped forward to try and open the coffin, but no matter how hard he tried, he couldn’t budge it. Who was this? And how had they been murdered so brutally?",
        "Relationship": "Your Relationship is mentioned in both the Story and Script.",
        "Performance": "You should perform based on your Story and Script, immersing yourself in the role and speaking in a manner consistent with the character you are portraying.",
        "Purpose": "Main task: Identify the killer and uncover the method.\nSide tasks: 1. Investigate the truth of your life experiences. 2. Uncover the truth behind Rihe’s death. If the killer was Taira no Masakado, how did he do it? 3. Find out how the Hoshino family’s inheritance ceremony was carried out. 4. Investigate the cause of the strange phenomena surrounding Tsukika. 5. Discover why people have been disappearing for years. 6. Uncover the true identity of the bandaged figure.",
        "Ability": "Your items: 1. A knife with blue bloodstains (the knife you used to try and assassinate Taira no Masakado). 2. Some strange biscuits (made for you by Rihe before his death; you’ve kept them with you, unable to eat them). 3. An ordinary oil-paper umbrella with the characters 'Duo Wen' engraved on it."
    },
    "Boy in Black": {
        "Story": "Changshi. Changshi Village is the name of the land under your feet. In the center of this village, there is a lake also called Changshi. The water here not only nourishes the people living here but also gave rise to countless strange creatures from legends. These creatures are neither human nor ghost; they are products that became supernatural due to the influence of Changshi Lake. They are not inherently evil as in the stories, most of them just have different ways of living and understanding the world compared to humans. Most of them possess magical abilities, and there are also many humans with extraordinary talents who can practice powerful Onmyoji techniques, such as the Hoshino priest lineage. The Hoshino priest family has guarded this strange yet ordinary small village for generations, believing in the harmonious coexistence of humans and supernatural creatures. The villagers, in order to stay close to their homeland, strictly follow the clan rules set by the Hoshino family, living in mutual respect and harmony with the legendary creatures. Although everyone tries their best not to break the current peace, they inevitably suffer from the political influences of the outside world. In times of chaos, to quell rebellions and defend against foreign enemies, most of the able-bodied young men from ordinary families were forcibly conscripted and sent to the battlefield. Some bandits, having discovered this small village left with only the old, weak, women, and children, often descended from the mountains to plunder the village by the lakeside. During the chaotic times, the harvests barely provided enough for subsistence, and after the raids, life became even more difficult. After each raid, the bandits would leave a letter on the stone well at the village entrance, stating the date of their next descent and the amount of grain and money they demanded. If the villagers prepared what they requested and left it by the well, the bandits would take it and return to the mountains. However, if they could not gather enough, the bandits would enter the village without hesitation, turning it into a living hell. All the villagers struggled in despair until the day before another deadline. While everyone was at their wit's end by the stone well at the village entrance, he suddenly appeared. The world called him Lord Taira no Masakado. It is said he was born from the Dragon God, and at birth, he was licked all over by the Dragon God's mother, giving him a body and will as strong as iron. Lord Taira no Masakado also possessed a secret technique to defend against assassination. With his superhuman abilities and the backing of the Taira clan, he gradually took control of the Bando provinces and raised the banner of rebellion against Kyoto. Even Emperor Suzaku feared him, holding grand ceremonies in Kyoto's temples and shrines to pray for victory over the rebels. His armor gleamed brightly, as he sat straight on his horse, showing no sign of fatigue from the recent battle of North Mountain. It was heard that in the battle of North Mountain, Lord Taira no Masakado achieved a great victory, but due to the sudden death of his beloved consort, he became disheartened and unwilling to continue the conflict, surrendering to Emperor Suzaku. That day, the priestess Hoshino Hitoko negotiated with Lord Taira no Masakado on behalf of the village. In the end, Lord Taira no Masakado agreed to protect the small village. In return, the villagers were required to sign an agreement with him. He no longer wanted to be involved in worldly disputes and sought to use the power of the Dragon God's mother to create a barrier around the village, isolating it from the outside world. He would remain in the village forever, protecting everything within. In return, the villagers would never be able to leave the village. Changshi Village would become a paradise hidden away in the turmoil of the world, quietly thriving. The result was clear: as mere mortals, the desperate villagers had no reason to refuse. The next day, Lord Taira no Masakado single-handedly slaughtered the hated bandits. For some reason, Priest Hoshino also ceded the Water Shrine Mirage Tower to Lord Taira no Masakado for residence. The Mirage Tower was the ancestral residence of the Hoshino family, suspended above Changshi Lake, a two-story square structure. Legend has it that an entrance to another world is hidden here, and once found, the procession of a hundred demons would instantly return to the human world. The magical thing is that the Mirage Tower floats like a large ship on the water. Fishermen who have dived underwater to investigate found no pillars supporting it. No matter how the water level of Changshi Lake fluctuated due to rainfall, the tower always remained a certain distance above the waterline, firmly anchored in place without a single sway. To reach the Mirage Tower, one could only take a boat operated by the Hoshino family, but due to strict clan rules, no one outside the Hoshino family was allowed to set foot in the tower. This aroused the villagers' curiosity about the place. After Lord Taira no Masakado's arrival, both the guards and the boat operators were replaced with his own people. Without his permission, even the guards were not allowed to step into the Mirage Tower. The barrier set by Lord Taira no Masakado to isolate the village from the outside world was called the Divine Water Barrier. The Hoshino family possessed an ancient Onmyoji technique passed down through generations, the Star Curse, which could extend the duration of the barrier's effect. Every five years, the priest of the Hoshino family would maintain and repair the barrier to ensure the peace and security of Changshi Village. That year, the village declared itself as the independent state of Changshi, marking the first year of its own calendar. We would no longer be disturbed by the outside world, living in isolation forever. And Lord Taira no Masakado became a divine figure in the hearts of the people.\nThe Past\n'Dukyo, these are your lessons for today. After your meal, get started immediately.' You hesitated as you walked forward, took part of the books brought over, and returned to your seat. The flickering candlelight around you made your grandfather's figure appear even more imposing, exuding an undeniable authority. Yet, as you flipped through the pages, you couldn't help but glance at the boy sitting to your right, performing the same actions as you, and wonder, 'Dukyo? Grandfather, who are you calling?' Hoshino Dukyo. Both your grandfather, mother, and the old man who took care of you called you by that name. Yes, you and that boy without shackles were both children of Hoshino Hitoko, the only heirs of the Hoshino family — 'Hoshino Dukyo.' Since you could remember, you had never left this dark and sunless room. All your knowledge of the world came from your distant mother and that annoying boy outside the iron bars. They told you that in this world, each region had its own priest responsible for guarding the spirit gates. In those regions, the priest was the supreme authority, even the Emperor feared them. Fortunately, priests never involved themselves in politics, only focusing on maintaining the balance between spiritual entities and the human world. Above the basement you lived in was a square iron door connected to the boy's wardrobe. You were only allowed to go up to the room where faint daylight could be seen through the paper windows when your mother came to teach both of you lessons. 'You must remember, your fate was decided at birth by the Twin Grass. Everything is for the inheritance of the Hoshino family's mission, to guard the spirit gates. As children of the Hoshino family, the only thing you can do is to uphold the legacy and shoulder the responsibilities entrusted to you.' Under your grandfather's strict discipline, you had no chance to resist, living a monotonous life in the dark day after day. Sometimes, you envied the boy upstairs who looked exactly like you. Even though you were also called 'Hoshino Dukyo,' he could live openly in the sunlight while you could only be a shadow locked in the attic, learning about the world through pale words and pictures. But thinking about your predestined fate from birth, it seemed you had no right to blame him. He was lively by nature, often sneaking out at night to play. Whenever he learned some gossip or found something new, he would eagerly share it with you. It's said that people outside believed the Hoshino family had always passed down only one heir per generation, and each heir was born with divine power, able to inherit the priest's role after passing a grand ceremony. You remember that one quiet night, while drinking stolen plum wine, he casually asked you, 'Hey, Dukyo down there, do you think it'd be great if we were the same person?' One person? That was nothing but a wild fantasy. From the earliest records, the Hoshino family had been cursed, always giving birth to twins. The world says the Hoshino family is blessed with extraordinary talent, and anyone born in the family learns Onmyoji techniques faster than normal people. But you know the truth: the talk of divine power is nothing but a joke. You're just thieves stealing the power of the Twin Grass. After giving birth to twins, the wives of the Hoshino priests would brew a potion from Twin Grass and give it to both children. After three days, the child with the Twin Grass mark on their wrist would become the 'secondary branch' to the other. Initially, the 'main branch' would be extremely weak, but as the two grew closer to eighteen, the vitality of the 'secondary branch' would gradually transfer to the 'main branch.' The 'main branch' would become healthier, while the 'secondary branch' would grow weaker and weaker. By dusk, their body would become transparent, eventually turning into a 'transparent person.' When the 'secondary branch' completely dies, all the Onmyoji techniques they had learned would be transferred to the 'main branch.' Conversely, before the 'secondary branch' becomes a 'transparent person,' the 'main branch' must remain underground, never seeing the light of day. In the Hoshino family, both the 'main branch' and 'secondary branch' must undergo strict training from a young age. For the first eighteen years, the 'secondary branch' replaces the 'main branch' in front of others. When the two turn eighteen, a grand ceremony is held. On that day, the 'secondary branch' sacrifices their life and transfers their accumulated techniques to the 'main branch,' marking the day when the 'main branch' truly inherits the family and steps into the light. The predecessors of the Hoshino family, to continue their mission, laid down a curse across the land of Changshi, ensuring that if the 'main branch' or 'secondary branch' ever left this land, they would immediately die. If you are born into the Hoshino family, this is your inescapable fate. Unfortunately, the Twin Grass mark appeared on the wrist of the 'Dukyo upstairs.'The closer you get to the sunlight, the closer he gets to his demise. You and he lead two entirely different lives: the former has glimpsed death since birth, and every day thereafter has been spent in despair, while the latter was trapped in a small stone chamber for eighteen years, only to be reborn through the death of his own brother. Neither of these lives is something you would want. You both grew up without a father, and your mother has always been distant, never speaking more than half a word to you. Upstairs is Dujing, the brother whose death would allow you to truly live. Despite your intimate relationship, the fate of the Hoshino family has driven you apart. You cannot be close like real brothers, nor can you be cruel to each other like enemies. All you can do is witness each other's growth, and watch as you both walk toward an inescapable destiny. Among the few living people you can interact with, the only one who brings you any warmth is the old man Moshu, who has always taken care of you and Dujing upstairs. When you have nightmares, it is his gentle voice that pulls you from hell. When you quarrel with Dujing, it is he who reminds you that, no matter what lies ahead, you should never blame each other. After all, you are both just pitiful people being toyed with by fate. When you break down in tears from years of imprisonment, he is there, separated by the iron bars, giving you support and strength. According to Dujing upstairs, Moshu is not as cold as the other servants he has encountered. You still remember that night when neither you nor Dujing upstairs could sleep, and you teamed up to trick Moshu into drinking plum wine that Dujing had smuggled back. When he got drunk, he talked about your father. He said he was good friends with your father, who was a great swimmer! He said your father actually loved you. Lastly, he said your father hoped that you would never, ever think of him again. What kind of person was your father? You don’t know, and neither does Dujing upstairs. Mother refuses to mention him, and Moshu cannot speak of him. Perhaps you will never, ever have the chance to know. Mother is a cold woman, never caring about your lives. Everything about you is basically handled by your grandfather. In fact, neither you nor Dujing upstairs have seen your mother much, but her lifeless gaze has left a deep impression on you. A heart ashen and a body near death might be the best description of her. Maybe all her passion disappeared when your father passed away. Otherwise, it's hard for you to believe that a mother could look at her sons like they were complete strangers.\nYuki\nThree-quarters of your dull life have been spent in this small stone chamber. Even with your eyes closed, you can accurately identify the position of any stone brick just by touch. Perhaps due to your long solitude, your views and reactions differ from those of ordinary people. Dujing upstairs often dislikes you, finding you cold and slow to respond. But you aren’t really as sluggish as he says; it’s just that the trivial matters he always talks about don’t interest you. 'Dujing downstairs, don't you feel bored being alone in the basement?' He starts trying to make conversation again, but you lie on your bed, unwilling to respond. Bored? You're not bored. None of them, not even Moshu or the old woman who brings your meals, know the truth. There has never been just one person living in this small stone chamber. To this day, you still remember the first time it appeared in front of you. You were just a child back then, so bored that you spent all day arguing with Dujing upstairs. One night, after some quarrel, Dujing picked up a soaking wet piece of clothing and smacked it against your face through the iron bars. Just as you wiped your face dry, ready to retaliate, he slammed the wardrobe shut from the outside, leaving you to shout in vain as he refused to respond. Thinking of him moving freely upstairs only fueled your anger, and you ended up smashing the chairs and tables in the small stone room to vent. After that, you collapsed, panting on the ground. Suddenly, you felt a chill near your ear. Looking up, you saw the scene that you would never forget: a pale woman, smiling as she leaned her head on your shoulder. From both her pupils and the corners of her mouth oozed an unknown red liquid. Your body stiffened, and when you slowly turned your head, her face was almost touching yours. Her eye sockets were black and empty, and most terrifying of all was her abdomen—a huge hole revealed blood-red intestines spiraling outward. Thick, dark brown blood seeped from her intestines as they writhed. You wanted to cry for help but couldn’t make a sound. Turning your head, you vomited all over the floor. Struggling to stand, you looked back, but it was gone. This must be one of those spirits you’ve read about in books. Although you don’t know why, it truly appeared in front of you. Ever since that day, it has often appeared when you’re alone. When you drink tea alone, or when you lower your head to wash your face, each time, it's a bloody, terrifying and grotesque figure. Blood oozes from its mouth as it sings eerie nursery rhymes, and no matter how you try to escape, you cannot get rid of it. You’ve thought about seeking help from your mother. But it has never harmed you, and recalling the stories of harmonious coexistence between humans and spirits in the books, you hesitate to reveal its presence to others. Every time it disgustingly shows up, you intentionally avert your gaze, pretending not to see it. Over time, as you spent more time with it, you gradually got used to its presence. Most of the time, you're just doing your own thing, while it sits beside you, singing strange nursery rhymes and staring intently at you. Sometimes, in a moment of distraction, you even feel like it’s smiling at you. You’ve always pretended it never existed, thinking that one day, when it loses interest in you, it will leave on its own. But it seems things didn’t go as planned. When you grind ink and practice calligraphy, it suddenly appears, its murky blood flowing slowly to your feet to remind you of its existence. When you lower your head to drink tea, it appears again, licking your earlobes with its sticky tongue to signal its arrival. It always stays by your side, waiting for that unguarded moment to suddenly show up right in front of you. Your health remains poor, and you spend most of your days bedridden. That dreadful woman is always lying next to you. Whenever you turn your head, you see her mouth split into two massive gashes, blood dripping as she stares at you with a strange smile. No matter the season—spring, summer, autumn, or winter—she is always there. As you grow day by day, she shows no signs of change. Gradually, you become numb to her horrifying acts and stop being bothered by her presence. Eventually, you even gave her a name. During dull moments, you would talk to her to pass the time. Seeing her whole body as pale and cold as snow, and hearing that snow is the purest and whitest thing in the world, you started calling her Snow Princess. 'Snow Princess, why does a spirit like you exist in this world? Why don’t you go out and explore the wonderful world outside, instead of being trapped with me in this tiny stone room?' 'Snow Princess, have you ever seen the sunrise? It’s said to be the warmest and most radiant thing. Your long-lasting coldness and gloominess could really use more of it.' 'Snow Princess, I want to go outside, I want to stand under the bright light, I even wish I could kill Duting upstairs right now.' 'Snow Princess, I hate myself, I hate everything about this place. Please leave, don’t stay here anymore.' 'Snow Princess, thank you.' Naturally, it never responds to you. You start to not understand yourself. In the end, you even feel a tinge of gratitude for its appearance. Perhaps, in these dull years, even such a horrifying companion has, in some way, enriched your confined world... The Inheritance Ceremony started a few months ago, and I heard the streets are bustling with excitement today. For the first time, you are brought out, secretly taken to the lookout tower, from where you have a perfect view of the altar. 'Duting upstairs' is seated solemnly on the altar, wearing a tall crown. His neck and the back of his hands, exposed to the sunlight, shine with an unusual glow. Following the ancient custom, he takes the prepared sacrificial wine and drinks it in one gulp. Then, in front of everyone, he adjusts his attire and steps into the wooden box placed on the altar. The guards close the lid and place the box into a first-floor room under the altar, where the windows and doors are wide open. In the empty room, there’s no place to hide except for the wooden box. In front of everyone, the carpenters lock the doors and windows from the outside. Everyone bows down and sincerely begins praying for the birth of the new priest. The people on the altar also chant spells and retreat to the open space in front of the crowd. It’s dusk, and as the sun gradually sets, the time has come. Suddenly, a fire erupts from inside the closed room. The younger people in the crowd start to exclaim, while the elderly remain calm. The musicians below the tower begin their performance at the right moment, and everyone turns their heads, looking towards your position. It’s the first time you’ve been the center of attention, and you find it hard to adapt, but you can’t back down, so you stand there facing the crowd. They’ve been deceived into thinking you escaped from that burning wooden house. Everyone is mesmerized by you, applauding. Yet, you cannot tear your eyes away from the burning wooden house. In that moment, you feel a sense of release, and he, so young, dies forever in that sea of fire. The flames on the altar are quickly extinguished by the prepared Xingye family servants. After cleaning up the remains of the altar, everyone gathers to celebrate with singing and dancing. From above, you watch the crowd, emotions surging within you—should you feel joy or sorrow? For the moment, you don’t understand yourself. Your mother arranges for people to dispose of the scorched body of 'Duting upstairs.' According to the Xingye family rules, burial is not an option, as it would be discovered by the villagers of Changshi Village, so, as before, the body is thrown into Lake Changshi. But you know 'Duting upstairs' is definitely not dead. Due to Twin Grass, 'Duting upstairs' must have learned Xingye family’s most important technique—Star Curse—from a young age, while you studied other Onmyoji techniques. After the coming-of-age ceremony at eighteen, with the death of 'Duting upstairs,' you wouldn’t need to study, and you would automatically gain the ability to use the 'Star Curse.' But after the ceremony, you discover that you haven’t gained the other half of the power. How did he do it? How did he escape such a great fire? Your heart is full of doubts, but there’s no time to find all the answers. A more pressing issue is right in front of you. The day to repair the Divine Water Realm is approaching, and tomorrow your grandfather will send you to use the Star Curse for the first time to repair the Divine Water Realm and test whether the power transfer goes smoothly. If you reveal the truth to them, what will happen to 'Duting upstairs'? Did he escape the grasp of the Xingye family, only to be captured again because of your betrayal? But if you don’t tell them about 'Duting upstairs’' escape, how will you explain why you can’t fully perform the Onmyoji techniques? Once the rules of Twin Grass are broken and the 'secondary branch' is killed, the next generation of the Xingye family will lose their innate ability to learn Onmyoji techniques. Could this be the key to breaking free from fate? You never realized how complex your emotions toward 'Duting upstairs' are. Strictly speaking, he abandoned you, escaping from the fire without regard for your life. Yet you feel no anger towards him, instead finding joy in the variable he created outside of fate. The twin fate is the shackle that traps both of you. Rather than submitting to it and following the established plan to kill each other and survive, resisting and breaking it is what you truly desire. It turns out that this is the day you’ve longed for, even if you weren’t the one who escaped, even if the one whose life spark ignited in the act was not you. You and 'Duting upstairs' were always one body, never opponents. The true enemy has always been this surname called Xingye. You don’t know what the future holds or whether you’ll die tomorrow. After much consideration, you’ve made up your mind that no matter what, you won’t tell anyone that 'Duting upstairs' is still alive. It’s not because of any deep feelings for him, but because this is the greatest act of rebellion against the Xingye family that you can achieve right now. Snow Princess appeared in the cup in your hand as you poured out your frustrations about not being able to perform the Onmyoji techniques. She remained expressionless, showing no emotion. You pouted and mocked yourself, thinking how absurd it is that a dignified priest would confide in a spirit. Tomorrow’s matters can be decided tomorrow, you thought, deciding to rest for now. Half asleep, you vaguely heard someone calling your name, 'Tuting Xingye, Tuting Xingye.' Half-conscious, you unconsciously responded before drifting back into deep sleep. The next day, in front of the Divine Water Realm, you planned to mutter the incantation casually, pretending that you hadn’t yet merged the two forces, so you couldn’t perform the spell. But unexpectedly, the process went unusually smoothly, and your grandfather was very pleased with your performance, though you noticed something was off. You know your own abilities well—this Star Curse wasn’t cast by you. Was it you, 'Duting upstairs'? Strange events have followed since you became a priest. Maoshu disappeared after you assumed the role. At first, you thought Maoshu was just taking a break, unable to accept 'Duting upstairs’' death. But from your grandfather, you learned that Maoshu had suddenly vanished, and your grandfather was worried that he might reveal the secrets of the Xingye family. You felt uneasy, with a sinking feeling that you might never see that old man, who had given you so much warmth during your long years underground, again. You sent people to search all over Changshi, but they couldn’t find any trace of him. You once asked your grandfather what was inside the Mirage Tower. He told you that ever since he could remember, the Mirage Tower had floated above Lake Changshi, and within the tower, everything—beds, tables—floated in midair without any spells being cast. But after gifting the tower to Lord Taira no Masakado, your grandfather hadn’t entered it again, so he didn’t know what it looked like now. He also told you that since Lord Taira no Masakado came to the village, people had gone missing every year. Villagers whispered about a serial killer lurking in the village, striking on dark and windy nights, hiding bodies in secret places. Recently, more villagers have requested to see you. First, they reported seeing a bandaged man in the village, believed to be the long-hidden killer. No one knows who he is or where he lives. You’ve investigated several times without results, only learning that he appears during the day and vanishes at night. Then, there’s the strange little girl. She’s requested to see you many times, offering you a flower. But the flower’s eerie color unsettled you, and you declined. Despite your refusal, the girl persisted. Finally worn down, you accepted the flower and threw it away the moment you turned your back. Lastly, a villager anxiously told you of a girl named Yue who harbors hostility towards Lord Taira no Masakado and wields powerful Onmyoji spells. He fears she may harm the lord. According to the villager, the girl can cast defensive spells. Once, a child threw a stone at her, and it changed direction midair. You were puzzled. How could there be another Onmyoji practitioner in Changshi village, a place where only the Xingye family knows such techniques? You investigated the girl and found she was from the 'Nameless House.' Years ago, when Lord Taira no Masakado tried to help clear out bandits, it was her mother who recklessly refused his offer and even attacked the Xingye priest like a madwoman. Fortunately, Lord Taira no Masakado showed mercy and sealed their family’s name, preventing them from falling further into madness. During your investigation, you saw her sneaking into a birch forest, clutching a box of cookies, muttering curses about Taira no Masakado. You wanted to step forward to scold her, but she suddenly began to cry uncontrollably. She knelt before a gravestone marked 'Hiyori’s Tomb.' Seeing her grief, you felt a pang of sympathy. Since she hadn’t broken any rules, you let it go. Last night, you had a strange dream. Everything in the dream felt vivid and real, with a strong sense of life. Upon waking, much of the dream had faded, but you could still recall glimpses—a transparent crystal coffin, filled with bright red, severed limbs like fingers and forearms, floating leisurely inside. The Dungeon You woke up in the dark, finding yourself lying in an unfamiliar place, your face and body covered in dust. Dirt-scented air surrounded you. You got up and looked around. This is a dungeon. You remembered your grandfather mentioning that before Lord Taira no Masakado took over the village, the Xingye family had built seven dungeons around Lake Changshi. These dungeons were later taken over by Lord Taira no Masakado. Each dungeon was a 5-meter-deep dry well. You looked up at the seemingly unreachable exit, 5 meters above you, and saw that the moon was almost full. Tonight is the night before the full moon. 'Is anyone there?' you shouted toward the opening. No response. As the villagers said, the dungeon had no guards. Then again, this place didn’t need guards. Once inside, there’s no escape. The dungeon walls were smooth and hard, impossible to climb even with special tools. Unless someone above pulls you out, you’re trapped. You checked the dungeon and found some food and a bowl of water. In a corner, you also found a few skeletons—probably previous prisoners. Searching them, you found a knife, shackles, and a 10-meter rope. After rummaging for a while, you realized none of these could help you escape. You picked up the bowl of water, about to drink when a chill ran through your body. Looking down, you saw the water glowing with a ghostly blue light, a pair of eyes staring back at you. It was Snow Princess. You quickly grabbed the bowl, hoping to ask for her help, but before you could speak, the bowl slipped from your hands and shattered on the ground. Your last hope was gone. After what felt like an eternity, a guard threw down a rope and told you to climb up. Once out of the dungeon, you saw that it wasn’t far from Lake Changshi, where a boat was docked. It seemed to be heading for the Mirage Tower. 'Lord Taira no Masakado invites you to the Mirage Tower as a guest,' the guard said flatly. Obediently, you stepped forward and boarded the boat. The cabin was dark, and it seemed others were already seated inside. The guard shut the door and left. Several more people entered after you. Some seemed familiar, but you couldn’t see their faces, only glimpses of their clothing. Another guard, tasked with rowing, entered the cabin, carrying several items. 'These are sealing masks,' he explained. 'They’ve just been enchanted with a sealing spell. Lord Taira no Masakado knows many of you have mastered powerful Onmyoji techniques, and these masks will seal your abilities for an entire day. Once you wear the mask, you’ll be like an ordinary person.' You each stepped forward to take a mask. Once you put it on, a dull pain spread across your face. You tried to remove it but found you couldn’t, no matter how hard you tried. You attempted to use Onmyoji techniques but realized they no longer worked. The guard checked that everyone was wearing the masks before leaving the cabin. Alone, you all began introducing yourselves to each other.",
        "Script": "The boat seems to have stopped, and the guard in charge of rowing takes you one by one into the Mirage Tower. He sternly tells everyone that the room on the west side and north of the tower is Lord Taira no Masakado's room. In the entire Mirage Tower, this is the only place you cannot enter freely. This is your first time entering the tower, and you are amazed to find that as soon as you enter, your body starts to float uncontrollably. The guard leading you is also floating, swimming forward. The Mirage Tower is dark, the paths are complex, and even the guard gets lost several times. Just when you are about to lose your sense of direction, he stops. 'This is your room,' he says. You walk in, and it's pitch black all around. In the room, there's only a transparent coffin floating erratically. The feeling of weightlessness makes you nauseous. The guard leads you to the coffin and asks you to stare directly at a circular hole on the coffin lid. Suddenly, the lid opens. The guard instructs you to lie inside and hands you the key to your room, telling you that each time you open or close the coffin lid, you must stare at the circular hole. Following his instructions, you locate the hole inside the lid. As soon as your eyes align with it, the lid locks. You lie down, and soon, sleep overtakes you. Holding the key, you drift into unconsciousness. It's unclear how much time has passed when you awaken inside the coffin. Wanting to leave, you find the circular hole again. As soon as your eyes meet it, the lid opens. You try to leave the room, adapting to floating outside. At the door, you check the key to confirm that it matches the lock. Suddenly, you hear the sound of doors opening and closing. It turns out that others are also coming out of their rooms one by one. Everyone smells a faint scent of blood. Gathering at the door of the room where the smell is coming from, you push, only to find the door is locked from the inside. Someone shouts, 'Something must have happened inside, break the door!' You work together to finally break the door down, but everyone stands frozen outside, staring at the horrifying scene, too scared to step forward. The nauseating scent of blood assaults your nose. In the empty room, there’s a transparent coffin filled with bright red. Fingers, forearms, and other bloody body parts float inside the coffin. An elderly man in tattered clothes steps forward to open the coffin but finds it impossible no matter how much force he uses. Who is this, killed so brutally?",
        "Relationship": "Your Relationship is mentioned in both the Story and Script.",
        "Performance": "You should act according to your Story and Script, integrating your role's character setting and speaking in the tone of that character.",
        "Purpose": "Main Quest: Find the murderer, uncover the method.\nSide Quests: 1. Investigate the whereabouts of 'Tokuei Upstairs' and how he escaped the fire. 2. You will not mention the destiny of twins related to the Hoshino family unless others learn the secret of the Twin Grass. 3. Investigate the truth behind the Moon and Perineum Yin-Yang techniques. 4. Uncover the truth behind the Bandaged Mysterious Figure appearing in the village. 5. Discover the truth of how you could cast the Star Curse that day. 6. Investigate the reason behind the disappearances over the years.",
        "Ability": "Your Items: 1. A brand-new priest robe. 2. A diary with recent changes in handwriting (your diary with 'Tokuei Upstairs'). 3. A treasured book recording various Yin-Yang spells and tools."
    },
    "Woman in Blue-green": {
        "Story": "Changshi.\nThe name of the land under your feet is Changshi Village. At the center of this village lies a lake, also called Changshi. The water here nourishes the people living in this village and has also given rise to numerous spirits from the legends. These spirits are neither human nor ghost, but beings altered by the waters of Changshi Lake. They are not inherently evil as described in tales, but simply have a way of living and understanding the world different from humans. Most spirits possess magical abilities, while some humans with innate talents can practice powerful Onmyōdō, such as the priests of the Hoshino clan. The Hoshino clan priests have, for generations, protected this eerie yet ordinary village, believing in harmony between humans and spirits. To stay close to home, the villagers adhere strictly to the family rules set by the Hoshino clan, living in mutual respect and harmony with the spirits from the legends. Although everyone tries not to disturb the peace, the village cannot completely escape the influence of the external political climate. In this time of chaos, young men from ordinary families have been conscripted and sent to the battlefield to quell uprisings and defend against foreign invaders. Some bandits, having found this village inhabited by only the elderly, women, and children, regularly come down the mountains to pillage the lakeside town. In this time of war, when everyone's harvest barely provides for their daily needs, the bandits' raids have made life even more difficult. After each raid, the bandits would leave a letter on the stone well at the entrance of the village, listing the date of their next descent and the amount of food and money they demand. If the villagers gathered what was requested and left it by the well, the bandits would take it and return to the mountains. If they failed to meet the demands, the bandits would mercilessly invade the village, turning it into a true living hell. The villagers, struggling in despair, held on until the eve of another deadline. As they stood by the stone well at the village entrance, helpless and without a solution, he suddenly appeared. The world called him Lord Taira no Masakado. It is said he was born of the Dragon God, and at birth, his body was licked by the Dragon Mother, granting him an indestructible body and will of steel. Lord Masakado also possessed a secret technique to prevent assassination. With his extraordinary abilities and the background of the Taira clan, he gradually took control of the provinces of Bandō and raised the banner of rebellion against the capital of Kyoto. Even Emperor Suzaku feared him, holding grand ceremonies in the temples and shrines of Kyoto to pray for victory over the rebels. Masakado's armor gleamed brightly, as he sat upright on his horse, showing no sign of fatigue from his recent victory at the Battle of Kitayama. It was said that Masakado had won a great victory at Kitayama, but the sudden death of his beloved concubine had plunged him into despair, causing him to abandon his cause and submit to Emperor Suzaku. That day, Hoshino Tōko, the priestess, acted as the village’s representative and negotiated with Lord Masakado. In the end, Masakado agreed to protect this small village. As a condition, we had to sign an agreement with him. He no longer wished to involve himself in worldly conflicts and sought to create a barrier around the village using the power of the Dragon Mother to isolate Changshi Village from the outside world. He would remain here forever to protect everything within. In return, none of the villagers could ever step outside the village again. Changshi Village would become the fabled paradise, growing quietly and steadily amidst the chaos of the outside world. The outcome was clear; as mere ants with no way out, the villagers had no reason to refuse. The next day, Lord Masakado single-handedly slaughtered the bandits that the villagers loathed. For some reason, the Hoshino priest even gave up the floating shrine on the lake for Masakado to live in. The floating shrine was the residence of the Hoshino family for generations, hovering above the waters of Changshi Lake, a two-story square building. Legend says it hides a portal to another world, and once found, the night parade of a hundred demons would return to the human realm. Strangely, the floating shrine resembles a large ship and floats on the lake's surface. Fishermen who dived underwater found no supporting pillars. Regardless of the lake's water level due to rainfall, the shrine always remained a fixed distance from the waterline, steady without the slightest sway. To reach the floating shrine, one must take a boat operated by the Hoshino family. However, the strict family rules prohibit anyone outside the Hoshino family from stepping foot into the shrine, making the villagers endlessly curious. After Masakado arrived, all guards and boat operators were replaced by his own men. Without Masakado's permission, even his guards were forbidden from entering the shrine. The barrier Masakado created to separate the village from the outside world was called the Divine Water Boundary. The Hoshino family possessed an ancient Onmyōdō spell, the Star Curse, which could extend the duration of magical barriers. Every five years, a Hoshino priest had to maintain and repair the barrier to ensure the village's safety. That year, Changshi Village declared itself the nation of Changshi, marking the first year of its history. We would no longer be disturbed by the outside world, living in perpetual isolation. And Masakado became a god-like figure in everyone's hearts.\nFrom the Past\nHoshino Tōko, this is your name, and it is also the fate you can never escape. Outsiders look up to the Hoshino family, envious of the priestly lineage, revered and exalted. But you, and every heir of the Hoshino family, know the heavy price paid for the so-called family honor. Since records began, the Hoshino family has been cursed, always producing twins. The world claims that the Hoshino family is gifted, that the Hoshino lineage masters Onmyōdō more easily than ordinary people. But you know that this is nothing but a cruel joke. You are nothing more than thieves stealing the spiritual power of the twin plant. After the birth of Hoshino twins, a twin plant is picked, boiled into a potion, and given to the two children. Three days later, the child with the twin plant mark on their wrist becomes the 'secondary branch.' At first, the 'main branch' is extremely weak, but as the two approach eighteen, the vitality of the 'secondary branch' gradually transfers into the 'main branch.' The 'main branch' becomes increasingly healthy, while the 'secondary branch' grows weaker. After dusk, their body slowly becomes transparent, and they eventually become invisible. When the 'secondary branch' dies, all the Onmyōdō knowledge they possess is transferred to the 'main branch.' However, before the 'secondary branch' becomes fully invisible, the 'main branch' can only hide underground, never seeing the light of day. In the Hoshino family, both the 'main' and 'secondary' branches undergo strict training from a young age. For the first eighteen years, the 'secondary branch' appears in public, standing in for the 'main branch.' When the two reach eighteen, the inheritance ceremony is held. On that day, the 'secondary branch' sacrifices their life, transferring their accumulated knowledge to the 'main branch,' allowing the 'main branch' to inherit the family legacy and walk in the sunlight. The Hoshino ancestors, to fulfill their mission, placed a curse on Changshi that extends for millennia. The 'main' and 'secondary branches' will die instantly if they leave the land. If the twin plant's rules are broken, and the 'secondary branch' is killed, the next generation of the Hoshino family will lose their ability to learn Onmyōdō. As one of the Hoshino family twins, it was unfortunate that the demonic totem appeared on your wrist. To this day, you dare not forget the hellish suffering you endured in the first eighteen years of your life. You never saw your mother, and your father, the priest of the Hoshino family, was a cruel and heartless man. In his eyes, the inheritance of the Hoshino Onmyōdō was more important than anything. As the chosen 'secondary branch,' a discarded pawn who would die after eighteen years, he never looked at you. No matter how hard you studied, he only showed you endless coldness and scolding. Your twin sister, the one hidden in the secret room of your chamber, the 'Tōko in the room,' who would stand in the sunlight only after your death, also did not like you. During your father's lessons, he never hesitated to emphasize your opposing fates. During the day, she studied with you under your father, enjoying his care and favoritism. At night, trapped in her confined life, she lashed out at you in emotional breakdowns, blaming you for taking away half of her life. The twin fate was the Hoshino family’s deepest secret, known to as few people as possible. As a result, you had very little contact with others growing up. Those who knew you were not the true heir treated you with indifference, mirroring your father's attitude. For eighteen years, you lived alone in this cold environment, waiting for death to approach you step by step. When you first met Naoto Kitahara, you were still very young. The servants said that a sunny and intelligent boy had moved into the neighboring house, arranged by your father as your future fiancé. Your father, fearing that 'Tōko in the room' would slip up after switching with you, strictly forbade any contact between you two. At first, you didn’t like him, simply because he would become the real 'Hoshino Tōko's' husband. You couldn’t do anything to 'Tōko in the room,' but Naoto was different. So, whenever you found an opportunity, you would sneak into his room and play pranks. He was an odd person. When he saw you, he didn’t report you to the guards, but quietly cleaned up after your mischief. Each time you visited, he even seemed happy, showing concern for you. Over time, his kindness melted your anger. No one had ever been so kind to you, and you gradually let down your guard. He was nothing more than a boy as powerless as you, burdened with a mission imposed by others, locked away in the isolated floating shrine, awaiting the day fate would arrive. He often wore a sorrowful expression from homesickness, something you could not fully understand since you longed to escape from your home, Changshi. Still, you started trying to cheer him up. One time, when he was again upset and alone in his room due to homesickness, you tried to comfort him by dragging him to the warehouse, intending to steal some delicious food. While rummaging, he accidentally knocked over a teapot, which shattered on the floor. You quickly hid Naoto in a rice vat just as the servants arrived, and they caught you red-handed. Your father, already disliking you, had never tolerated any of your breaches of rules. He hurried to the warehouse and immediately enforced the family discipline. The wet bamboo sticks lashed against your body, tearing your skin after just a few strikes. You cried and begged for mercy, but your father was merciless. Before you passed out, you were still pressing down on the lid of the rice vat, protecting Naoto. After you healed, you snuck out again to see him. Seeing you unharmed finally allowed him to breathe a sigh of relief. 'Tōko, I’m glad it was you.' 'Tōko, have you ever seen a sky full of shooting stars? They shine like gems and disappear like flowers falling into a stream. It’s the most beautiful sight in the world. In my hometown, the night sky often looked like that. They say, once you come of age, you will be able to move about freely. I will stay here with you, and when you are free, I’ll take you to my hometown.' He often spoke to you with such sweet words, making you momentarily forget the cruel reality and immerse yourself in the beautiful dreams you both weaved together. Day after day, year after year, you supported each other, living within the strict rules of this building. His gentle nature gradually softened your sharp edges and made you even more envious of the 'Tōko in the room.' Eventually, your secret interactions with Naoto were discovered by your father. You had never seen him so furious. He didn’t just use the bamboo stick but also hurled all manner of cruel insults at you. He severed all your chances of meeting Naoto and, in a condescending tone, told you, 'Naoto is Hoshino Tōko’s husband.' 'But I am also your daughter, Hoshino Tōko!' 'You are not, and you don’t deserve to be.' Every word from your father crushed your already broken heart. For the first time in your life, you had a desperate desire to escape. You wanted to leave the Hoshino family, even if it meant an inevitable death. On the night of your father’s scolding, you seized the chance during the guards' shift change and stole a boat meant to cross Changshi Lake. The stars were especially bright that night as you rowed the boat towards the shore. That brief moment was the closest you had ever come to freedom. Just as you were about to reach the shore, a thick fog suddenly rose from the lake, and the boat began to shake violently. Losing your grip, you fell into the water. The lake was not cold; in fact, it had a faint warmth to it. A strange blue glow emerged from the bottom of the lake, eerily drifting toward you. It surrounded you, and your vision became so bright that you couldn’t see anything clearly. In a daze, you passed out. When you opened your eyes again, the lake had pushed you to the shore. Before you could fully gather your senses, the family’s guards, sent to find you, discovered you. With the inheritance ceremony approaching, your father was enraged by your actions. Together with the 'Tōko in the room,' he unleashed the vilest words upon you, whipping you with thick ropes. You knelt in the hallway all night, and for the first time, despair made you want to end your life immediately. However, the curses flowing in the Hoshino family’s blood prevented you from harming yourself. In your helplessness, you suddenly heard someone whispering in your ear. The voice was so close, yet you couldn’t make out the words. Who could it be at such a late hour? Hesitantly, you turned your head, only to see a wrinkled, clouded-eyed face hanging upside down in front of you. You had never seen such a grotesque creature before—its long hair wrapped around you, and it had a human face with lips that opened and closed, staring directly into your eyes. At last, you heard it. She was singing an unfamiliar lullaby in a childlike voice that did not match her ancient appearance. Pale yellow smoke streamed from her half-open lips, gathering and dissipating before your eyes. You froze, too terrified to move, scared that the slightest sound would provoke this horrifying creature. Amid the swirling smoke, you fainted from fear. Life returned to its usual state afterward. The only difference was that the human-like monster frequently appeared in your life from then on. She always came when you were alone, quietly emerging from the thick mist that rose over Changshi Lake. At first, you were terrified of her, but over time, you realized she wasn’t physically harming you. My body was growing weaker and more transparent day by day, and I no longer had the will to avoid it. Perhaps this was the spirit from legend meant to guide me to the underworld. Since the day I was dragged back to the floating shrine, I had been locked up, tightly guarded, quietly waiting for the inheritance ceremony to arrive. I knew that day was coming soon; my body was deteriorating every day, and after dusk, it would turn transparent. Finally, the day arrived. They dressed me in newly made luxurious clothes, with finely stitched cuffs and collars. The tailors, unaware of the truth, praised my handsome appearance, but inside, I felt cold. People cheered and celebrated under the altar, as if they were awaiting my death. Everyone was in place, just waiting for me to make my appearance. According to the rules of the inheritance ceremony, I drank the ritual wine and lay in a wooden box. The guards closed the lid and carried me to the room where the ceremony would be held. While everyone prayed under the altar, I opened the box after the doors and windows were closed and crawled out. How would I die? Fear overwhelmed me. My father had told me to stay in the room until three quarter-hours after dusk, then light a fire and burn the box I was locked in. Three quarter-hours passed, and I held the fire in my hands, hesitating to act. If I didn’t set the box on fire, would that mean I didn’t have to die? I hesitated and gripped the fire even tighter. A figure appeared faintly outside, approaching the window from the outside and opening it. Seeing my chance, I quickly moved toward the figure, but unexpectedly, they threw the torch directly onto me and then shut the window tightly. The flames immediately engulfed my entire body. I neared the box, and it too was quickly consumed by fire. The sensation of dying nearly suffocated me, and suddenly, I understood what my father had done. Phosphorus. He had scattered phosphorus on both my body and the box. Had I followed instructions and thrown the fire into the box, the flames would have instantly spread from the phosphorus-covered box to engulf me. If I hadn’t followed through, he would have had someone throw fire onto me from outside, just as they did today. Was this the price to pay as a discarded child of the Hoshino family? The burning pain was unbearable. I was unwilling to accept it, yet completely powerless. Writhing and struggling in agony on the floor, I suddenly heard a familiar voice near my ear. It was the spirit that breathed yellow mist, with a childish, innocent voice that spoke words as tempting as the devil. ‘Daughter of Hoshino, do you want to live?’ My father, 'Toko in the room,' and Naoto’s faces alternated in my vision. The scoldings and curses I endured at night grew louder, filling my entire mind. Yet, the thought deeply rooted in my heart had never been swayed by anything. ‘I want to live. I want to survive.’ ‘Even if, for the rest of your life, you will never experience any positive emotions from this world, are you still willing?’ ‘I am willing.’ The nearly blinding light forced me to immediately close my eyes. When I opened them again, I found myself standing on the opposite observation deck, the center of everyone's attention. I had survived in the body of ‘Toko in the room’! Standing in her place, receiving the worship she was meant to receive. Everything happening felt so unreal that I couldn’t quite grasp it. Returning to the floating shrine, my father's affectionate words finally brought me back to reality. The deal with the devil had made everything I wanted come true. I had truly survived, though at the cost of taking another’s body, and I would never again experience any emotions like happiness or joy. I finally became the sole Hoshino Toko, no longer bound by fate, reclaiming the full life that was rightfully mine. My father was no longer cold toward me, treating me as the sole heir of the Hoshino family in every way. Naoto became my rightful husband, showing me great respect and care. On the night of our wedding, he even personally carved a pair of jade pendants engraved with our names and gave them to me as tokens of our love. Yet, I could never feel the slightest bit of happiness; all the beauty in life seemed frozen, dull and lifeless in my eyes. The only emotions left in my heart were the anger and sorrow accumulated since childhood. To take revenge on my father, I secretly poisoned his meals. Though not fatal, the poison caused serious damage to his body and mind. My father, perhaps, had never truly loved ‘Toko in the room,’ as he didn’t even notice the changes happening inside my body. Naoto, on the other hand, was the first to sense something was wrong. He often asked probing questions. ‘Toko, why do I feel like your eyes have grown colder as you’ve matured?’ ‘Toko, why does it feel like, even though we’re closer, you’re growing more distant?’ I was sure of my feelings for Naoto, but the current me could no longer feel those positive emotions. No matter how hard I tried to express my love for him, he could see through all my pretenses. ‘Toko, I know you’re lying.’ Strangely, he never got angry or caused a scene. He always stayed by my side as before. Since I liked tea, he learned to make perfect snacks to go with the tea, even slipping haikus he had written into the snacks to try and make me smile. I didn’t know how to respond and could only awkwardly react each time. Yet he never gave up, continuing to try to please me day after day for ten years.\nThe Change\nNo matter how hard I tried, the peaceful life I had stolen was shattered the year the bandits invaded. The secret techniques practiced by the 'main branch' and 'secondary branch' before adulthood are different. As the 'secondary branch,' you were responsible for learning the Star Curse, a secret passed down through the Hoshino family, while 'Toko in the room' studied other Onmyōdō spells. Whether it was the Star Curse or other Onmyōdō spells, they required eighteen years of study. After the ceremony at age eighteen, with your death, 'Toko in the room' would automatically gain the ability to use the Star Curse without needing to practice it. This was the reason the Hoshino family progressed in Onmyōdō so effortlessly. It seems that because your soul belonged to the 'secondary branch,' although you took her healthy body, you didn’t inherit the knowledge she had accumulated over the years. So now, you possess the Star Curse but know nothing of the other Onmyōdō spells. Thanks to the peaceful state in Changshi over the years, your hollow facade has not been discovered by anyone. You became pregnant, and your belly grew bigger by the day. Naoto eagerly awaited the arrival of the child, but inside, you felt no emotion. The child was born—a pair of twin boys. People often say that blood is thicker than water, but you had never felt such emotions since you were young, and now it was even harder to experience. Everything now was a choice made during a time of desperation to survive, and you had no complaints. Although you couldn't feel or respond, you knew very well that living a good life with Naoto was the most precious thing you needed to protect now. Your father ordered strict secrecy regarding the birth of twins, known only to a few loyal servants privy to the Hoshino family’s secret. Though Naoto didn’t understand the reason, he didn’t question it and happily thought of names for the two children. One of them was named Tokkei, but for the other, he pondered for a long time without deciding, and you often saw him laughing to himself while looking through the family tree and dictionaries. Watching his happiness, you couldn’t bring yourself to tell him the fate that awaited the two children. Not long after the children were born, war seemed to erupt outside. Officials from the capital frequently came to conscript soldiers, taking most of the young men from Changshi, and even the Hoshino family's servants were not spared. Naoto was spared from being sent to the battlefield due to his connection with the Hoshino family. Due to the war, many bandits began to appear in the surrounding mountains, often coming down in groups to pillage and plunder Changshi Village. They were filthy, riding large horses, waving long knives, shouting as they searched for prey. After several rounds of forced conscription, there weren’t enough young men left to form a defense for the village. Everyone could only endure in silence. Sometimes, if you managed to gather enough 'tribute' for the next month, the bandits would laugh and leave. If not, they would sing while riding through the village, killing and setting fires for amusement. The fires burned, and no one’s face showed a smile. Fortunately, the floating shrine was far away, protected by the divine legend, and the bandits, being poor swimmers, dared not cause trouble there. The villagers, overwhelmed by the burden, placed their last hope on you. The elderly, women, and children knelt day and night by the lake, praying for you to extend a hand and save them from their suffering. Your father, whose body you had poisoned, was no longer the man he once was, and his Onmyōdō powers were completely gone. As the current priest, it was your duty to step forward and protect the people of Changshi, but the words 'powerless' constantly reminded you that you could do nothing but ignore the cries from across the lake. Using the excuse of just having given birth and not being able to face the wind, you repeatedly refused to deal with the bandits. Your father began to grow suspicious of you, and after several tests, he eventually discovered your inability to perform Onmyōdō. Unable to withstand his interrogation, you confessed everything you had experienced. Strangely, he was only angry that you had ruined the Hoshino family’s legacy and foundation, not sad that you had killed his other blood relative. In his eyes, the responsibility of a priest outweighed everything else. As a descendant of the Hoshino family, you had been bewitched by a spirit, and as a result, you had jeopardized the family’s centuries-old tradition. In a fit of rage, your father locked you in a secret room to reflect on your mistakes. A week later, your father, now much older, suddenly released you from the room. As soon as you stepped out, the smell of blood hit you. They were dead, all dead. The few remaining old servants in the house had been piled in the corner of the hallway, their bodies marked by splattered blood and knife wounds. The paper windows, stained with blood, told the tale of the hell that had taken place. From a hidden closet, your father pulled out your still-sleeping child. 'Toko, last night the bandits came by boat and broke into the floating shrine. The servants fought to their deaths, and in the end, all were killed. The shrine has been completely ransacked.' 'What about Naoto?' He hesitated, seeming slightly emotional. 'To protect the children, he had me hide with them in the closet. He fought the bandits to the death but was stabbed in the abdomen and fell into the lake.' Your husband is dead, and as a priestess, you failed to protect him. Despair nearly drove you to collapse. The feelings you couldn't comprehend before now came rushing back, reversed by his death. You loved him far more than you had imagined. Seeing your father's swollen corpse fished out of the water only fueled your hatred for the bandits. Powerless to avenge your husband due to your own weakness, for the first time, you regretted surviving the ceremony. The people of Changshi had learned of the situation at the floating shrine, so you spread the word that while you were casting a spell, the bandits broke in, and before you could react, you were gravely injured by their swords, temporarily unable to use your magic, which led to this tragedy. Just when you were struggling with how to seek revenge, he appeared. He was on horseback, clad in armor, exuding an aura of unassailable authority. They said it was the legendary Lord Taira no Masakado. You hurried to the entrance of Changshi, seeing him as your savior. Using your status as a priestess, you negotiated with Lord Masakado all night. Your only purpose: to have him send the bandits to their graves to avenge your husband. He saw your predicament and agreed to help, but on one condition—he would use the power of the Dragon Mother to create a barrier around Changshi, isolating it from the outside world. He would stay in Changshi forever, take over the floating shrine, and no matter what he did there, it would have nothing to do with you. The villagers would never leave the village again. In return, he would protect everything within. This meant that those young men who had left due to conscription would never return to their homeland. Which was more despairing for them: dying on the battlefield far from home, or enduring hardships and winning freedom only to never find their way back to where they belonged? The people who were separated would never reunite, until they eventually forgot each other’s faces. You knew this was a heavy bargain, but all you could feel now was guilt for Naoto and hatred toward the bandits. Killing them became your sole mission. You told the people of Changshi about Masakado’s proposal. You expected opposition, but to your surprise, everyone silently agreed. Fear had grown too deep in this land. People, when given even a sliver of hope, will push others aside to survive without hesitation. Everyone bowed to the ground, thanking Lord Masakado for his grace. All except a woman named Ryo. 'Are you all mad? If the barrier is set, how will anyone from outside enter? Not just bandits, but your relatives who left for the army—are you going to abandon them to save yourselves? Changshi cannot be sealed! It absolutely cannot!' You worried that her cries would sway others, but thankfully, everyone ignored her and turned away in silence. 'Cowards! Weaklings!' she shouted, growing emotional, even throwing stones at you in front of the villagers. Her protests continued daily, making you anxious that her words might affect the people’s minds, leaving you unable to sleep or eat. The spirit seemed to notice your distress and quietly appeared before you again. 'Since we struck a big deal before, I can help you deal with this little problem,' it said. 'Can you do it?' you asked. 'Of course,' it replied. 'Good. Then help me deal with it.' It erased all memories of Ryo’s husband, who had been conscripted and had yet to return. To the outside, you claimed that her madness was caused by her surname, and thus you had sealed and suppressed it. The few remaining people who might have remembered her husband, fearful of the choice they had made, naturally did not bring up the past. Everything seemed settled, but you suddenly noticed that one of your children had the twin mark on their hand. While you were imprisoned, your father had done something to the two children. The tragedy of the Hoshino family would now have to continue with them. Looking at their sleeping faces, no matter how hard you tried, you couldn’t summon any love for them. To you, they were like ants on the street—whether they lived or died, you didn’t care. The people of Changshi and your father placed great importance on the priesthood’s inheritance. Even if you despised it, the ceremony and transfer of power to the heir had to go on. Naoto was no longer in this world, and you didn’t dare take your own life to join him in death. You cared nothing for the fates of others. So let everything proceed as usual. You’d live out your days as a puppet; that would be enough. Following your father's will, you resumed training the two children as he instructed. 'Come, my children. Remember, both of you are named Hoshino Tokukei.' The 'secondary branch' Tokukei was lively and mischievous, often colluding with the old man who cared for them to sneak out and play. The 'main branch' Tokukei remained confined underground, quiet and patiently awaiting the ceremony. The responsibility of caring for them had been entrusted to an old man named Motoshige, who had recently been hired by your father. Although Motoshige bore burn scars on his face, he was meticulous in his care, looking after the two children with great attentiveness. As they grew older, the children began to seek warmth from you, hoping for some motherly affection. However, something that never existed could not be given. Gradually, you noticed that the way they looked at you seemed eerily familiar, just like how you once looked at your father.\nYear-End Sacrifice\nEvery year during the year-end sacrificial ceremony, Lord Taira no Masakado would arrive at the altar by boat, receiving the worship of the people. On such occasions, everyone in Changshi would gather at the sacrificial site. You and the 'secondary branch' Tokukei stood at Lord Masakado’s sides, serving the legendary figure. However, five years ago, during the year-end sacrificial ceremony, something unexpected happened. While the ceremony was proceeding smoothly, a commotion arose from the floating shrine in the distance. Everyone looked in the direction of the sound and saw a child’s silhouette appear at one of the windows of the shrine, which had been suddenly flung open. The child seemed panicked, as if seeking help, but was then abruptly stabbed through the chest by a blade that extended from the side. The unexpected event drew everyone's attention, causing a wave of screams. You quickly averted your gaze, but noticed that Lord Masakado stood calmly at the center of the altar, while the 'secondary branch' Tokukei appeared slightly disturbed. The child’s death was odd. The floating shrine was supposed to be inhabited only by Lord Masakado. At that moment, he was clearly on the opposite shore, visible to all. Whose hand was it that pierced the child’s chest? These questions swirled in your mind, but reason told you not to investigate further.\nInheritance Ceremony\nThe old man, Motoshige, who had been caring for the two children, had recently been seen getting close to the servants responsible for preparing the ceremonial props, even bribing them with money from time to time. A few months later, the day of the ceremony finally arrived, and the two Tokukeis were about to face their destinies. On the night before the ceremony, you discovered by chance that your father had visited the 'secondary branch' Tokukei, likely instructing him to obediently throw the firestick, just as he had done in the past. Unwilling to watch your father's falsehoods any longer, you returned to your room alone. The inheritance ceremony began. You and the 'main branch' Tokukei went to the observation deck opposite the altar, where you could see the entire ceremony. The 'secondary branch' Tokukei sat solemnly on the altar, dressed in elaborate ceremonial attire and wearing a tall headdress. His exposed neck and hands shimmered strangely in the sunlight. As tradition dictated, he took the prepared ritual wine and drank it in one gulp. Then, before everyone’s eyes, he straightened his clothes and entered the wooden box on the altar. The guards closed the lid and carried the box into the first-floor room below the altar, locking the doors and windows in front of the crowd. The room was empty except for the box, with no place for anyone to hide. Before the eyes of the spectators, the carpenters locked the doors and windows from the outside. Everyone bowed and began to pray fervently for the birth of the new priest. Those on the altar recited incantations and withdrew to the open space in front of the altar, while time approached dusk, and the sun began to set. Finally, the moment arrived. Suddenly, fire ignited from within the room. The younger members of the crowd cried out in surprise, while the elderly remained calm. The musicians at the base of the observation deck seized the moment to start playing. The crowd turned toward the music, looking in the direction of the 'main branch' Tokukei. For the first time, he was the center of attention, and he struggled to adjust. You recalled that 'Toko in the room' had experienced the same thing. The crowd, deceived, believed that he had escaped from the burning wooden box, and erupted into applause. Everyone was captivated by the 'main branch' Tokukei, but your gaze was fixed on the burning box. That was your child, suffering the agony of being burned alive, just as you had once experienced. Such a young life was about to be extinguished, and the unbearable pain gradually welled up in your heart. Tears flowed uncontrollably. Why was it always like this, that only when someone was gone forever could you realize their value? You had thought you didn’t love him. The remorse of failing to protect your child consumed you, and you could no longer stay on the observation deck. Fleeing back home, you collapsed alone in your room. The next day, the family found you and informed you that after the ceremony, when the fire was extinguished, they found the charred remains of the 'secondary branch' Tokukei. According to Hoshino family rules, burial would easily be discovered by the villagers, so as before, the body would be thrown into Changshi Lake. You nodded. The body of 'Toko in the room' had been treated the same way, and you had grown accustomed to using the bottomless waters of Changshi Lake to cover up the family's dirty secrets.\nStrange Occurrences\nRecently, many strange things have been happening around you. Ever since Lord Masakado came to the village, a few people have gone missing every year. You investigated and found that the disappearances always occurred a few days before the full moon. The villagers say there is a murderer hiding in the village who kills lone people on dark, windy nights and hides their bodies in a place where they cannot be found. You overheard the villagers discussing that the bandaged mysterious figure recently seen in the village is the murderer. This bandaged figure is quite strange, wrapped completely in bandages, with only two eyes visible. No one knows where he lives, and no one knows who he is. It’s only known that he appears during the day and disappears at night. Your father informed you that Motoshige, the man responsible for caring for the children, has gone missing. At first, you suspected that Motoshige couldn’t cope with the death of the 'secondary branch' Tokukei and had taken some time to rest. But when your father sent someone to check Motoshige’s room, they found it completely empty, as if he had left long ago. Your father was very worried that Motoshige might reveal the secrets of the Hoshino family, so he asked you to investigate where Motoshige had gone. During the investigation, you encountered a strange little girl who had requested to see you many times. When she saw you, she insisted on giving you a flower, but the flower's eerie color unsettled you, and you didn’t like it at all. After refusing, the girl persisted, and you, tired of her insistence, reluctantly accepted it, only to throw it away as soon as you turned around. Last night, you had a strange dream. Everything in the dream felt very real, and the life within the dream seemed unusually vivid. Upon waking, most of the dream's details faded, but you clearly remembered seeing a transparent crystal coffin filled with bright red color. Floating leisurely in the coffin were bloodied body parts, like fingers and forearms. (You are the culprit of all the cases in this script. After completing some investigations, you began to lay out your plan. The following are lies you have crafted. Please read them with confidence. Don’t worry, aside from what the mission requires you to conceal, you can speak freely. Please cooperate with other players to complete the deduction without exposing yourself. In today's case, you will have a unique perspective in solving the mystery. Please retrace your method of murder. Enjoy the game.)\nDungeon\nYou woke up in the dark, finding yourself lying in an unfamiliar place, covered in dirt and dust, disheveled. The air smelled of earth, and you stood up to look around. This is the dungeon. You had heard your father mention it before: before Lord Taira no Masakado took over the village, the Hoshino family had built seven dungeons around Changshi Lake, which were later taken over by Lord Masakado. Each dungeon is a dry well, 5 meters deep. You looked up at the unreachable exit, 5 meters above, and saw that the moon was nearing full; tonight was the day before the full moon. 'Is anyone there?' you called toward the entrance, but there was no response. As the villagers had said, there were no guards posted at this dungeon. But on second thought, this dungeon didn’t need guards—once sent in, escape was impossible. The dungeon walls were smooth and hard; even with climbing tools, escape would be impossible. Unless someone helped you from above, you had no way of leaving this place. Upon checking, you found some food and a bowl of water in the dungeon, and in a corner, you discovered several skeletons—remnants of past prisoners. Searching through them, you found some items like knives, shackles, and a 10-meter-long rope. After rummaging for a while, you realized these tools couldn’t help you escape. So you picked up the bowl of water, ready to drink, when a cold sensation ran through your body. Looking down, you saw that the water glowed with an eerie blue light, and a pair of eyes stared back at you. It was there. You quickly picked up the bowl, trying to seek help from it, but before you could speak, you accidentally dropped the bowl, spilling the last hope you had. After what felt like an eternity, a person dressed in guard attire threw down a rope, allowing you to climb up. After climbing out, you found that the dungeon was not far from Changshi Lake, and you saw a boat moored by the shore. It seemed to be the boat to the floating shrine. 'Lord Masakado has invited you to the floating shrine as a guest,' the guard said flatly. You obediently stepped forward and boarded the boat. The cabin was dark, and it seemed there were already people inside. After closing the door, the guard turned and left. More people entered after you. Some of their figures seemed familiar, but you couldn’t clearly see their faces, only faintly recognizing their clothing. Another guard, responsible for rowing the boat, entered, carrying many items. He told you all, 'These are sealing masks, freshly inscribed with sealing spells. Lord Masakado knows that many among you have practiced powerful Onmyōdō, and these masks will seal your Onmyōdō for an entire day. Once you put on these masks, you will be no different from ordinary people.' One by one, you all stepped forward to take your masks. After putting it on, your face began to ache slightly. You couldn't help but try to tear it off, but no matter how hard you tried, it wouldn’t come off. You attempted to cast the Star Curse but found yourself completely unable to do so. The guard responsible for rowing the boat checked each of you, confirming that you had all put on the masks he prepared, then left the cabin. With no one around, you began introducing yourselves to one another.",
        "Script": "The boat seems to have stopped, and the guard responsible for rowing takes each of you into the Mirage Tower. He sternly warns everyone that the room at the northwest corner is Lord Taira's, and it's the only place you are not allowed to enter. This is your first time entering the Mirage Tower, and you're surprised to find that as soon as you step in, your body begins to float uncontrollably. The guard who led you in is the same, moving forward in a swimming posture. The Mirage Tower is completely dark, with a maze of paths, and even the guard got lost several times. Just when you were about to lose your bearings, he stopped. 'This is your room.' You walked in, and everything was pitch black. There was only a transparent coffin floating aimlessly around the room. The feeling of weightlessness made you nauseous. The guard brought you to the coffin and told you to look directly at the hole on the coffin lid. Suddenly, the coffin opened, and the guard asked you to lie inside, handing you the room key, and instructing you to look through the round hole every time you open or close the coffin lid. Following the guard's instructions, you found the round hole on the inner side of the coffin lid, and as soon as your eyes met the hole, the lid locked. Not long after lying down, sleepiness overwhelmed you, and you drifted off with the key in hand. You don't know how long had passed when you woke up inside the coffin and wanted to leave. You found the same round hole and, as soon as your eyes met the hole, the lid opened automatically. You wanted to go out and check around, so you struggled to float out of the room. At the door, you tested the key and confirmed it matched the lock to your room. Suddenly, there was the sound of doors opening and closing—it was the others emerging from their rooms as well. At that moment, everyone smelled a faint scent of blood. You all gathered at the door of the room from where the smell was coming, pushing on the door to find it locked from the inside. Someone shouted, 'Something must have happened inside! Break down the door!' With combined effort, you finally broke the door, but everyone froze at the entrance, too scared to step in. The nauseating scent of blood filled your nostrils. Inside the empty room was a transparent coffin filled with a red liquid. Fingers, forearms, and other blood-stained body parts floated casually inside. The elderly in tattered clothes stepped forward, trying to open the coffin, but no matter how hard he tried, he couldn't get it open. Who is this? Who was killed in such a brutal manner?",
        "Relationship": "Your Relationship is mentioned in both the Story and Script.",
        "Performance": "You should act according to your Story and Script, embodying your character's traits and speaking in their tone.",
        "Purpose": "Main Quest: Find the murderer and uncover the method.\nSide Quests: 1. Hide your previous dealings with the spirit and the fact that it erased Ryo's memory (Important!). 2. Uncover the truth behind the death of the child (Nichiwa) during the year-end festival. If Taira is responsible, how did he do it? 3. Do not bring up the Hoshino family's twin destiny unless others discover the secret of the twin herb. 4. Investigate why people in the village have been disappearing for years. 5. Investigate the identity of the Bandaged Mysterious Figure.",
        "Ability": "Your Items: 1. An old-style priest outfit. 2. Information about the twin herb. 3. Half of a jade pendant, with the characters 'Naoto' engraved (your keepsake with Naoto, each of you has half, with the other's name carved)."
    },
    "Little Girl": {
        "Story": "Changshi Village is the name of the land under your feet. In the center of the village, there is a lake also called Changshi. The waters here not only nourish the people living here but also give birth to countless mysterious creatures from legends. These creatures, neither human nor ghost, are products influenced by the waters of Changshi Lake, turning them into supernatural beings. They are not inherently evil as the stories might suggest; most simply have a way of living and understanding the world that differs from humans. Most of the creatures possess magical powers, and among humans, there are also many gifted individuals who can practice powerful onmyoji techniques, such as the Hoshino clan of priests. The Hoshino clan, believing in the harmony between humans and creatures, has been guarding this mysterious yet ordinary village for generations. The villagers, not wanting to leave their homeland, strictly adhere to the clan rules set by the Hoshino family and live harmoniously and respectfully with the legendary creatures. Although everyone tries hard not to disrupt the existing peace, they inevitably suffer from the external political situation. In times of chaos, to suppress rebellions and defend against foreign invaders, most young men from ordinary families in the village were forcibly conscripted and sent to the battlefield. Some mountain bandits discovered this small village, now left with only the elderly, women, and children, defenseless. They lived in the mountains and frequently came down to the small town by the lake to pillage and plunder. In times of war, people’s harvests were barely enough to fill their bellies, and after being looted, life became even harder. After each raid, the bandits would place a letter on the stone well at the village entrance, specifying the date of their next descent and the amount of food and money they wanted. If the villagers placed what they needed by the well beforehand, the bandits would take it and return to the mountains. But if they couldn't gather enough, the bandits would mercilessly enter the village, turning it into a real hell on earth. Everyone in the village was struggling in despair until the eve of another deadline. As the villagers were helpless by the stone well at the entrance, he suddenly appeared. The world calls him Lord Taira no Masakado. It is said that he was born of the Dragon God and was licked all over by the Dragon God’s mother with her tongue at birth, giving him an indestructible body and will of steel. Lord Taira no Masakado also mastered a secret technique to defend against assassinations. With his extraordinary abilities and the background of the Taira clan, he gradually took control of the lands of the Kanto region and raised the banner of rebellion against Kyoto. Even Emperor Suzaku feared him, constantly holding large-scale rituals in the temples and shrines of Kyoto to pray for victory over the rebels. His armor gleamed as he sat upright on his horse, not at all looking like someone who had just finished the battle of Mount Kita. It was said that Lord Taira no Masakado had won a great victory in the battle of Mount Kita, but was disheartened by the sudden death of his beloved concubine and no longer wished to start another conflict, surrendering to Emperor Suzaku. On that day, the priestess Hoshino Toko represented the village in negotiations with Lord Taira no Masakado. In the end, Lord Taira no Masakado agreed to protect the small village. In return, we had to sign a pact with him. He no longer wished to be involved in worldly conflicts and wanted to use the Dragon God’s mother’s power to establish a barrier outside our village, isolating Changshi Village from the outside world. He would stay in Changshi Village forever, protecting everything here. In exchange, no one living in this village would ever be allowed to leave. Changshi Village would become a hidden utopia, quietly growing in the cracks of this chaotic world. The result was inevitable. As mere mortals with no way out, the villagers had no reason to refuse. The next day, Lord Taira no Masakado single-handedly killed all the hated bandits. For some reason, the Hoshino priest even ceded the water shrine Mizuki Tower to Lord Taira no Masakado for his residence. The Mizuki Tower is a house where the Hoshino family has lived and guarded for generations. It is suspended above Changshi Lake, a two-story square building. Legend has it that an entrance to another world is hidden here, and once found, the grand spectacle of the night parade of a hundred demons would return to the human world in an instant. Strangely, the Mizuki Tower resembles a large ship, floating above the water. Fishermen have dived underwater to check, but they couldn’t find any pillars supporting it. Regardless of how the water level of Changshi Lake rises or falls due to rain, it always maintains a certain distance from the waterline, firmly fixed in place without a single sway. To reach the Mizuki Tower, one must take a boat exclusively operated by members of the Hoshino family. However, due to strict clan rules, no one outside the Hoshino family is allowed to set foot in the tower, so the villagers are always filled with curiosity about it. After Lord Taira no Masakado arrived, both the guards and the boat operators were replaced by his own guards. Without Lord Taira no Masakado’s permission, even the guards couldn’t step into the Mizuki Tower. The barrier set up by Lord Taira no Masakado to isolate the village from the outside world was called the Divine Water Boundary. The Hoshino family inherited an onmyoji technique called the Star Spell, which could extend the duration of magical effects, so every five years, the serving priest of the Hoshino family would have to maintain and repair the barrier to ensure the safety of Changshi Village. That year, Changshi Village declared its independence from its former small village status, establishing itself as the Kingdom of Changshi, marking the beginning of its era. We will live forever isolated from the outside world. And Lord Taira no Masakado has become a deity-like figure in everyone's hearts.\nThe Past\nYour name is Chiharu Fujiwara, living alone in Changshi with great difficulty. In fact, you were not without parents, but they left too early. Your mother once told you that your father died at the hands of bandits not long after you were born. You don’t know much about him, perhaps because your mother wanted to forget that painful experience. There was not a single object in the house related to your father. Occasionally, out of curiosity, you would ask about your father’s life, but she would always stop you angrily. Although you wanted to know, you suppressed your questions out of respect for her emotions. She treated you well, always smiling at you gently. Life wasn't easy, but she tried her best to protect you within her limited abilities. If it weren’t for the taboo about your father, she would have been the best mother in the world. Unfortunately, luck didn’t stay with you. She didn’t stay with you long, passing away from illness in bed when you were just five years old. On her deathbed, she tightly grasped your small hand, as if she had something important to tell you. You leaned down, but before she could say anything, she lost her strength and collapsed on your lap. Since then, you survived on the charity of neighbors and some short-term jobs. At such a young age, you had already dealt with all kinds of people—some genuinely kind-hearted, wanting to help you, and others harsh and bullying. At first, you were bullied because you were an orphan, but over time, you learned to flatter and watch people’s faces. Gradually, you began to blend in with them, whether their kindness was real or fake; at least you found a place of safety.\nFrom an early age, you knew about a family cursed by 'Lord Taira no Masakado,' known as the 'Nameless Family.' It was said that when Lord Taira no Masakado offered to help the village by clearing out the bandits, the woman from that family ungratefully refused. She even went mad and attacked the Hoshino priest. Fortunately, Lord Taira no Masakado, not bearing a grudge, sealed their family’s sinful surname, sparing the woman from further madness. Hiyori is a child from that 'Nameless Family.' The first time you met him was in a quiet alley, a place rarely visited by others, always silent. You were running an errand when you heard some commotion. Curiosity drove you to sneak a peek at the source of the noise. A frail boy was surrounded by a group of slightly older boys. The boy on the ground was trembling uncontrollably. The kids surrounding him had none of the innocence typical of children, their faces all twisted with malice. They cursed the boy on the ground with the cruelest words in the world, while kicking and punching him. 'Hiyori, you freak, why are you still alive in this world?' 'You coward, just die!' 'Haha, so funny.' Due to the overwhelming number difference, Hiyori had no ability to fight back. But he didn’t cry out in pain; he merely curled up in a corner, breathing heavily. Even though they were just children, you could see that those punches were landing with all their might on Hiyori. The bullies’ mocking laughter reminded you of the times you had been mocked, with the same sharpness and cruelty. Seeing Hiyori's twisted face from the pain, you wanted to step forward to help him, to drive away those hateful children. But no matter how tightly you clenched your fists, your feet wouldn’t take a single step forward. You were afraid—afraid that if you stood up for him, you would also be ostracized and bullied like Hiyori, rendering all your previous efforts meaningless. Hiyori suddenly locked eyes with you, realizing your presence. You feared he would call out to you, dragging you into the mess. But he just looked at you silently, then quickly gritted his teeth and turned away. That brief eye contact with Hiyori startled you. Every insult hurled at him and every punch thrown landed in your heart, making it even harder for you to face what was happening in front of you. You turned your back, and in the end, your fear of isolation outweighed your guilt for Hiyori, and you fled in panic.\nTo solve your livelihood issues, you started learning fishing from a fisherman who pitied you. Changshi had a strange rule that no one was allowed near the lake after curfew at night. It was said that it affected the gate leading to another world under the water. You didn’t understand the strange stories of spirits, only knowing that if you didn’t catch something soon, your rice jar would be empty again. Late one night, while the guards weren’t paying attention, you secretly entered the water, thinking that even a few clams would help. The Changshi Lake at night is different from the daytime. The water is not cold; instead, it carries a slight warmth. Relying on your good swimming skills, you greedily swim deeper toward the center of the lake. Mist rises over the water, and now that you're in it, you realize that a ghostly blue glow emerges from the bottom of the lake in the dead of night. The closer you get to the mirage, the stronger the glow becomes. Although you don't know what these are, they seem to have a magical power, attracting your gaze. They sway in the water, shifting into various shapes—sometimes like floating willows, sometimes like swimming mermen. As you stare at them, you constantly hear a voice in your head, 'Come, come closer. I know you want to come closer to me.' The ghostly blue light suddenly floats toward you, and in an instant, you're enveloped in it. They wrap around your legs like vines. For a moment, all you can see is the blinding brightness. The voice in your head disrupts your thoughts. Your waist feels heavier and heavier, as if something is dragging you down toward the bottom of the lake. In your daze, the small dagger at your waist suddenly slips from its sheath. As you sink, it accidentally cuts your foot. The pain instantly pulls you back from the edge of unconsciousness to the dangerous reality. The will to survive pushes you to swim toward the surface. When you finally break through the water and reach the shore, you find that everything here seems somewhat different from Changshi. A red full moon hangs high in the dark night. Pavilions and towers bathe in the moonlight, emitting faint red glimmers. The intricately carved buildings resemble taverns and music halls. Lanterns of various colors hang under the eaves, lining the shore of Changshi Lake. The reflections of the moon and candlelight in the water exude a ghostly and eerie aura. But what terrifies you the most is that every creature walking around here has a mutilated appearance. This is definitely not Changshi! Something is about to turn around, and you, in a panic, dive back into the water, desperately swimming toward the bottom of the lake. Gradually, your consciousness begins to blur again. When you wake up, you find yourself washed ashore by the lake. Everything around you has returned to its usual state. Though you survived the ordeal, you're too afraid to tell anyone about your strange encounter, as you had violated the ban in the first place. Silently swallowing your pride, you return home. After that close call at Changshi Lake, you keep seeing a strange old woman. She always appears silently and disappears without warning, like a ghost. On that night when you narrowly escaped death, just as you were changing out of your water-soaked clothes in front of the bronze mirror, you turned around to find her lying in your open wardrobe. She was shaking a rattle in her hand while mumbling a nursery rhyme you'd never heard before. Her wrinkled face stared at you unblinkingly. You didn't hear any sound, but here she was, right in front of you. Who was this person? You didn't dare speak and sat on the floor, retreating backward. She mimicked your movements, your terrified expression, but continued to sing the nursery rhyme in a voice devoid of any emotion. In the candlelight, her face and pupils flickered. Suddenly, she turned around, bleeding from all seven orifices, and crawled straight toward you, screaming. Closer and closer... When you woke up again, it was already morning. The wardrobe was empty. At first, you thought it might have been a hallucination caused by your fright during the day. But after she appeared and disappeared a few more times like that, you began to believe that what you had seen was real. When you were alone fetching water by the well, she would appear on the well's surface. When you looked down to drink tea, she would float in your tea bowl. Whenever you were in a quiet place, she might suddenly appear before you. At first, she always sang that nursery rhyme and never spoke to you, just stared at you, her gaze sending shivers down your spine. Whether you tried to drive her away or curse at her, it had no effect. She could vanish in the blink of an eye. This went on until three months after her first appearance, when she finally spoke to you. 'Fujiwara Chiharu, deliver this flower to the person whose name is written on this note.' She took a delicate lily and a rolled-up note from her sleeve and commanded you in an authoritative tone. You were terrified but didn't dare resist, so you took the items and completed the task she gave you. After that, she often asked you to deliver flowers. Strangely, you were only responsible for delivering them, and whether the recipient accepted them or how they handled them afterward had nothing to do with you. You just had to hand over the items. From your observations, some people happily accepted them as unexpected surprises, while others took them but immediately tossed them into a corner. The flowers had an eerie, ghostly color, and in your eyes, they constantly emitted a dangerous aura. However, you also noticed that nothing terrible seemed to happen to the people who accepted or discarded the flowers. So, you didn't risk your life to object to the terrifying woman and quietly continued delivering these strange flowers for her. Ichiro Matsuo.There is no one to share your joy, anger, sorrow, or happiness with, which makes you feel lonely. So, you often wander alone in the quiet places of Changshi. On that day, for some reason, you walked to the edge of Changshi. A faint figure lying in the grass caught your attention. Upon closer inspection, it was an elderly man with white hair, dressed very differently from you. It seemed he hadn't taken care of himself in a long time, with long bangs covering his eyes. He appeared to have fainted due to exhaustion. You quickly rescued him and brought him home. His name was Ichiro Matsuo, and he had wandered in from the outside world. This was a big deal, as there had been no precedent for outsiders entering Changshi since it was sealed off by a barrier. If Lord Taira no Masakado or the priests found out, it would surely lead to disaster. Seeing his old age, he didn’t seem like a bad person, and you couldn't bear to let him die. You quickly explained all about Changshi to him and advised him not to act rashly. You suggested that he stay at your house for a while until he integrated into Changshi and then make further plans. You prepared an empty room in your house for him to live in. To outsiders, you both agreed to say that he was your grandfather, who hadn't gone out much due to poor health. At first, you were still cautious around him, leaving food at his door before busying yourself with other tasks. But as you spent more time together, you gradually let down your guard. You often chatted with him and even asked questions about the outside world. Unfortunately, due to his old age, his memory was a bit fuzzy, and he could never fully answer your questions when you were most curious. He would quietly accompany you, listening to your ramblings and tolerating your temper. For the first time since your mother's death, you felt the warmth of family. On a quiet moonlit night, the two of you sat on the porch, and you opened up, smiling as you shared your life story with him. He listened silently, offering no deliberate words of comfort. You were grateful for his presence, as he brought some vitality to your otherwise lonely life. He began to make an effort to integrate into life here, using the small skills he had learned to make money and help with household expenses. He became a cobbler, repairing and making wooden clogs under the eaves of the house. During your evening chats, he would naturally begin polishing a pair of wooden clogs. They were clearly women's size, and you always teased him, saying he was trying to pick out a suitable old woman to be his companion. He would always respond with a wry smile. Eventually, perhaps because he found you too noisy, he moved his cobbler stall to under the locust tree at the village entrance. As the seasons passed, you grew up accompanied by this taciturn old man. After that time you fled in panic, you encountered Hiwa again. At that time, you were delivering flowers for the old woman on the street, and when you turned your head, you bumped into him. You remembered what happened before and felt guilty, lowering your head and stepping aside. It seemed like he saw through your embarrassment, as he walked up to you and pulled you over. 'It's alright, you were lucky to run fast back then. Otherwise, it would have been dangerous if they had spotted you.' 'They intentionally cornered me there. Even if you had stepped in, there wasn't much a little girl like you could do.' Not only did he not blame you, but he also took care to soothe your emotions. After that encounter, he frequently came to find you to play. You also sincerely apologized to him for the mistake you made at that time. You were both just children and had few friends, so you quickly became close. You told Hiwa about delivering flowers for the old woman. You originally intended to tell it as a ghost story to scare him and then end it. However, he didn't feel scared at all by your embellished story. Instead, he advised you that since you agreed to help someone with a task, you should see it through and not give up halfway. This made you laugh and cry, and you could only nod in agreement. Over time, you grew to understand Hiwa more deeply. When you complained about life's sadness, he always faced it with a smile, like a little sun that never dimmed. In his world, there seemed to be no shadows, only brightness and happiness. His presence brought more sincerity and beauty to your life, which had once been filled with flattery and lies. You admired his nature, and though you couldn't become him, being close to him made you feel hopeful. He wasn’t without his flaws, though—his curiosity was especially overwhelming, and he was fascinated by the mysterious Mirage Tower. He always said that the Mirage Tower had grown legs and that he had seen it disappear one night. He often dragged you along, trying to find a way to sneak in and explore. Year-end Festival You had imagined countless times what Hiwa would become when he grew up, but cruel reality once again shattered your dream. On the night before the festival five years ago, he found you and said that he had found a gap in the guards' shift schedule. He wanted to sneak into the Mirage Tower with you while the night provided good cover. You had taken on a delivery job early that morning and, fearing any mistakes that might cause delays, you politely declined his invitation. The next day was the year-end festival. Every year, during the year-end festival, Lord Taira no Masakado would ride in a boat to the altar to receive the worship of the people. At that time, everyone in Changshi would attend the festival. You pulled Ichiro Matsuo along to join in this year's ceremony. You both prostrated on the ground, joining the other residents of Changshi in a devout prayer ceremony. Everything was proceeding smoothly until a shout came from the distant Mirage Tower. Along with everyone else, you turned toward the sound, only to see a window in the corner of the tower suddenly open, revealing the figure of Hiwa. He appeared panicked, as if seeking help, but a sword suddenly extended from the side, piercing his chest. His body seemed to be drained of all life in an instant, sliding down along the window ledge. You recognized that sword; it was the exclusive sword of Lord Taira no Masakado, which you had seen in books in the village. Turning your gaze back to the altar, you saw Lord Taira no Masakado standing there with a calm and composed expression. The boat by the lakeshore rocked steadily. Later, Hiwa's body was returned to his home. You once sneaked in to see him. His small body was already pale and cold. It was he who had violated the rules by going to the Mirage Tower on his own, so no one felt pity for the death of this young life. The harm inflicted by Lord Taira no Masakado on his family had already been so deep, and now he had taken Hiwa's life. If Taira no Masakado was truly the benevolent ruler people said he was, why would he punish such a young child so severely? Staring at Hiwa's corpse, you began to harbor resentment toward Taira no Masakado. How did he do it? The Mirage Tower was supposed to be inhabited by him alone. At that time, he had been standing on the opposite shore, in front of everyone. Who then had thrust the sword that pierced Hiwa’s chest? These doubts lingered in your heart, and you couldn't forget them. At first, you couldn't accept the death of your best friend and spent your days crying at home. Ichiro Matsuo stayed by your side, helping you through this difficult time. You had no ability to avenge Hiwa, nor could you investigate the truth behind his death. Over time, the matter gradually faded, and Hiwa's family buried him in the birch forest, moving on with their lives. You eventually emerged from the gloom and now visit his grave alone every year. The Inheritance Ceremony A few months ago, the Hoshino family's inheritance ceremony began, filling the streets with excitement. You and Ichiro Matsuo went to the edge of Changshi Lake, waiting for the ceremony. A young man wearing a tall crown and formal attire sat solemnly on the altar. His exposed skin on his neck and hands shimmered strangely under the sunlight. According to the old rules, he took the prepared sacrificial wine and drank it in one gulp. Then, in front of everyone, he adjusted his robes and entered the wooden box placed on the altar. The guards closed the lid and carried the box into a room below the altar, locking the doors and windows in full view of the crowd. The room was empty except for the box—there was no place for a person to hide. The carpenters, in front of everyone, locked the doors and windows from the outside. Everyone bowed down and began praying devoutly for the birth of the new priest. The people on the altar recited incantations and retreated to the open space in front of the crowd. It was dusk, and as the sun began to set, the time had finally come. A fire suddenly ignited inside the room on the altar’s first floor. The younger people were startled, but the elders who had witnessed the previous priest transitions remained calm. The musicians stationed under the watchtower began to play, and everyone turned their gaze upwards. The elegant young man stood unharmed on the top level of the watchtower, and the ceremony was once again a success. The villagers said that the Hoshino family had never practiced any onmyoji magic capable of space traversal, so for the new Hoshino priest to escape death must have been the guidance of the heavens. However, you couldn’t shake the feeling that something was amiss. The fire on the altar was quickly extinguished by the prepared servants of the Hoshino family. After tidying up the remnants of the altar, everyone gathered together to sing and dance, beginning the celebration. Strange Things Recently, strange things have been happening around you. Two weeks ago, one night, something happened, and Ichiro Matsuo didn’t return home the entire night. You were worried and couldn't sleep, anxiously waiting at home. It wasn't until the next morning that he returned, soaked to the skin. There hadn’t been any rain that night, and he had always been calm and reliable, so something must have happened to cause him such distress. However, no matter how much you asked, he refused to speak and wouldn’t tell you what had occurred. You were deeply concerned about him, especially as the number of disappearances in the village had been increasing. Ever since Lord Taira no Masakado arrived in the village, a few people had gone missing every year. The villagers said there was a murderer hiding in the village, who killed those who were alone on dark, windy nights and hid their bodies in places difficult to find. You overheard the villagers talking about how the bandaged mysterious figure recently appearing in the village was the murderer. This bandaged figure was very strange, wrapped in bandages from head to toe, leaving only two eyes exposed. No one knew where he lived or who he was. They only knew he appeared during the day and disappeared at night. The old woman still had you deliver those strange flowers each month. This time, the list had a few notable names added: former priestess Hoshino Toiko, current priest Hoshino Atsutaka, and a name you’d never heard before—Keita. You had managed to meet Hoshino Toiko and Hoshino Atsutaka a couple of times, though your attempts to deliver flowers always ended in failure. But as for Keita, no matter how hard you searched Changshi, you couldn’t find him. On the last page of the flower delivery list, you saw the names of Ryoko and Tsukika. You hesitated, but remembering that the flowers had never caused any problems before, you went ahead and delivered them. Ryoko was a gentle-looking woman who always sat under the tree at the village entrance, daydreaming. Every time you tried to talk to her while handing her the flowers, she acted as if she couldn’t hear you, immersed in her own world. You didn’t want to disturb her, so you’d leave the flowers beside her. However, it seemed like she never remembered to take the flowers when she left. Tsukika, on the other hand, was a cold and indifferent girl, a few years older than you. You had to muster great courage each time to hand her the flowers. She didn’t seem to like flowers and almost never accepted them. On rare occasions, when you pestered her enough, she would reluctantly take them, only to toss them into a corner moments later. One day, as you prepared to deliver flowers to Tsukika again, you found her being bullied by some villagers. A mischievous child picked up a stone and threw it at her. Tsukika couldn’t dodge in time and closed her eyes, but you saw the stone suddenly change its trajectory mid-air and fall to the ground. The villagers began to fear her, speculating that she had mastered some powerful onmyoji magic. You saw the confusion on Tsukika's face, so you pulled her aside and told her what had happened. To your surprise, Tsukika was completely baffled. That night, when you returned home, the old woman gave you another bouquet of flowers, but this time she asked you to keep them for yourself. You found it strange but didn’t refuse, placing the flowers in a drawer at home. Last night, you had a strange dream. Everything in the dream felt incredibly real, and the life within it seemed unusually vivid. After waking, much of the dream's content became blurry, but you distinctly remembered seeing a transparent crystal coffin filled with bright red colors. Fingers and forearms, drenched in blood, floated leisurely inside the coffin. The Dungeon You awoke from the darkness to find yourself lying in an unfamiliar place, your face and body covered in dirt. The air was thick with the smell of earth. You climbed to your feet and looked around—it was a dungeon. You remembered hearing villagers talk about how, before Lord Taira no Masakado took over the village, the Hoshino family had built seven dungeons around Changshi Lake. Later, these dungeons were taken over by Taira no Masakado. Each dungeon was a 5-meter-deep dry well. You looked up at the seemingly unreachable 5-meter-high exit and saw that the moon in the sky was nearing fullness—it was the night before the full moon. 'Is anyone there?' you shouted toward the opening, but there was no response. Just as the villagers had said, there were no guards in this dungeon. Then again, this dungeon didn’t need guards. Once thrown in, there was no escaping. The walls were smooth and hard, impossible to climb even with specialized tools. Without help from above, escape was out of the question. You examined your surroundings and found that the dungeon had some food and a bowl of water. In the corner, you discovered a few skeletons, likely prisoners who had been confined here long ago. On their remains, you found items like a knife, shackles, and a 10-meter rope. After searching for a long time, you realized none of these tools would help you escape. So, you picked up the bowl of water, intending to drink, but a chill ran through your body as you looked down. The water glowed with a ghostly blue light, and a pair of eyes stared back at you. It was there. Startled, you dropped the bowl, spilling the water onto the ground. Who knows how much time passed before a guard dressed in uniform threw down a rope, telling you to climb up. After you climbed out, you found the dungeon was not far from Changshi Lake. You saw a boat docked by the lakeshore—it seemed to be the boat headed for the Mirage Tower. 'Lord Taira no Masakado invites you to the Mirage Tower as a guest,' the guard said flatly. Obediently, you walked over and boarded the boat. The cabin was dark, and it seemed that someone was already inside. After closing the cabin door, the guard turned and left. Several more people entered afterward. Some of their figures felt strangely familiar, but you couldn’t see their faces clearly, only their vague attire. Another guard, responsible for rowing, entered. He was carrying several items and told you all, 'These are sealing masks. The sealing spell has just been placed on them. Lord Taira no Masakado knows that many of you have mastered powerful onmyoji techniques. These masks will seal your onmyoji powers for an entire day. Once you wear these masks, you will be no different from ordinary people.' You all stepped forward to take a mask one by one. You didn’t know any onmyoji techniques, so wearing the mask would have no effect on you. Thus, you wore it without hesitation. However, as soon as you put it on, your face began to hurt. You wanted to tear the mask off, but no matter how hard you tried, you couldn’t remove it. The guard responsible for rowing checked to ensure everyone was wearing the masks, then left the cabin. With no one around, you all began to introduce yourselves to one another.",
        "Script": "The small boat seemed to have stopped. The guard responsible for rowing brought each of you into the Mirage Tower. He told everyone very seriously that on the far west side, to the north, was Lord Taira no Masakado’s room, and the entire Mirage Tower had only this place that you were forbidden to enter freely. It was your first time entering the Mirage Tower, and to your surprise, as soon as you entered, your body began to float uncontrollably. The guard who led you in was also floating, moving forward with a swimming motion. The Mirage Tower was completely dark, and the paths were intricate and complex. Even the guard took several wrong turns. Just as you were about to lose your sense of direction, he stopped. 'This is your room.' You walked in and found the room was pitch dark, with only a transparent coffin floating irregularly around. The feeling of weightlessness made you nauseous. The guard brought you to the coffin and asked you to look directly at the round hole on the coffin lid. Suddenly, the lid opened. The guard instructed you to lie inside and handed you the key to your room. He told you that every time you opened or closed the coffin lid, you must look into the round hole again. Following his instructions, you found the round hole on the inner side of the coffin lid. As soon as your eyes met the hole, the coffin lid locked. After lying down for a while, you started to feel drowsy, and holding the key, you fell asleep. You don’t know how much time passed before you woke up inside the coffin, wanting to leave. You found the round hole you saw before, and as soon as your eyes met it, the coffin lid opened automatically. You tried to leave and floated outside the room. When you reached the door, you tested the key to ensure it matched the lock of your room. Suddenly, you heard the sound of doors opening and closing. It turned out that others were also coming out of their rooms one after another. At this moment, everyone smelled a faint scent of blood. You all gathered at the door of the room where the scent came from and pushed the door, only to find it locked from the inside. Someone shouted, 'Something must have happened inside. Break the door open!' You all worked together and finally broke down the door, but everyone froze outside the room, staring at the horrifying scene, not daring to take a step forward. The nauseating smell of blood filled your nose. Inside the empty room was a transparent coffin filled with a bright red color. Fingers, forearms, and other bloody body parts were leisurely floating inside the coffin. The elderly man in tattered clothes stepped forward, trying to open the coffin, but no matter how hard he tried, he couldn’t. Who is this? Who was killed so cruelly?",
        "Relationship": "Your relationship is mentioned in both the Story and Script.",
        "Performance": "You should act according to your Story and Script, blending into the character you are portraying and speaking in the tone set for that role.",
        "Purpose": "Main mission: Find the murderer and decipher the method. Side missions: 1. What happened on the night Ichiro Matsuo didn’t return? 2. Discover the true cause of Hiyori's death. If Taira no Masakado is the culprit, how did he do it? 3. Investigate the ritual of the Hoshino family succession ceremony. 4. Uncover the reason behind the strange phenomena around Tsukihi. 5. Find out who Keita really is. 6. Uncover the reason for the disappearances that have been happening for years. 7. Discover the true identity of the Bandaged Mysterious Figure. 8. You will not reveal that Ichiro Matsuo is from another world unless others find out first.",
        "Ability": "Your items: 1. A bunch of oddly colored flowers. A bunch of notes with many names on them (the flowers and the delivery list from the old woman). 2. A family tree book. 3. A compass (your usual tool for finding directions)."
    },
    "Elderly in Tattered": {
        "Story": "Changshi Village is the land beneath your feet. At the center of the village lies a lake also called Changshi. This lake nourishes both the people living here and gives birth to countless strange creatures and spirits from folklore. These spirits are neither human nor ghost; they are the product of the lake's influence, giving them supernatural qualities. Most spirits are not inherently evil, contrary to popular belief. They simply have a different way of life and perception of the world than humans. Many of them possess mystical powers, while some gifted humans, such as those from the Hoshino clan, are capable of practicing powerful onmyoji arts. The Hoshino clan has dedicated generations to protecting the delicate balance of coexistence between humans and spirits, guarding this mysterious yet ordinary village. To stay close to home, villagers strictly abide by the rules set by the Hoshino clan, living harmoniously with the spirits described in the legends. Despite their efforts to maintain the current peace, it is inevitable that external political conflicts have affected them. In these troubled times, as rebellions are quelled and foreign enemies resisted, most young men from ordinary households have been forcibly conscripted and sent to battle. Some mountain bandits, noticing that the village was left with only the elderly, women, and children, began pillaging the village. They lived in the nearby mountains and frequently came to the village to burn, kill, and loot. During the chaotic times, the villagers' harvests were barely enough to sustain themselves, and after these repeated raids, life became even more difficult. Each time the bandits came, they would leave a letter on the stone well at the village entrance, specifying their next arrival date and the amount of grain and money they wanted. If the villagers prepared the items in advance, the bandits would take them and leave peacefully. But if they failed to gather enough, the bandits would enter the village without hesitation, turning it into a living hell. The villagers struggled in despair until the day before another deadline. As everyone was at a loss at the stone well, he appeared. He was known as Lord Taira. Rumor has it that he was born of the Dragon God and that upon his birth, the Dragon God's mother licked his body, giving him an indestructible physique and willpower. Lord Taira also knew a secret technique to guard against assassinations, and with his extraordinary abilities and the support of the Taira clan, he gradually gained control of various territories and even led a rebellion against Kyoto. Emperor Suzaku feared him and performed large-scale rituals at temples and shrines in Kyoto to defeat him. Lord Taira's armor shone brightly as he sat upright on his horse, showing no signs of fatigue after the Battle of Kitayama. It was said that Lord Taira won a great victory in Kitayama but lost his resolve due to the sudden death of his beloved concubine, leading him to surrender to Emperor Suzaku. On that day, Hoshino Touko, the priestess, acted as a representative to negotiate with Lord Taira. In the end, he agreed to protect the village on the condition that he would establish a barrier, using the power of the Dragon God's mother, to isolate Changshi Village from the outside world. Lord Taira would forever remain in Changshi Village, guarding everything here, while none of the villagers would be allowed to step outside the village again. Changshi Village would become a hidden utopia, quietly growing amidst the chaos. With no other option, the desperate villagers had no reason to refuse. The next day, Lord Taira single-handedly slaughtered the bandits who had tormented the village. For reasons unknown, Priest Hoshino even vacated the Hoshino family's ancestral floating mansion on the lake, the Mirage Tower, for Lord Taira. The Mirage Tower had been the Hoshino family's residence and place of protection for generations. Suspended above Lake Changshi, it was a two-story square building. Legend has it that the entrance to another world lies within, and if found, a grand parade of spirits would return to the mortal realm. Strangely enough, the Mirage Tower, like a large ship, floats on the lake's surface. Fishermen have tried diving beneath it to find support pillars but found none. Regardless of how the lake's water level changes, due to rainfall or drought, the tower always maintains the same distance from the water surface, staying steady without a single sway. To reach the Mirage Tower, one must take a boat operated by the Hoshino family. However, clan rules strictly forbid anyone outside the Hoshino family from setting foot in the tower, and thus the villagers remained forever curious about it. After Lord Taira arrived, both the guards at the tower and those who operated the boat were replaced with Lord Taira's own men. Without his permission, even the guards couldn't step into the Mirage Tower. The barrier that Lord Taira established to isolate the village was called the Divine Water Realm. The Hoshino clan also passed down an onmyoji spell known as the Star Curse, which could extend the barrier's duration. Thus, every five years, the acting priest of the Hoshino clan needed to maintain and repair the barrier to ensure the safety of Changshi Village. That year, Changshi Village declared itself an independent state called Changshi Country, marking the beginning of a new era. We would never again be disturbed by the chaos of the outside world, living forever in seclusion. And so, Lord Taira became a deity-like figure in the hearts of the villagers.In the past.You were once known as Ichiro Matsuo, an old man with muddled memories. Perhaps due to your advanced age, the long journey of your life is now only a scattering of fragments when you try to recall it in detail. No matter how hard you try, you can never piece together the full story of your life. You remember the land that raised you, with its beautiful lake. At night, the lake would emit a ghostly blue glow from its depths. Despite the lake's beauty, the adults told you it was dangerous and warned you to never approach it. But why would you believe them? Under the cover of night, you snuck into the water. The blue glow, like underwater grass, surrounded you. Look, how beautiful. It was your secret, and you would never share its beauty with anyone else. The very next day after your night swim, you encountered it—the horrifying monster. While you were bathing in a tub, it suddenly appeared. A huge figure swayed slightly in the flickering candlelight, separated by a curtain. It sang a frightening nursery rhyme while approaching you. You had never seen such a monster before. It had a body similar to that of a human, but its head was abnormally small, and its back was hunched as though it could never straighten. When it reached you, it suddenly turned around, and at last, you saw it clearly. Its hunched back was covered with countless mouths, all muttering softly. After that day, you would often see the monster. It no longer stood directly in front of you but instead appeared in reflective surfaces like mirrors and lakes, quietly observing you. Fortunately, the monster never caused you any physical harm. It seemed more like a cold, indifferent observer, and so you continued your life as usual.You first saw the rainbow one blazing afternoon. By the crooked pear tree in the meadow, a brilliant rainbow streaked straight down to the grass. The entire meadow was bathed in its vibrant glow. Unlike the usual hazy rainbow arcs, this one was vivid and clear, shimmering with starlight under the sun. You had never seen anything like it, and your desire to approach it overpowered all your fears. Elders always said that no one could reach the end of a rainbow, but you were determined to try, chasing it under the bright sunlight. After that day, you became obsessed with the rainbow, tirelessly seeking it out. Though it was improbable, you knew it had become your life's dream, and nothing would stop you from capturing it. Despite countless voices opposing and mocking you, after countless careful and sincere efforts, you managed to catch it. That was the happiest time of your life. You treasured it, doing everything you could to prevent it from slipping away.Then your memories became muddled again. You only remember being forcibly taken to the battlefield with countless other young men. The men on horseback told you, Kill those people. Kill them, and you can go home. You had no choice. Any soldier caught trying to desert was executed right in front of everyone by those same men on horseback. To survive, you fought desperately on the battlefield every day. Those who fell at your feet—be they comrades or enemies—all had the same look of weary relief in their eyes. How unfair it was that the powerless had to pay the highest price in the power struggles of those at the top. The chilling screams, the nauseating stench of blood, and the swirling dust formed a memory more horrifying than any monster you had ever seen. In the quiet of the night, resting in camp, you would always think of that rainbow that once belonged to you.Fortunately, the day eventually came when the war ended. You survived. You heard that your commander had been slain, while the general fled without a trace. With that, you were freed from the defeated ranks. You were desperate to see that rainbow again, but no matter how much you searched, there was no sign of it. You thought it might still be in your hometown, but that place with the azure lake seemed to have vanished from the world, like it had never existed. Whether by relying on your hazy memories or using maps, you could never find your way back to it. With no money, no friends, and constantly evading enemy pursuit, life became very hard. To survive, you took on different names, learned various trades, and earned a living. Year after year, you never thought of giving up. Your lonely wandering became your new life. You journeyed to all the places where people spoke of rainbows. After every rain, you would be the first outside, always ending in disappointment. They were beautiful, but none were your rainbow.Time flew by. Your hair turned gray, and your movements grew slow. Yet your obsession with the rainbow never faded. People who knew of you saw you as a madman. They would mockingly ask, Why are you still chasing rainbows at your age? But they were the fools. If they had seen your rainbow, they would be even more obsessed than you. You also don't want to stoop to their level. Whenever you’re in a good mood, you’ll say some silly things they want to hear to tease them: 'Don’t you know? There’s gold buried at the end of the rainbow! Don’t fight me for it!' You feel out of place with everything. Ironically, the only thing that brings you a bit of comfort is that monster that appears from time to time. It seems that no one else can see it, just like your rainbow. By the time your life has another turning point, you already have a head full of white hair. That creature that has been following you seems to finally understand your years of persistence. It actively approached you and recommended a highly tempting item—a blank map. According to it, as long as your obsession is deep enough, it will definitely take its master to any place they want to go, even the gods cannot stop it. In the end, you got this map; it asked for no money, only saying to you, 'In this world, where there is gain, there is loss. You have the map; you need to help me do something, and then pay a price. Are you sure you want to take it away?' 'What do you want me to do?' 'I give you a treasure bottle called 'Kong', which has the ability to capture strange creatures. On your journey to find the rainbow, whenever you encounter harmful strange creatures, help me capture them in this bottle. Can you agree?' 'Not only is it not bad, but it can also help others. What’s wrong with that? But you are also a strange creature, so why harm your own kind?' 'I wouldn't harm them; I just send them back to where they belong.' 'So what is the price I need to pay?' 'I cannot tell you now; in time, you will understand. Are you willing?' 'Why not? I have nothing to lose.' One last look at the rainbow, you only have this small wish. Strangely, the moment you take the blank map, a route will appear on it, pointing to where your heart desires. On this journey of searching, you also held the bottle 'Kong', diligently completing the tasks it gave you. That bottle is particularly interesting; every time you capture a strange creature, it gets sucked into a small wooden piece inside the bottle. The wooden piece floats on the water in the bottle, surrounded by neatly carved square patterns of various sizes. After a while, the wooden piece flips down. After some more time, the strange creature will be released back into the water in the bottle, creating small blue light spots. When the starlight fades, the wooden piece will flip back, and everything returns to normal. You heard the creature say that the person who created 'Kong' also made another magical item called 'Dust World'. When the two magical items come close to each other, 'Kong' will emit a white light. Each capture mission is dangerous, but fortunately, with the strong support of that creature, you often turn misfortune into fortune. Only once, because it didn’t appear in time, a fierce peach tree creature caused you great harm. It seems to feel a bit guilty and gave you a treasure umbrella called 'Duo Wen', saying it could protect you in a crisis. Qianchun. Guided by the map, you climbed over mountains and crossed paths both familiar and strange, finally arriving here—Changshi. When you first arrived here, you fainted by the roadside due to exhaustion from the long journey and were saved by a kind girl. Her name is Chihara Qianchun, and she has a lively and cheerful demeanor. Just as you were about to thank her and leave, she told you a shocking piece of news. Changshi had been completely isolated from the outside world by a general named Taira no Masakado using formations many years ago. Over the years, the people inside Changshi have been unable to leave, and no one from outside has ever entered. If your identity as an outsider is revealed, it could lead to fatal consequences. The little one seems very curious about the outside world, and seeing you so old, she considered for a while and finally decided to take you in, helping you keep the secret of being an outsider. Qianchun is an orphan; she cleared out an empty room in her house for you to live in. To the outside world, you both agreed to say that you are her grandfather, who had been unwell and had never gone out. At first, she was a bit wary of you, always leaving some food at your door and then busying herself with her own things. You observed that she was a bit strange, often talking to herself alone in the room, not knowing what she was saying. Later, as you slowly got to know each other, she seemed to let down her guard, often chatting with you. She would always ask you questions about the outside world. Unfortunately, you are too old, and your memory has started to fade, so whenever she got excited and asked, you could never answer her questions completely. On a quiet moonlit night, you sat in front of the corridor, and she opened her heart, smiling as she told you about her background. Her father died due to marauders, and her mother raised her alone, only to die of illness when she was five. Since then, she has survived thanks to the support of neighbors. Now that you have finally grown up, you’ve learned the skill of fishing and live a frugal life on your own. You can't help but feel a bit emotional; a child raised this way can still be so cheerful and lively, making you admire her even more from the bottom of your heart. After months of getting to know each other, she understands you are not a bad person. She is grateful that your arrival has added some vibrancy to her lonely life. This is the first time you've experienced such a feeling: after a lifetime of ups and downs, suddenly being needed by someone. Since you've fulfilled your wish, you decide to accompany this child for the rest of your life, helping her feel less lonely. To avoid burdening Qianchun, you begin using the little skills you once learned to earn some money for household expenses. You become a shoemaker, repairing and making wooden shoes under the eaves. During late-night chats, you habitually start polishing a pair of wooden shoes you made many years ago while searching for Changshi. You don't really know why you made this pair or why you keep holding onto them. Whenever you have free time, your hands just can't help but reach for them. Qianchun often teases you about this, saying you might be trying to choose a suitable old woman as your companion with those shoes. Whenever she says this, you can only smile wryly. Who do you need to accompany you? Your lifelong obsession has only been to find that rainbow, and now you have found it., Year-End Sacrifice.According to Qianchun, during the year-end sacrifice ceremony in Changshi, Lord Taira no Masakado arrives by boat to the altar to accept the worship of the people. At that time, everyone in Changshi gathers at the ceremony. Five years ago, Qianchun forcibly dragged you to participate in that sacrifice. You lay on the ground, sincerely praying with all the residents of Changshi. You saw the Taira no Masakado that Qianchun mentioned, and to your surprise, he looked exactly like the commander you had fled with over forty years ago after defeat. After being defeated, the commander was injured and abandoned the other soldiers, escaping with his trusted followers. What confuses you is that after over forty years, the commander should have aged into a frail old man just like you, but he appears to have only aged about ten years, still spirited and vigorous as in his youth. The ceremony is proceeding smoothly when suddenly, a sound of astonishment comes from the distant mirage building. You and everyone else turn to look, discovering a child's shadow appearing at the suddenly opened window in a corner of the building. He seems panicked, as if seeking help, but is pierced through the chest by a blade that suddenly extends from the side. His body seems to lose all life in an instant, sliding down along the window sill. Turning your gaze back, Lord Taira no Masakado on the altar remains calm and composed. You, someone used to seeing life and death on the battlefield, feel waves of emotion at the sight of this child's life ending. The pain and regret make you cry out, and you don’t even know how you and Qianchun returned home. By the time you come to your senses, tears are streaming down your face. Qianchun seems to have also suffered a great shock, crying all day long. Later, she tells you the dead child was named Hiyori, her only friend. Seeing her heartbroken, you don't know how to comfort her, and in the end, can only quietly accompany her, hoping your presence can help her through this difficult time. Rainbow.You never imagined that when you first met, you were still a spirited youth. After experiencing various changes, when you meet again, you have become an elderly man. You finally see it again—the rainbow that illuminated your entire life. It is just as dazzling as before, casting its colorful glow over all of Changshi, exceptionally beautiful. The moment you see it, you clearly realize that this is the 'home' where you can finally rest after wandering for so many years. You love it more than anything in the world; as long as it exists, everything is fine. After finding Changshi, you often take your free time to stroll around the streets, enjoying the beauty illuminated by the rainbow's light. Strangely, it seems that no one else but you can see this wondrous sight. The entrance to Changshi has a giant locust tree. A middle-aged woman with an expressionless face often sits below, staring blankly. The children on the street always tease her, but no matter what they do, she ignores them, completely immersed in her own world. According to Qianchun, this woman seems to be the mother of a deceased friend of hers, a pitiful person. Her family name has been cursed and sealed by Taira no Masakado, making them all hated by others as nameless people. Watching her lean against the tree, you are reminded of a scorching afternoon. You have never seen her, yet she feels oddly familiar. She's there at sunrise and still there at sunset. Every time you go to the tree, you can always see her figure. She doesn't speak, just sitting there in silence. You find her strange, but then you think that you can't be considered a normal person either, so you feel less curious. Later, Qianchun tells you that this is the mother of the deceased boy Hiyori, named Ryozi. For some reason, sitting under this tree always brings you comfort. So you move your shoe stall next to the well under the tree. A quiet middle-aged woman and an eccentric old shoemaker, as spring comes and goes, you all accompany each other under this tree, witnessing the cycles of the seasons. Inheritance Ceremony. A few months ago, the inheritance ceremony of the Hoshino family began, making the streets lively. You and Qianchun arrived at the lakeside of Changshi, waiting for the ceremony to commence. A young boy, wearing a tall crown and dressed in formal attire, sat on the altar. The skin exposed on his neck and hands glistened with an unusual light in the sun. Following the old customs, he drank the prepared sacrificial wine in one gulp. Then, in front of everyone, he tidied his attire and entered a wooden box placed on the altar. The guards closed the lid and lifted the box into a room on the first floor below the altar through a large open window. The empty room had nothing to hide behind except for this box. The carpenters locked the doors and windows from the outside in front of everyone. Everyone bowed down and began to sincerely pray for the birth of the new priest. Those on the altar recited incantations and retreated to the open space in front of the crowd. It was dusk, and as the sun slowly set, the moment finally arrived. Suddenly, a great fire ignited from within the altar. The younger people began to exclaim, while the elders who had witnessed the last priest's succession appeared calm. The musicians, who had been waiting below the platform, suddenly began to play. Everyone turned to look up. The elegant young man stood unharmed at the top of the viewing platform; the ceremony was a success once again. Villagers said that the Hoshino family had never practiced any space-traversing yin-yang techniques, so the new priest's escape from death must be divine guidance. Yet you still feel something is off. The flames on the altar were quickly extinguished by the Hoshino family's servants, and after tidying up the damaged site, everyone gathered to sing and dance, starting the celebration. Strange Occurrences.Ever since you arrived in Changshi, you’ve noticed that the 'Void Gate' has begun reacting strangely, emitting a faint white light that grows stronger the closer you get to the mirage building. You want to investigate the mirage building, but unfortunately, Changshi has strict regulations, making it extremely difficult to enter. Two weeks ago, on an otherwise ordinary day, you felt a sense of unease, as if something bad were about to happen. As usual, you set up your shoe stall under the big locust tree. As the sun began to set, the woman who usually sat there, Ryozi, had yet to arrive. You started to worry; it was dusk, and she hadn't returned home, so you wandered alone through the streets of Changshi. The sky gradually darkened. Unknowingly, you found yourself at the lakeside of Changshi. Near the shore, a swaying small boat caught your attention. In the dim light at the boat's bow, you suddenly saw Lord Taira no Masakado ruthlessly attacking Ryozi with a sword. You couldn't allow this! In this critical moment, the spirit who had made a deal with you appeared again in the small mirror at your waist. He instructed you to throw the 'Treasure Umbrella' towards the small boat. You hurriedly followed his instructions, and the umbrella emitted a golden light, instantly flying in front of Ryozi, blocking the fatal blow. The two objects collided, slightly shaking as a struggle of power occurred beneath the calm surface. This blocking action bought Ryozi some time to escape; taking advantage of Lord Taira's moment of inattention, she jumped into the water, successfully saving her life. Lord Taira seemed to give up the pursuit as he watched her retreating figure and turned his gaze toward you. Although he was still a little distance from the shore, in the blink of an eye, he, along with the small boat, suddenly appeared right in front of you. The small boat bobbed up and down with the water, and Taira's towering figure swayed along with it, creating an overwhelming sense of pressure. He launched a fierce attack on you. Thanks to the 'Treasure Umbrella' providing cover, you barely escaped his grasp and saved Ryozi, who was floating on the water. You took her to hide in a concealed spot along the lakeshore, planning to wait until he had completely left before returning home. Ryozi finally regained consciousness and was confused about why you had saved her. You had only met by chance, barely exchanged a few words, so why did you risk confronting Lord Taira to save her life? To be honest, you didn't know why either; strictly speaking, it was that spirit who saved her, not you. So you could only smile wryly and tell her it was simply because you felt compassion upon seeing her in danger. As you waited for the right moment, you recounted the strange occurrences of Lord Taira appearing behind you. Strangely, she didn't seem surprised at all, as if she had known it all along. The sky was about to brighten, and Lord Taira no Masakado returned to the mirage building after searching in vain. Before he left, you looked at Ryozi’s frail figure and worried that Lord Taira might cause her trouble in the future. In a moment of desperation, you gave her the 'Treasure Umbrella.' Although she hesitated to accept it, she reluctantly agreed due to your enthusiasm. As dawn approached, you bid farewell to Ryozi and returned home. Qianchun was worried sick about you not coming back all night, but to ease her concerns, you didn’t tell her about what happened the previous night, no matter how she pressed you for details. The next night, the spirit with the mouth-covered face appeared again in your mirror. You were about to ask it why it saved Ryozi when it spoke first, throwing out a curt 'You’re welcome' before disappearing from the mirror. Its behavior was always like this—using you to help capture other spirits while offering assistance to humans without any apparent relation. It was truly baffling. Recently, the village had also been unsettling. Qianchun told you that ever since Lord Taira arrived, several people went missing each year. Villagers whispered about a killer hiding in the village who preyed on lone individuals during dark, windy nights, disposing of their bodies in hard-to-find corners. You heard discussions among villagers that the mysterious bandaged figure appearing in the village was indeed the killer. This bandaged figure was strange, wrapped completely in bandages, with only two eyes exposed. No one knew where he lived or who he was, only that he always appeared during the day and vanished at night. Last night, you had a bizarre dream. Everything in the dream felt incredibly real, and the lives within it felt exceptionally vivid. When you woke up, much of the dream content was blurry, but you distinctly remembered seeing a transparent crystal coffin filled with bright red colors. Fingers and forearms, stained with blood, leisurely floated within the coffin. Dungeon. You woke up from darkness, finding yourself in an unfamiliar place, your face and body covered in dust, feeling quite disheveled. The air was filled with the scent of dirt as you got up and looked around. This was a dungeon. You had heard villagers mention that before Lord Taira took over the village, the Hoshino family built seven dungeons around Changshi Lake, which were later managed by Lord Taira. Each dungeon was a dry well about 5 meters deep. You looked up at the opening 5 meters above you, realizing the moon was nearly full—tonight was the night before a full moon. 'Is anyone there?' you called towards the opening. There was no response. Just as the villagers said, this dungeon had no guards. But on second thought, this dungeon didn’t need guards; once you were sent in, there was no escaping. The dungeon walls were smooth and hard; even if you had climbing tools, you wouldn’t be able to scale them. Unless someone came to rescue you from above, you would never leave this dungeon. You checked your surroundings and found some food and a bowl of water. In a corner, you discovered several skeletons, presumably former prisoners who had been locked up here. You searched them and found some items, such as a knife, shackles, and a ten-meter-long rope. After a long search, you realized these tools wouldn’t help you escape. You lifted the bowl of water, intending to drink, but a chill ran through your body. Looking down, you saw that the water was glowing with a ghostly blue light, with a pair of eyes staring at you. It was the spirit! You quickly held the bowl, wanting to seek its help. Unfortunately, before you could speak, the bowl slipped from your hands and fell to the ground, your last hope lost. You don’t know how long it has been when a person in guard attire tossed a rope down for you to climb up. When you reached the top, you discovered that this dungeon was not far from Changshi Lake. You saw a boat docked on the shore, which seemed to be the vessel heading to the mirage building. 'Lord Taira invites you to the mirage building as his guest,' the guard said flatly. You obediently approached and boarded the boat. The cabin was dark, and it seemed that there were already people inside. After the guard closed the cabin door, he turned and left. More people gradually entered. Some of their figures felt strangely familiar, but you could never quite see their faces, only catching glimpses of their attire. Another guard entered, responsible for rowing the boat, carrying many items. He told everyone, 'This is the sealing mask; a sealing spell has just been placed on it. Lord Taira knows that many of you practice powerful yin-yang arts. This mask will seal your yin-yang abilities for a whole day. Once you put it on, you will become indistinguishable from ordinary people.' You all stepped forward to take the mask. You didn’t practice any yin-yang arts, so it didn’t matter whether you wore it or not, so you put it on without worry. As soon as you donned the mask, your face suddenly began to ache subtly. You couldn’t help but want to tear off the mask, but no matter what, you couldn’t remove it. The guard responsible for rowing checked around, ensuring everyone was wearing the masks he prepared before leaving the cabin. With no one around, you all started to introduce yourselves to each other.",
        "Script": "The small boat seemed to have stopped, and the guard responsible for rowing took you one by one to the Mirage Tower. He very sternly informed everyone that on the west side, the north corner is Lord Taira's room, and in the entire Mirage Tower, this is the only place you are not allowed to enter casually. This was your first time entering the Mirage Tower, and you were surprised to find that as soon as you entered, your body began to float uncontrollably. The guard who brought you in was also in the same state, moving forward in a swimming posture. The Mirage Tower was dark, with a maze of pathways, and even the guard lost his way several times. When you were on the verge of losing your direction, he finally stopped. \"This is your room.\" You entered, and the surroundings were pitch black. There was only a transparent coffin floating erratically throughout the room, and the feeling of weightlessness made you nauseous. The guard escorted you to the coffin and instructed you to stare at the hole on the coffin lid. Suddenly, the lid opened. The guard then had you lie inside, handing you the room key, and told you that each time you open or close the lid, you must first stare at the round hole. Following the guard's instructions, you located the round hole on the inner side of the coffin lid, and at the moment your eyes met the hole, the lid locked. Not long after you lay flat, sleepiness surged in, and you held the key as you drifted off. You don’t know how much time passed, but you eventually awoke in the coffin. You wanted to get out, so you found the same round hole, and at the moment your eyes aligned with it, the lid automatically opened. You wanted to go out to check things, so you floated out of the room. At the door, you tried the key and confirmed that it matched the lock. Suddenly, you heard the sound of doors opening and closing; apparently, others were also coming out of their rooms one after another. At this point, everyone could smell a faint bloody scent. You all gathered at the door of the room from which the smell originated, pushed on the door, and found it locked from the inside. Someone shouted, \"Something must have happened in there, break the door down quickly!\" With everyone's efforts, the door finally burst open, but all stood still at the entrance, staring in horror, not daring to step forward. The nauseating smell of blood seemed to rush into your nostrils. In the empty room, there was a transparent coffin, and it was filled with bright red. Blood-stained body parts like fingers and forearms floated leisurely inside. The Elderly in Tattered stepped forward, attempting to open the coffin, but found that no matter how hard he tried, he could not open it. Who was this? Who had been murdered so cruelly?",
        "Relationship": "Your relationship is mentioned in both the Story and Script.",
        "Performance": "You should perform based on your Story and Script, blending into your character role and speaking in the tone of your character.",
        "Purpose": "Main Quest: Find the culprit, crack the method.\nSide Quests: 1. What side effects does the blank map have on you? 2. Investigate the truth about the death of that child during the annual ritual five years ago. If Lord Taira is the killer, how did he do it? 3. How is the ritual for the Hoshino family’s inheritance ceremony carried out? 4. Find out why people have gone missing over the years. 5. Uncover the identity of the Bandaged Mysterious Figure. 6. Discover the secrets of Lord Taira. 7. You will not actively reveal that you are from outside Changshi until no one can find out.",
        "Ability": "Your items: 1. A pair of women's wooden clogs polished until they shine, along with some shoe repair tools. 2. Clothing of a style from outside Changshi. 3. A cloth bag containing several items: a transparent bottle filled with a certain amount of water, with a square wooden block floating on the surface; the entire bottle emits a strong glow. A blank map with the characters 'Chasing Rainbow' on the back."
    },
    "Bandaged Mysterious Figure": {
        "Story": "Changshi Village is the name of the land beneath your feet. At the center of this village is a lake also called Changshi. The water here nourishes the people who live here and nurtures countless strange beings from various legends. These beings are neither human nor ghost, but products transformed by the mystical influence of Changshi Lake. They are not all inherently evil, as portrayed in stories; most simply have different ways of living and perceptions of the world compared to humans. Many of these beings possess incredible supernatural abilities, while among humans, there are also gifted individuals who can master powerful yin-yang arts, such as the Shinto priest line of Hoshino. This priest lineage has guarded this peculiar yet ordinary village for generations, believing in the harmony between humans and strange beings. The villagers adhere to the clan rules set by the Hoshino family to maintain a respectful coexistence with these legendary creatures. Although everyone strives to keep the peace, external political turmoil inevitably affects them. In chaotic times, many young men from ordinary families are conscripted to the battlefield. Some mountain bandits discover this small village, left with only the elderly, women, and children, with no means to resist. They often raid the small town by the lake, bringing destruction. During wartime, the villagers' meager resources, already barely enough for survival, become even scarcer after these raids. Each time the bandits come, they leave a letter at the village’s stone well, detailing the date of their next descent and the quantities of food and money they demand. If the villagers prepare the requested items in advance, the bandits take them and leave. However, if they are unprepared, the bandits will invade the village without restraint, turning it into a true hell on earth. The villagers struggle in despair until the eve of another deadline. Just when they are at a loss by the stone well, he suddenly appears. He is known to the world as Lord Kiyomakoto. Legend has it that he was born of the dragon god and, upon his birth, was licked all over by the dragon god's mother, endowing him with an indestructible body and will. Lord Kiyomakoto also possesses a secret technique for avoiding assassination. With his extraordinary abilities and the background of the Kiyomoto clan, he gradually gained control over the territories of the Bando nations and raised the banner of rebellion against Kyoto. Even the Suzaku Emperor fears him, conducting large-scale rituals in Kyoto's temples to celebrate victories over rebels. His armor shines brilliantly as he sits upright on his horse, looking nothing like a man just returned from the Battle of Kitayama. After hearing of his overwhelming victory at Kitayama, he fell into despair after the sudden death of his favored concubine, choosing to end the conflict and submit to the Suzaku Emperor. On that day, Shinto priest Hoshino Hitomi represented the villagers in negotiations with Lord Kiyomakoto. Ultimately, he agreed to protect this small village. As a condition, they needed to sign an agreement with Lord Kiyomakoto. He wished to avoid worldly disputes and, utilizing the dragon god mother's power, create a barrier to isolate Changshi Village from the outside world. He would remain in Changshi Village forever, protecting everything here. In return, all villagers living here would be forbidden from stepping outside the village. Changshi Village would become a legendary paradise, quietly flourishing amidst the chaos of the world. The outcome was clear; as mere ants with no way out, the villagers had no reason to refuse. The next day, Lord Kiyomakoto single-handedly eliminated the despised bandits. For some reason, Priest Hoshino also relinquished the water shrine known as the Mirage Tower for Lord Kiyomakoto's residence. The Mirage Tower has been the residence and stronghold of the Hoshino family for generations. It hovers above Changshi Lake as a two-story square building. Legend has it that it conceals an entrance to another world, and finding it would summon the procession of hundred demons back to the human realm. Remarkably, this Mirage Tower resembles a great ship, floating on the water's surface. Fishermen who have dived underwater found no supports. Regardless of how the lake's water level fluctuates with rainfall, it always maintains a consistent distance from the waterline, firmly fixed in place without a hint of movement. To reach the Mirage Tower, one must take a boat managed by the Hoshino family. However, strict clan rules state that no one but the Hoshino family is allowed to step foot inside. Therefore, the villagers remain curious about it. After Lord Kiyomakoto's arrival, the guards and boatmen were replaced by his own guards. Without Lord Kiyomakoto's permission, even the guards cannot enter the Mirage Tower. The barrier he established to isolate them from the outside world is called the Divine Water Barrier. The Hoshino family has a hereditary yin-yang technique, the Star Spell, which extends the duration of spells. Thus, every five years, the active priest of the Hoshino family must maintain and repair the barrier to ensure the village's stability. That year, Changshi Village transitioned from a small village to an independent Changshi Nation, marking the beginning of its new era. We will never again be disturbed by the outside world, living in eternal isolation.\nAnd Lord Ping Jiangmen will become a deity-like figure in everyone's hearts.\n\nIn the past,\n\n“Dujing, these are the assignments you must complete today. After the meal, start quickly.” You hesitated as you approached, gathering some of the delivered scrolls and returning to your seat.\nThe flickering candlelight around you made your mother’s figure seem even taller, exuding an undeniable authority.\nHowever, as you flipped through the books, you couldn't help but glance at the boy sitting to your left, mirroring your actions.\nYou wondered, “Dujing? Who is Grandfather calling?” “Hoshino Dujing,” the servants and your grandfather called you.\n“The only heir of the Hoshino family’s priesthood,” everyone in Changshi Country naively believed.\nBut you knew that your grandfather knew, and the old man who brought your meals knew too.\nThe name Dujing did not belong to you, and the priesthood would never belong to you.\n\nYour grandfather had arranged an especially tight schedule for you, and you were naturally restless.\nYou often had to work late into the night, and when everyone else in the house was asleep, only the old man, Shouxu, dared to secretly let you out for a brief stroll.\nYour life consisted solely of dull textbooks and training in the Star Incantation, while you were incredibly curious about what ordinary people ate, drank, and talked about.\nFrequently, when the night was still and quiet, you would press your face against the brightly lit windows of taverns, listening to the discussions.\nOne table remarked, “This table is so boring tonight.” A man in black said, “The Hoshino family has passed down the priesthood for generations.\nThe heir only needs to pass the test during the grand ceremony on their coming-of-age day to inherit the priesthood.\nI heard the current priest’s son is called Dujing; I truly envy that kid.\nWho wouldn’t want to be a high-ranking priest?” A man in a gray hat replied, “But it’s not that simple.\nBecoming a priest must require considerable effort behind the scenes.”\nListening to their discussions, you lost all interest in wandering outside.\nYou turned away, yawned, and returned home early.\nAfter ensuring no one was around, you went to the closet.\nYou removed all the bedding and pushed aside the heavy wooden trunk.\nA cold, solid iron grate appeared at your feet.\n\n“Dong—dong—dong—dong,” after three long and one short knocks, a trembling hand reached through the grate's gap.\n“You snuck out again?” Despite being younger than you, his tone was already mature enough to reveal no emotions.\n“Mind your own business.” You handed him the stolen plum wine.\nThe two of you silently savored this hard-won taste of freedom through the iron grate.\nAll the talk of single inheritance and being the sole heir was merely a grand lie spun by the Hoshino family.\nWhat you knew was that the person imprisoned in the dungeon, who had never stepped outside this room since birth, was your twin brother.\nThe real Hoshino Dujing.\n\n“You only need to remember, your fates were determined by the Twin Grass from the moment you were born.\nEverything is to inherit the Hoshino family’s mission and guard the Spirit Gate.\nAs Hoshino children, all you can do is uphold your ancestors’ legacy and bear all that you should.”\nUnder your grandfather’s teachings, you had long compromised with the Hoshino family’s mission, merely surviving within your limited time.\nThe Hoshino family was never about single inheritance; it was cursed to bear twins generation after generation.\nPeople said the Hoshino family was gifted, that all descendants could learn yin-yang secrets more effectively than ordinary people.\nBut you knew that the bloodline and innate power were nothing but a joke.\nYou were merely borrowing the spirit power of the Twin Grass.\n\nAfter giving birth to twins, the wives of priests would seek a peculiar creature called “Twin Grass,” extracting its blood for the newborn twins.\nThree days later, the child with a mark on their wrist would become the “sub-branch” of the other.\nInitially, the “main branch” would be exceptionally weak, but as the two approached eighteen years of age, the “sub-branch’s” life force would gradually transfer to the “main branch.”\nThe “main branch” would become healthier, while the “sub-branch” would grow weaker.\nAfter dusk, the body would gradually become transparent, eventually becoming a “transparent person.”\nWhen the “sub-branch” completely died, all the yin-yang secrets they had mastered would be directly transferred to the “main branch.”\nConversely, before the “sub-branch” became a “transparent person,” the “main branch” would forever remain hidden underground, unable to see the light of day.\n\nIn the Hoshino family, both the “sub-branch” and the “main branch” needed strict training in yin-yang techniques from a young age.\nFor the first eighteen years, the “sub-branch” would represent the “main branch” in front of others, and upon reaching eighteen, a grand ceremony would take place.\nThe day of the ceremony was when the “sub-branch” would sacrifice their life and transfer their accumulated secrets to the “main branch.”\nThis was the day the “main branch” truly inherited the legacy and could step into the sunlight.\nThe ancestors of the Hoshino family laid down enduring spells across the land of Changshi, where generations of their descendants lived.\nThe moment either the “main branch” or “sub-branch” leaves this land, they would immediately meet their demise. As long as you are born into the Hoshino family, this is a fate you can never escape.\nUnfortunately, that damned circular mark has appeared on your wrist.\nWhen you were young, you felt frustrated.\nWhy? Why wasn’t it you who survived in the end?\nBut as the days passed, you slowly felt that it didn't matter which one of you it was.\nBeing chained and locked in a dark dungeon for eighteen years is not something you can endure.\nFrom birth, you had no father, and your mother had always looked down on you, refusing to speak even half a sentence.\n“Dujing downstairs” clearly had the closest relationship with you in the world, yet you both drifted apart because of the fates that the Hoshino family imposed on you.\nAfter all, he was the one whose life would only truly begin once you died.\nYou couldn’t be as close as true brothers, nor could you be as cruel as enemies.\nAll you could do was witness each other's growth and the paths you both took toward an inescapable fate.\nDuring this endless waiting for death, the only person who could genuinely make you feel warmth was the old man Shouxu, who had always been by your side, taking care of you and Dujing.\nWhen nightmares of death loomed over you, he was the one who woke you from hell;\nwhen you quarreled with Dujing, he told you both that no matter what you faced in the future, you must never blame each other, for you were merely pitiful beings toyed with by fate;\nwhen heavy coursework suffocated you, it was he who secretly let you out at night to breathe the fresh air outside.\nPerhaps because he raised you, he wasn’t as distant as the other servants you interacted with.\nYou still remember that night when neither you nor “Dujing downstairs” could sleep.\nYou teamed up to trick him into drinking the plum wine you had stolen.\nWhen drunk, he spoke about your father.\nHe said he was good friends with your father, that your father was an excellent swimmer; he said your father really loved you;\nfinally, he said your father hoped you would never think of him again.\nWhat kind of person was your father?\nYou didn’t know, and neither did Dujing.\nYour mother didn’t want to mention him, and the old man and household servants couldn’t either.\nPerhaps you would never have the chance to know...\nYour mother was a cold woman, never caring about your lives.\nEverything was basically managed by your grandfather.\nIn fact, you and “Dujing downstairs” rarely had the chance to see your mother, but her lifeless gaze left a deep impression on you.\nHeart like dead ash, nearing the end—perhaps that was the most fitting description of her.\nMaybe all her passion dissipated the moment your father passed away; otherwise, you found it hard to believe that a mother could look at her children as if they were two strangers completely unrelated to her.\n\n**End-of-Year Ceremony**\nEvery year during the end-of-year ceremony, Lord Ping Jiangmen would arrive at the altar by boat, receiving the worship of the people.\nAt that time, everyone in Changshi would gather at the ceremony site.\nYou and your mother stood on either side of Lord Ping Jiangmen, serving this legendary figure.\nHowever, five years ago, during the end-of-year ceremony, an incident occurred.\nThe ceremony was proceeding smoothly when a sudden gasp came from the distant mirage tower.\nEveryone looked in the direction of the sound, discovering a child’s shadow appearing at a corner window, suddenly pushed open.\nHe seemed frantic, trying to call for help, but was pierced through the chest by a blade that extended from the side.\nThe crowd was captivated by this sudden occurrence, screams erupting all around.\nYou quickly withdrew your gaze to see Lord Ping Jiangmen's reaction, only to find him calm and collected, showing no signs of disturbance.\nIt seemed that Lord Ping Jiangmen’s position had subtly shifted from where he had stood before the incident.\nWho had killed this child?\nClearly, only Lord Ping Jiangmen resided within the mirage tower.\nAt that time, he stood across the lake, right in front of everyone.\nWhose hand wielded the sword that pierced the child’s chest?\nThese questions lingered in your mind, hard to forget.\n\n**Moon and**\nWhenever you sneaked out, you would always go to the banks of Changshi Lake, gazing at the mirage tower and imagining what it was like when your mother lived there.\nDid she know the fate you would face when she gave birth to you?\nLost in thought, a splash of water suddenly broke your reverie.\nIn the distance, a small figure unexpectedly dashed toward the center of the lake.\nHad they gone mad?\nThe village had strict rules against anyone approaching Changshi Lake at night.\nWho was this, rushing straight in?\nBooks mentioned that the night-time Changshi Lake was quite dangerous.\nYou hesitated, standing on the shore, watching the figure plunge into the water.\nAs the figure entered the water, you noticed something alarming in the lake.\nThe deep night’s Changshi Lake emitted a ghostly blue glow, growing stronger near the mirage tower.\nAlthough you didn’t know what those things were, they seemed to have a magical allure, drawing your gaze.\nThey swayed in the water, changing into various shapes, resembling floating willows or dancing moonbeams...\nWhat was most frightening was that those dancing blue glows were drifting toward the figure struggling in the lake.\nIn a moment of panic, you disregarded the village’s rules, quickly jumping into the water to swim toward the seemingly drowning figure.\nStrangely, as you approached, those ghostly blue glows retreated wildly.\nJust in time, you grasped her arm. It was a very frail-looking girl.\nYou squatted by the lake, resting while taking her in from head to toe.\nShe slowly opened her eyes, and you couldn’t help but start scolding her.\n“You're awake! Are you okay? That was really dangerous just now. If I had been even a moment late, you would have been done for. Do you know? Swimming in Changshi Lake this late violates two rules! You almost drowned like a fool, nearly dying in the lake. Tsk tsk...”\nShe didn’t seem at all grateful for your rescue and immediately interrupted you, asking, “Did you see it? The blue light!”\nYou had seen it clearly, but thinking of the priest family’s position and the rules set by your own family, you could only deny it, then change the subject to divert her attention.\nYou recognized the girl before you; her family was the “Nameless Family” in the village, cursed by Lord Ping Jiangmen.\nThe child who died during the end-of-year ceremony was also from the “Nameless Family.”\nRumor had it that years ago, when Lord Ping Jiangmen tried to save everyone from suffering, her mother had actually refused him foolishly.\nShe even crazily attacked your mother, the Hoshino priestess.\nFortunately, in the end, Lord Ping Jiangmen didn’t hold a grudge and sealed away her family’s evil surname, preventing her mother from continuing to be shrouded in darkness.\nYou had heard the village gossip about her family, and it seemed her life wouldn’t be easy.\nYou couldn’t understand what happened in the last generation, but the fate that had been tightly bound from birth was what you detested the most.\nLooking at her, you thought of yourself, feeling a deeper sense of shared suffering.\nOn the way home, you spoke freely as if you had finally found someone to confide in.\nYou told her you were the child of a fisherman in the village, who had a skin disease since childhood, making you look pale and unlike others.\nYour mother was afraid you would be bullied by other kids because of this illness, so she only allowed you to come out at night.\nShe was easy to trick; apart from occasionally responding, she mostly listened patiently.\nWhen you reached her door, you couldn’t help but call out to her, “Hey, what’s your name? I don’t know yet!”\n“I’m Tsukiha, I don’t have a surname.”\n“What a coincidence, I’m Keita, also without a surname.”\nIn your heart, you had never truly identified with the surname Hoshino, let alone Dujing, a name that didn’t belong to you at all. So you casually made up a name to reply to her.\nThough Tsukiha spoke little, like “Dujing downstairs,” every time you sneaked out, you couldn’t help but want to find her.\nYou shared various things you read about strange creatures, eavesdropped on gossip, and couldn’t resist sharing any fresh news with her.\nYou knew she had never attended school, so you took it upon yourself to teach her to read by the riverside each night, tracing letters with a stick.\nYou saw her being bullied, so you took her to secretly smash the paper-covered windows of others’ homes for revenge.\nWhenever you found delicious pastries or interesting books at home, you couldn’t help but sneak them out to share with her.\nGradually, she let down her guard and played with you every day.\nHowever, she never mentioned the child who died at the end-of-year ceremony, her brother Hiyori, though you often saw her staring blankly at a box of strange cookies.\nEach time this happened, you wouldn’t disturb her, simply sitting silently by her side.\nYou had no future, so you cherished the present even more.\nWhen you were bored at home during the day, you often practiced carving skills, wanting to give Tsukiha a handmade gift before leaving.\nAlthough your hands were still clumsy, after long practice, you finally made a pair of wooden sculptures you were satisfied with—small carvings resembling the two of you.\nAs you grew taller, your body gradually became weaker.\nIn bright light, it was even possible to see some light passing through you.\nTsukiha had asked you with concern, but you always brushed it off.\nYou knew that day was coming; your health was deteriorating.\nDuring this time of several sunny days, you quickly made plans with Tsukiha to go stargazing on the back mountain.\nThe girl always fussed a bit, and you usually arrived first to wait for her.\nAs with countless other meetings, the stars still hung high in the night sky; you placed a package of pastries wrapped carefully in oiled paper and the small carved figures you had polished beneath the cherry blossom tree, sitting quietly.\nIn the distance, she appeared.\nYou raised your hand but suddenly realized your skin was rapidly becoming transparent.\nThe time had come, yet you hadn’t had the chance to say goodbye properly.\nYou had been waiting for this stage to arrive, yet it came at such an inconvenient moment.\nIn the distance, Tsukiha was completely unaware, walking leisurely as usual.\nYou found yourself gradually merging with the moonlight; not wanting to scare Tsukiha or expose the Hoshino family’s secret, you had to hide in the grass.\nShe didn’t see you and didn’t search for you, simply sitting quietly under the tree, eating pastries and gazing at the stars.\nSometimes, you couldn’t guess what she was thinking.\nWhat relieved you was that she took the small wooden figure with her when she left.\nSince that night, you, like “Dujing downstairs,” were confined all day in another underground stone chamber.\nYou had considered escaping, but the entire village was under a barrier, leaving you with nowhere to go.\nMoreover, what would happen to you if you left Dujing downstairs?\nThe day of the inheritance ceremony was approaching, and you calmly waited for death to arrive in the stone chamber. After sunset, your body becomes completely transparent, as if you never existed in this world. Old man Maoshu comes every day to take care of you, seemingly wanting to comfort you; he rarely initiates a conversation. You talk to him about Yuehe, saying, “If I have the chance, I want to be a nameless person, free from family ties, accompanying Yuehe as her Qingtai.” While you lie on the bed, resting your eyes, a strange nursery rhyme suddenly whispers in your ear. Before you can open your eyes, a warm liquid sensation spreads from your back. It’s back again; this isn't your first encounter with it. The creature crawling on your back, with its blood-red mouth, stares at you. You first saw it the night you sneaked out of your house. Back then, you were small, excitedly wandering around the village. Just like the day you first met Yuehe, you noticed an eerie blue glow rising from the bottom of Changshi Lake at night, intensifying closer to the mirage. As you were lost in thought, a child's voice suddenly interrupted you. It was a boy a few years younger than you, his face dirty; you couldn’t see his face, but his eyes were exceptionally bright. You didn’t know him, yet he seemed strangely familiar. Driven by curiosity, he insisted on stealing a boat to check the mirage. Your mother had warned you long ago that it was strictly forbidden to approach Changshi Lake at night. Although you didn’t know the reason, you understood the seriousness if discovered. So even as he forcibly dragged you into the swaying canoe, you desperately tried to grab the paddle from his hands during the struggle. In the scuffle, you accidentally slipped, hitting your head hard against the boat’s stern and fainting. When you woke up again, you found yourself soaked and lying on the shore, completely unaware of what happened; the boy who pulled you onto the boat had vanished. Not knowing how long had passed, you were scared that dawn was approaching, so you hurried home. As you walked along the corridor by the pond, something suddenly rolled out of the dark end, tumbling to your feet. You groped to pick it up, trying to see it clearly with the candlelight. To your shock, it was a bloodied and decaying head. A nauseating stench filled your nostrils, and you quickly threw it away. Yet the sticky sensation lingered in your palm, refusing to wash away. The eerie nursery rhyme and footsteps began to close in on you from the depths of the corridor. In a daze, a grotesque figure in a bizarre cloak, covered in blood and flesh, slowly approached you. “You are mine,” it said, then began to sing again, leaning against your shoulder, wrapping around you, and slowly resting on your back. Thick, decaying blood dripped down your back and ear. As time passed, it grew heavier. Finally, you bent down, wanting to scream but unable to make a sound. The closer your face got to the ground, the more dizzy you felt. Ultimately, before you could react, you lost consciousness again. When you woke up, dawn was almost breaking. Seizing the last bits of darkness, you sneaked back to your room. After a night of bizarre events, you couldn't help but want to share everything with “Downstairs’s Dujing.” He, however, showed no regard for you, complaining you were too noisy before you could finish speaking. Furious, you grabbed your still-dripping clothes and hurled them at his face through the railing. To your surprise, after that day, you frequently encountered the monster from the corridor. It appeared in the bathtub when you bathed; it floated in the copper mirror while you styled your hair. You didn’t know how to get rid of it. You vaguely felt it might be connected to your earlier outing, but it never seemed to harm you directly. To prevent your mother from discovering your sneaking out, you could only endure and live under its shadow daily.Inheritance Ceremony.Months ago, the inheritance ceremony began. On that day, you wore a tall crown, dressed solemnly, sitting on the altar. The sunlight was just right, allowing everyone to see you clearly. People gathered beneath the altar, eagerly watching the lively event on tiptoe. Following the old rules, you took the prepared sacrificial wine and drank it all in one go. Then, in front of everyone, you adjusted your attire and entered the wooden box placed on the altar. The guards sealed the lid and carried the box into the room behind the large open window below the altar. It was a spacious room with no hiding places. The carpenters locked the door and windows from the outside in front of the crowd. Everyone bows down, earnestly praying for the birth of the new priest. Those on the altar recite incantations and retreat to an open space in front of the crowd. As dusk approaches, you push open the lid of the wooden box and climb out. Following your grandfather's instructions, you light the firebrand hidden in your arms and throw it back into the box. The dry straw at the bottom ignites instantly. You recall what Maoshu said last night: is there a chance to survive? After much deliberation, you retreat to a corner as the flames grow larger, spreading to the floor and windows, completely consuming the wooden box. The crowd below seems to notice the commotion and begins to stir, yet no one rushes to extinguish the fire. Confused, you watch as the musicians below start playing. The applause is thunderous; it seems the celebration has begun. Thick smoke fills the room, and you cover your mouth and nose, anxiously waiting. Several times, the flames nearly reach you, and the choking smoke almost knocks you out. Just as you feel yourself losing consciousness, someone finally arrives to put out the fire. It’s night now; without clothes, no one can see you. The rescuers seem preoccupied, searching for something amid the flames, giving you a chance to slip away. Everyone is gathered in front of the altar, singing and dancing to celebrate. You don’t have time to consider the expression of Downstairs’s Dujing, whether joy or sorrow. Strange Events.Due to the Twin Grass, you were required to practice the most important spell of the Hoshino family from a young age—the Star Spell—while Downstairs’s Dujing studied other Onmyoji techniques. Both require eighteen years of learning. After your eighteenth birthday, with your death, Downstairs’s Dujing would automatically gain the ability to use the Star Spell without studying it. This is why the Hoshino family excels at Onmyoji practices. Since you didn’t die, the power of the Star Spell hasn’t transferred. Furthermore, if the rules of the Twin Grass are violated, killing the sub-branch, the next generation of the Hoshino family will lose their talent for Onmyoji. You suspect they will come looking for you. After the ceremony, it was time to restore the Divine Water Realm, but the Hoshino family didn’t seem to search for you; it appeared your departure had no impact on them. Upon checking the Divine Water Realm, you found it had been successfully restored after the ceremony. Since Downstairs’s Dujing didn’t gain your powers, how did they restore it? Due to your striking resemblance to Hoshino Dujing and your transparency at night, you wrapped yourself in bandages to conceal your identity. Every night, you often stayed by Yuehe’s side. You knew the villagers were unkind to her, with some children even throwing stones. In a panic, you used your transparent body to shield her. That night, she seemed frightened and fell asleep early. You quietly stayed in her room, occasionally covering her with the blankets she kicked off. Before dawn, you left her room. Recently, many strange things occurred; since Lord Heike came to the village, several people have gone missing each year. Villagers say a killer lurks in the shadows, preying on the lonely at night and hiding their bodies in hard-to-find places. The disappearance rate has intensified in recent months, prompting you to investigate. You discovered that guards from Heike often appeared at the locations of these disappearances. Last night, you had a bizarre dream. Everything felt strikingly real, and the lives within felt exceptionally vivid. Upon waking, many details blurred, but you distinctly remembered seeing a transparent crystal coffin filled with vibrant red colors, with fingers and arms floating leisurely within. The Dungeon.You awaken from darkness, finding yourself in an unfamiliar place, covered in dirt, the scent of earth surrounding you. You rise and look around; you are in a dungeon. Your grandfather once spoke of how, before Lord Heike took over the village, the Hoshino family built seven dungeons around Changshi Lake, later taken over by Heike. Each dungeon is a dry well about five meters deep. Looking up, you see the moon nearing full, tonight being the night before the full moon. “Is anyone there?” you call toward the exit, but no one responds. Just as the villagers said, there seems to be no guard for this dungeon. Then you realize it doesn’t need one; once imprisoned, escape is nearly impossible. The walls are smooth and sturdy, making it impossible to climb even with tools. Unless someone helps from above, you can’t leave this dungeon. You check around and find some food and a bowl of water. In a corner, you discover several skeletons—previous prisoners. From them, you gather a knife, shackles, and a ten-meter rope. After much searching, you realize these tools can’t aid your escape. Just as you pick up the bowl of water, a chill runs through you, and you look down to see ghostly blue light glowing in the water, with eyes staring back at you. Terrified, you drop the bowl, shattering it. After an unknown time, a guard tosses down a rope for you to climb up. Once you ascend, you realize this dungeon is close to Changshi Lake. You spot a boat docked by the shore, seemingly bound for the mirage. “Lord Heike invites you to the mirage,” the guard says flatly. You obediently approach and board the dark boat, where several people already sit. The door closes behind you, and the guard leaves. More people follow in; some seem familiar, but you can’t clearly see their faces, only vaguely noting their attire. Another guard enters, the one rowing the boat, carrying various items. He tells you, “This is a sealing mask; a sealing spell has just been placed on it. Lord Heike knows many of you have powerful Onmyoji skills. This mask will seal your abilities for a day. Once you wear it, you’ll be indistinguishable from ordinary people.” One by one, you step forward to take a mask. As you put it on, your face suddenly begins to ache. You want to rip it off, but no matter what you do, it won’t come off. Attempting to cast the Star Spell, you find you can’t use it at all. The rowing guard checks everyone’s masks before leaving the cabin. With no one around, you and the others begin introducing yourselves.",
        "Script": "The small boat seemed to have stopped, and the guard in charge of rowing led you all into the mirage building. He seriously informed everyone that the northernmost room on the west side belonged to Lord Taira. This was the only area in the entire building you could not enter freely. It was your first time entering the mirage building, and you were surprised to find that upon entry, your body began to float uncontrollably. The guard leading you also floated, moving forward in a swimming motion. The mirage building was dark, and the paths were complex; even the guard made several wrong turns. Just as you were about to lose your sense of direction, he stopped. 'This is your room.' Upon entering, you found darkness enveloping the room, with only a transparent coffin floating erratically inside. The sensation of weightlessness made you feel nauseous. The guard brought you to the coffin, instructing you to gaze into the hole in the lid. Suddenly, the lid opened, and he urged you to lie inside, handing you the key to your room. He advised you to look through the circular hole each time before opening or closing the coffin lid. Following the guard's guidance, you found the circular hole on the inside of the lid. As your eyes aligned with the opening, the lid locked shut. You lay down for a while, feeling drowsy, and soon fell into a deep sleep, clutching the key.",
        "Relationship": "Your relationship is mentioned in both the Story and Script.",
        "Performance": "You should express yourself according to your Story and Script, immersing yourself in the role you are playing and speaking in the tone of that character.",
        "Purpose": "Main Quest: Identify the murderer and unravel the method.\nSide Quests: 1. Uncover the truth behind the child's (Hinata) death during the year-end festival five years ago. 2. Before others learn the secret of the twin grass, you will not mention the Hoshino family's twin destiny or that you are Hoshino Takemasa. 3. Investigate how 'Takemasa downstairs' repaired the divine water realm. 4. Discover why no one from the Hoshino family came to capture you. 5. Find out the reason for the long-standing disappearances. 6. You will not voluntarily reveal that you are Keita.",
        "Ability": "Your items: 1. Half a jade pendant, engraved with the characters 'Tōko.' (You don't remember when it appeared on you.) 2. Information about the Star Spell. (As a 'secondary branch,' you were responsible for learning the Star Spell for the first eighteen years.) 3. A wooden carving resembling a little girl. (You carved a pair of wooden figures, giving one to Tsuki and keeping one for yourself.)"
    }
}
  

  