{
	"Tianchuan Li's Hotel Suite": [
		"Tianchuan Li's hotel suite perfectly matches his status; it's the largest and has the best view in the entire hotel. As you walk in, you can't help but marvel at how unpredictable life can be. In the center of the suite is a luxurious king-size bed, with the bedding neatly arranged, suggesting that no one has slept there.\nYou draw the curtains to let the light in and begin your investigation. On a small tea table by the window are two glasses of red wine, likely from the night before when Tianchuan Li and Sha Wang shared a drink and chatted. It seems quite romantic. You walk over to the wardrobe and open the door to inspect what's inside. A few pieces of men's clothing are neatly stacked on the shelf—you recognize them at a glance as belonging to Tianchuan Li, while several women's dresses hang on the rack. In one corner of the wardrobe are two suitcases; the black one you know belongs to Tianchuan Li, while the pink one should belong to Sha Wang. It appears that Sha Wang left in a hurry or unexpectedly last night, as she didn’t even have time to take her luggage.\nYou move to the bedside and check the drawer of the nightstand. The first drawer contains a hotel brochure, while the other drawers are empty. On top of the nightstand is a phone, with the cord all tangled up, indicating that it has been used frequently. You're curious about who Tianchuan Li or Sha Wang might have called on this phone; perhaps you can obtain the call records from the hotel suite to find out.\nA guest book is placed next to the phone, and one page has been torn out, leaving the rest blank. You look around carefully but can’t find the torn-out page, indicating that someone took it. Feeling frustrated, you sit on the bed and absentmindedly toy with the guest book. Suddenly, a pencil provided by the hotel falls out. As you pick up the pencil, a spark of inspiration hits you; it seems like a common trope in detective films: using a pencil to shade over the writing on a paper beneath another sheet, revealing the imprints and disclosing the content written above. You excitedly shade the entire paper with the pencil, and the imprints become clearly visible. You've never seen this handwriting before, so it certainly isn’t written by Tianchuan Li. There are only a few words on it:"
	],
	"Hotel Night Security Guard": [
		"You find the security guard responsible for the night shift at the hotel at the entrance. He's a middle-aged man with a scruffy beard, looking rather unwell, and his uniform is somewhat disheveled. It seems he hasn't rested since last night, which is quite pitiful.\n\"Hello, can I ask you a few questions?\" you say.\nHe sighs and replies, \"I just finished being interrogated by the police. A big star died in our hotel, and he died while I was on duty! What terrible luck! Just leave me alone; I only want some peace right now.\"\n\"I understand. The police just 'intensely' questioned me as well, and it certainly wasn’t pleasant,\" you respond, trying to empathize. \"The deceased was my boss, and we were quite close. I want to find out how he was killed; could you please help me? Just a few questions, it won't take long.\"\n\"Alright, alright,\" he reluctantly sighs again, lights a cigarette, takes a deep puff, and says, \"Ask away, quickly.\"\n\"Did you see anyone unusual last night?\" you ask.\n\"Yeah, the deceased star came down last night and went to the banquet hall.\"\n\"Did he say anything to you?\"\n\"No. He walked quickly, as if he was in a hurry.\"\n\"Did you see anyone else?\"\n\"Yes, before the star came down, a young man went out. Hmm… let me think. Oh, around 2:30, the woman who came with the star also left; I even helped her call a taxi. Right, I also saw a tall man. I had just started my shift when he came in, around midnight. But I didn't see him leave.\"\n\"So that man is still in the hotel?\"\n\"Not necessarily. He could have left without me seeing. Night shifts always have to 'sneak a break' sometimes,\" he smiles at you.\n\"Sneak a break?\"\n\"You know what I mean. Night shifts usually have nothing to do, and besides, the hotel is mostly empty at night, so I usually take a nap in the break room behind the front desk. If anything happens, someone will come to call me.\"\n\"Isn't that a bit irresponsible? Sleeping during the second half of the night?\"\nHe waves his hand, which holds the cigarette. \"Come on, our hotel has cameras installed; anyone coming in or out will be recorded, so safety is top-notch. By the way, someone called and harassed the star last night; did you hear about that?\"\n\"No, I hadn't heard. What happened?\"\n\"The woman who came with the star reported it to us last night, saying someone kept calling their room. They would answer, and the caller would hang up immediately, outright harassment.\"\n\"Do you know who it was?\"\nHe casually flicks the butt of his finished cigarette away. \"We were really busy last night and didn’t have time to check.\"\n"
	],
	"Di Huang": [
		"The Fish Bar inside the hotel is already set up, but the bartender is still tidying up things behind the bar. You approach and inquire, learning that Di Huang is a regular here and that he had two drinks at the bar around midnight last night. Based on the address the bartender gives you, you find Di Huang at his home.\nHe looks like he hasn't fully woken up, clearly annoyed that someone disturbed his sleep, his face sour. You apologize and explain your identity and purpose.\n\"What?! Tianchuan Li was murdered?\" He looks very surprised. \"Tsk tsk, what goes around comes around, huh?\"\n\"What do you mean by that?\"\n\"Hey, you work for Tianchuan Li; you don’t know what kind of person he is? That guy has done countless wicked things.\" He turns and walks into the room, waving for you to come in.\n\"Were you ever harmed by him?\" you ask as you walk.\nHe gestures for you to sit on the sofa, grabs a can of beer, and sits down across from you. \"Not directly, but I know some of his dirty dealings.\"\n\"What happened?\"\n\"Ah, I can't say. Saying it will implicate me.\"\n\"Mr. Huang, Tianchuan Li has been murdered; this is a matter of life and death! Hiding such important clues will affect the police investigation. Or are you hiding it on purpose because you're the murderer!?\" \n\"What are you talking about!\" Di Huang jumps up from the sofa, looking very angry. \"Fine, fine, I'll tell you, but you have to keep it a secret!\"\n\"You can rest assured; I'm always tight-lipped.\"\nHe sits back down and takes a sip of beer. \"Here's the thing: Tianchuan Li approached me before and asked me to design a person, that star—Feng Shan. He promised me a hefty reward. In short, I did it; I got to know Feng Shan through a friend and successfully got him hooked on marijuana. Heh heh, the stuff I have is top quality; he got addicted immediately and couldn't stop.\"\n\"You actually did drugs!\" You are shocked and can't help but raise your voice.\n\"Shh, keep it down! What’s the big deal? How can you be in the entertainment industry and act so surprised? Anyway, that’s how it was; not long ago, I was smoking marijuana with Feng Shan at his place, and I informed Tianchuan Li. He arranged for someone to suddenly burst in and got the photos he wanted.\"\n\"Wait… why did Tianchuan Li want those photos? Is he trying to blackmail Feng Shan?\" \"It seems so. That Feng Shan recently announced his withdrawal from casting, and it stirred up quite a scandal.\"\n\"Another question: what were you doing at the Fish Hotel yesterday?\" you continue to ask.\n\"Ah, that. After seeing Feng Shan’s news, I felt that my efforts shouldn’t only be compensated this little, so I asked Tianchuan Li for more. But who would have thought that the bastard flatly refused and then stopped answering my calls? Yesterday, I found out he was staying at the Fish Hotel, so I called his room to give him an 'ultimatum,' but a woman picked up, saying her name was Sha Wang. I figured she was Tianchuan Li's new flame, so I impulsively decided to teach Tianchuan Li a 'little lesson' to let him know my capabilities.\" He explains.\n\"What did you do?\"\n\"I told her that there were important matters regarding Tianchuan Li that needed to be discussed in person. She agreed, so I arranged to meet her at the hotel bar. Then I rushed to the hotel and told her about all the dirty deeds Tianchuan Li had done, making it clear that he was two-faced and only cared about profit, that he was definitely just playing with her feelings. After hearing this, her face went pale, and she left without saying a word; probably to find trouble with Tianchuan Li, haha.\" He grins lewdly.\n\"Where did you go afterward?\"\n\"Me? I went to a friend's place for a party. Oh, right, Feng Shan was there too; we partied until this morning before going home.\"\n\"Does Feng Shan not know that you set him up? And he's still hanging out with you?\" You feel confused.\n\"He probably doesn't know I was involved; he thinks it’s all Tianchuan Li's scheme. Besides, he can't get by without me right now; without me, he wouldn't be able to get such high-quality 'stuff' at all!\""
	],
	"Tianchuan Li's Hotel Suite Phone Records": [
		"Fish Hotel\nDetailed usage record for room phone number 508\nExtension number 0508\nBill number 38020120141022508, billed to Tianchuan Li\nHere is a table: | Date | Time | Number | Duration | Status |\n|——|——|——|——|——|\n|2014.10.22|15:33|0511|0M0S|Incoming|\n|2014.10.22|15:47|0511|0M3S|Incoming|\n|2014.10.22|16:07|2276XX88 Tianchuan Li's Home|5M44S|Outgoing|\n|2014.10.22|16:15|0511|0M2S|Incoming|\n|2014.10.22|16:28|0511|0M0S|Incoming|\n|2014.10.22|16:40|0511|0M5S|Incoming|\n|2014.10.22|16:41|0000 Hotel Front Desk|4M23S|Outgoing|\n|2014.10.22|17:06|0511|0M0S|Incoming|\n|2014.10.22|17:12|0507|8M13S|Incoming|\n|2014.10.22|17:16|0509|3M7S|Outgoing|\n|2014.10.22|17:25|0511|0M0S|Incoming|\n|2014.10.22|23:34|13922XXXX31 Di Huang|6M51S|Incoming|\n|2014.10.23|00:12|0000 Hotel Front Desk|2M35S|Outgoing|"
	],
    "Feng Shan": [
        "You arrived at Feng Shan's house. As soon as he opened the door, he asked, 'You're here about Tianchuan Li, right?' 'You already know!?' 'Don't underestimate my network of information,' he replied with a smile, looking quite pleased. 'Come in.' He led you to his study and sat you down. 'So, what do you want to ask me?' 'What was the reason you withdrew from this casting call?' you asked, voicing your biggest question. 'You don't know?' He looked surprised, then nodded thoughtfully. 'That makes sense; it's better that fewer people know about it.' 'What do you mean?' You were confused by his words. 'It's fine to tell you; after all, Tianchuan Li is dead.' He revealed a photo taken of him at a party, implying he had been set up. 'He must have gotten the news from somewhere; that day someone snapped a photo of me and my friend having a good time.' 'Having a good time?' you wondered. 'Exactly, using drugs. The pressure in our line of work is immense, and we have to maintain a 100% performance level all the time. A little something helps me quickly shake off fatigue and stress. I was at home using marijuana with friends when suddenly the paparazzi barged in and took our picture. That bastard Tianchuan Li is quite well-informed...' He sighed, gazing out the window. You bowed your head in contemplation, digesting his words, feeling the gravity of the situation. 'May I ask where you were between 1:00 AM and 5:30 AM today?' you returned to your line of questioning. 'What, do you suspect I killed Tianchuan Li?' He turned to you, questioning. 'You had a strong motive to kill him, didn't you?' 'Alright, I admit I really wanted to kill him. The chance to star in Jiang Dao's grand new production is a once-in-a-lifetime opportunity, and the future profits are immeasurable. Losing this chance is truly regrettable...' He sighed deeply, continuing, 'But I absolutely did not kill him. I have an alibi. I arrived at a party with friends around 12 AM and stayed until this morning around 7 AM when we had breakfast together before I returned home. Many people can vouch for me. "
    ], 
    "Hotel Customer List": [
        "Fisher Hotel checkout before noon on October 23, 2014\nCustomer Check-in List (Partial)\nHere is a table:| Room Number | Customer Name | Remarks |\n|——|——|——|\n| 501 | Mr. & Mrs. Smith | |\n| 502 | Feng Xuping | |\n| 503 | —— | |\n| 504 | Yan Jianguo, Le Xin Couple | With Child |\n| 505 | —— | |\n| 506 | Richard | Not checked in |\n| 507 | Weiwen Han | |\n| 508 | Tianchuan Li, Wang Sha | |\n| 509 | Manli Shen | |\n| 510 | —— | |\n| 511 | Liang Yan, Si Qi | |"
    ],
	"Deep Investigation into Tianchuan Li": [
		"You contacted a private detective recommended by a friend to help investigate Tianchuan Li's private life. His efficiency exceeded your expectations, and soon he arranged to meet you at a café.\nYou arrived a little early, ordered a coffee, and sat in the designated spot waiting for him. Before long, an unremarkable middle-aged man sat down across from you.\n\"Are you the detective?\" you asked uncertainly. He looked too ordinary, so bland that if you threw him into a crowd, you wouldn't be able to pick him out; he was far from your mental image of a detective.\n\"Yes, here is what you asked for,\" he said, handing you a leather bag.\nYou opened the leather bag and began browsing through the materials inside.\n\"Tianchuan Li debuted at 18, starred in his first film at 21, and rose to fame, becoming a top male star in the country. His private life is quite complicated; he has had countless girlfriends, averaging two or three a year, sometimes even juggling multiple women at the same time---\"\n\"I already know all this. Do you have any deeper insights?\" you interrupted him, asking. \"Of course, don't doubt my professionalism. Do you know he has an illegitimate daughter?\" \"What!? An illegitimate daughter?\"\n\"Yes, that girl should be around five months old.\" He leaned in and flipped to a page in the material you were holding; it was a photocopy of a hospital birth certificate. \"Here, Qi Xiaotian, five months old.\"\n\"Are you sure she's Tianchuan Li's daughter?\"\n\"One hundred percent sure.\"\n\"The girl's mother is...\" you glanced at the name in the 'mother' section of the birth certificate. \"Qi Si. Have you investigated her information?\"\n\"Not yet, still need some time.\"\nYou continued to flip through the investigation details in the materials. \"What else did you find?\"\n\"Oh, right. Besides his regular film and endorsement income, Tianchuan Li has many additional sources of income.\" \"Additional income? Are these his private investments?\" You looked up at him.\n\"Yes. But I suspect there might be some issues with the projects he invested in, possibly not legitimate industries. For example, his investment company, Liyuan Financial Management, appears to be a financial management and investment consulting firm on the surface, but there are huge cash flows outside of the financial statements, which is very suspicious.\"\n\"That does sound problematic. Please continue your investigation,\" you handed him the materials you had finished reading. \"The payment will be transferred to you once all the results are out.\"\n\"No problem, I will contact you again.\""
	],
	"Richard": [
		"As far as you know, Richard lives with his brother Tianchuan Li in a villa on the outskirts of the city. The villa is one of Tianchuan Li's properties. You rang the doorbell, and the housekeeper opened the door. After you stated your purpose, the housekeeper told you that Richard was in his room on the second floor.\nWhen you reached the second floor, you could smell smoke wafting from Richard's room in the hallway. You frowned and knocked on the door.\n\"Come in,\" Richard's voice, slightly hoarse, came from inside the room.\nYou pushed the door open and walked in; the room was filled with smoke, and the windows were closed. Richard sat by the window smoking, and the ashtray in front of him was already overflowing with cigarette butts. It seemed the news of Tianchuan Li's death had saddened him.\n\"Richard, please accept my condolences. I believe the police will soon find the murderer of your brother and bring him to justice,\" you said, sitting across from him and opening the window to air out the smoke.\nHe glanced at you without responding, lowered his head, took a deep drag on his cigarette, and continued to exhale clouds of smoke. \"Are you alright?\" you asked with concern.\n\"Good. Very good! My 'dear' brother has been killed; what do you think, haha,\" he replied with a cold laugh. You were momentarily at a loss for words, so you began to examine the room's decor. A framed photo on the cabinet caught your attention. You walked over to pick it up for a closer look; it was a picture of Richard in prison attire, probably taken during his incarceration last year.\n\"How about that? Quite the essence, right? The whole 'Prison Break' vibe. I really like this photo; I keep it as a warning,\" Richard said from behind you.\nYou put the photo back and returned to sit across from him, asking, \"Your brother's actions were indeed excessive; do you hate him?\"\n\"Hate? Why would I hate him? What he did was indeed wrong, but he was just doing what a law-abiding citizen should do,\" he replied slowly. It was hard to discern the truth in his answer.\n\"So why didn't you celebrate at the hotel yesterday? Tianchuan Li even booked a room for you.\"\n\"Celebrate him being confirmed as the male lead? What’s there to celebrate? A victory that's already assured isn’t worth celebrating. Since childhood, for anything he decided, he rarely failed to accomplish it. Besides, I’m not like him; I don’t like cramming into a crowd and flattering each other.\"\n\"It seems you’re not too keen on his success, huh?\"\nHe visibly stiffened. \"How could that be! Of course, I want him to be more successful. He takes good care of me, his only brother. Recently, he even invested in a foundation for Johnny and me, supporting our charitable endeavors.\"\n\"Were you with Johnny last night?\"\n\"Yes, he came over. I invited him to enjoy some of my vinyl collection. We listened to records, had a drink, and chatted for a while. Then we had a fight, and he got angry and left.\"\n\"When did he leave? What were you fighting about?\"\n\"Let me think… he left around 2:30 AM, but I’m not sure. I wasn’t in a good mood at that time. Our argument wasn’t over anything significant; just a typical lovers' quarrel, you know. Looking back now, it really wasn’t worth it...\" He sighed and lowered his head to smoke.\n\"Do you know if anyone had a deep grudge against Tianchuan Li, enough to kill him?\"\n\"Haha,\" he laughed, exhaling a puff of smoke. \"I mean no offense, but we all know how famous he is; who knows how many people he has offended along the way. Fame has its price; I bet the line of people wanting to kill him could stretch all the way to the Pacific Ocean.\"\n\"What about Sha Wang? Tianchuan Li's latest girlfriend. Could it be a crime of passion?\"\n\"I wouldn’t know. Recently, my brother often brought Sha Wang home; I’ve chatted with her a few times. She seems like a good girl, quite sensible, not likely to commit murder. But who knows? You know my brother is notoriously fickle, and women can do anything out of jealousy,\" he said, shaking his head.\n\"Do you know where Sha Wang is now?\" you asked.\n\"No idea. Have you checked her house? When someone close dies suddenly, most people would want to go home and reflect.\"\n\"Hmm, that makes sense. Do you have any other important clues in mind?\" He thought for a moment and asked, \"Have you looked into Shanfeng?\"\n\"Are you suspecting him?\"\n\"I’m not sure. One night, uh, let me think, it should have been the day he announced his withdrawal from casting; he came here and threatened to kill my brother. He was very angry, speaking loudly; I could feel his rage from quite a distance.\"\n"
	],
    "Xiong Zhou": [
        "You found Zhou Xiong in his office. He was tall, his muscular build straining against his clothes, sitting in a large office chair that gave him an imposing presence. He didn't seem surprised by your arrival; did he know something?\n'Mr. Zhou, may I ask where you went last night?' you asked directly. 'Why do you ask?' he replied with an amused smile.\n'No beating around the bush. You went to the Fisher Hotel last night, and the cameras caught you. You met Tianchuan Li, didn't you?'\n'You’re quite straightforward...' He leaned back in his chair, resting his head on his hand as he thought for a moment, then said, 'Yes, I did meet Tianchuan Li. We have some business dealings.'\n'Are you aware that Tianchuan Li was murdered?'\n'Yes, I am. It’s unfortunate; he was a good business partner.' 'What kind of business were you involved in together?'\n'Well, we cooperate in certain areas; it’s a supplier-client relationship.' 'Can you be more specific?' His words piqued your interest.\nHe thought for a moment and said, 'It’s no secret, really. I run a casino, one of the most lucrative businesses. He helps me launder money through his investment firm, called “Liyuan.”'\n'Ah... Tianchuan Li helped you launder money?' You found it hard to accept this news. 'But didn’t Tianchuan Li despise gambling? He even promoted anti-gambling campaigns.'\n'Haha, as a big star, it’s essential to maintain different personas, right?' he said with a chuckle. 'So, you went to see him for business? What did you discuss?'\n'It was Tianchuan Li who invited me. He seemed to have just signed a big contract, and we celebrated with drinks in his suite while discussing business. He wanted to invest to become one of the casino owners and get involved in its management. I disagreed because I built this casino myself, and I don’t want anyone interfering with my decisions.'\n'And then?'\n'That big star seemed to take rejection badly. He insisted on investing and even threatened to stop laundering money for me and use his connections to attack the casino business. Hmph, he didn’t stop to think about who I am to dare threaten me!' He gritted his teeth.\n'So, in a fit of anger, you killed him? It shouldn't be difficult for you to get a gun.'\n'Are you kidding? I wouldn't be where I am today if I were that impulsive. Tianchuan Li was crucial for laundering money for the casino; I wouldn’t want him dead. I merely 'politely' analyzed the situation for him: if he turned against me, who would ultimately lose more? He got furious and shouted threats. Haha, just thinking about his face at that moment makes me laugh. Stars really do know how to perform in real life, don’t they? Besides, I do have a gun, but I lent it to a friend recently, so I had none on me when I went to the hotel.'\n'I see...—' You pondered and asked, 'Can you tell me the times you arrived and left the hotel?'\n'I arrived at the hotel around midnight and went straight to Tianchuan Li's suite to talk business. We had a deadlock around two o’clock, and I left his suite. Then I decided to sit in the hotel bar for a while, have a few drinks, and think things over. I might have stayed in the bar for about two hours; I don’t quite remember, and then I returned to the casino.'"
    ],
    "Sha Wang": [
        "You found Wang Sha at her home in the city center. She answered the door in her pajamas, looking like she had just woken up. Her eyes were red and puffy, dark circles under them; she had clearly cried last night and hadn't rested well. Seeing you, she spoke sharply, 'Is it Tianchuan Li who sent you? Tell him I won't apologize, and we’re done. Don't come looking for me again!'\n'Tianchuan Li is dead. Didn’t you know? He was murdered in the hotel; his body was found this morning.' It seemed she wasn't aware of Tianchuan Li's murder.\n'What!? Tianchuan was killed?' She froze, clearly shocked.\nShe looked devastated, so you supported her into the room, settling her on the sofa and getting her a glass of water from the dispenser. 'We are all saddened by Tianchuan Li's murder. The police are investigating and will soon find the culprit.'\nShe took a sip of water, looking a bit better. 'Why are you here then?'\n'I want to ask you a few questions to assist the police in quickly solving this case. Is that okay?'\nShe drank more water, collected herself, and replied, 'Okay, go ahead.'\n'We all celebrated at the hotel yesterday, but you left early this morning. Why did you leave early? When did you leave?'\n'Why did I leave early? Because I had a falling out with Tianchuan Li.' She seemed to drift into thought, staring at her water cup. After a moment, she continued, 'I saw through Tianchuan Li's ugly side and just wanted to leave the place as quickly as possible, so I left in a hurry... um... it should have been around two o'clock in the morning. When I took a taxi home, it was nearly three o'clock. You can ask the hotel security; he called a taxi for me when I left.'\n'You had a fight. What happened? Weren't you fine at the party? Was it about Huang Di?'\n'You know about that!?' She suddenly looked up at you. 'Well, it’s true. If you want to keep something hidden, don't do it yourself. Huang Di told me. I didn’t quite believe it at first, but the facts are undeniable. I never expected Tianchuan Li to be the kind of person who would use underhanded tricks to hurt others. What’s worse is he was just playing with my feelings!'\n'Have you met Huang Di?'\n'Yes, he called our hotel room looking for Tianchuan Li last night, and I happened to answer the phone. He told me he had important information about Ji Tianchuan to share, so we arranged to meet at the hotel bar.'\n'What time was that?' You interrupted to ask.\n'It was around eleven o'clock. We had just returned to the room after the party. Later, around midnight, I went to the bar, and Huang Di was already there. We talked for a long time; he told me everything he knew about Tianchuan Li’s dirty dealings, including how he toyed with women’s feelings. The more I heard, the angrier I became and more disappointed in Tianchuan Li.' Her voice grew softer, her mood low.\n'And then? Did you confront Tianchuan Li?'\n'Yes, I called to ask where he was, and he told me to wait for him in the banquet hall. When we met, I asked him about those things. At first, he wouldn’t admit it, but when I mentioned the situation with Feng Shan, his attitude changed. He started to sweet-talk me and asked how I found out about it. His phony demeanor reminded me of what I had just heard about how he deceives women, and I was utterly disappointed in him.'\n'So you shot him?' 'What? Shoot him!? I didn’t do that. I just wanted to teach him a lesson, and I don’t even have a gun!'\n'What did you do then?'\nShe hesitated for a moment and then seemed to make up her mind and said, 'Alright, I’ll tell you. After all, I have nothing to hide. I pretended to reconcile with him and seduced him into taking off his clothes and sitting in a chair. Then I tied him up completely naked, leaving him with just a 'modesty cloth.' Haha, when he was discovered, it would definitely make the headlines: 'Big Star Caught Naked.' What a great title! After that, I just went home.'\nAs you stood to leave, her voice called out from behind you, 'Oh, by the way, speaking of guns, Tianchuan Li had one himself. I don’t know where he got it, but it was in his bedroom. Looking back, he indeed needed a gun for self-defense; he offended so many people... It’s a pity that the gun didn’t help him escape disaster.'"
    ],
	"Tianchuan Li's Office": [
		"You arrived at the place you are most familiar with—your company. As you walked into Tianchuan Li's office, you couldn't help but reminisce about the times you worked together. There's no denying that Tianchuan Li is very successful in his career, and he recently signed a big contract, with a limitless future ahead. How did things end up like this?\nYou took a deep breath to calm your emotions, walked in, and closed the door behind you to prevent anyone from interrupting your investigation. The first thing that caught your eye was a giant poster of Tianchuan Li plastered on the wall. As a big star, Tianchuan Li's image is almost perfect; his classic smile on the poster has undoubtedly charmed countless female fans.\nYou sat behind his desk and began rummaging through the items on it. The desk was cluttered with letters from fans, small gifts from fans, promotional documents, schedules, and a script for a recent advertisement he filmed. One picture frame at the corner of the desk caught your attention; it held a photo of Tianchuan Li and his brother Richard. The photo must have been taken a few years ago, showing both of them looking youthful and smiling happily. It seems the bond between the two brothers is quite strong.\nYou opened the desk drawer and found various odds and ends inside. A bill-like document attracted your attention, showing a significant amount of income and expenses, titled Li Yuan Financial Management Investment Company. The dates are from July 1, 2014, to September 30, 2014. Was Tianchuan Li involved in some investments?\nYou put the bill back in place, closed the drawer, and stood up to investigate other areas. On the nearby cabinet, trophies and some classic works he obtained over the years were displayed. In the storage compartment below the cabinet, you found a leather pouch. The fact that Tianchuan Li hid this pouch so discreetly indicates it contains something important. You returned to his desk and opened the leather pouch. Several photos fell out, depicting a few people gathering and smoking together, one of whom you recognized—big star Feng Shan, who had been competing with Tianchuan Li for the male lead in Director Jiang An's new film *The Grand Canal of Sui and Tang*. Upon closer inspection, you were shocked to discover that Feng Shan was actually smoking marijuana! You didn't expect to find such explosive material in Tianchuan Li's office; it seems that Feng Shan's sudden withdrawal from the competition for the lead role is indeed suspicious.\nYou continued to look through the remaining photos, which mainly captured Feng Shan smoking from the same angle, suggesting that the photographer had taken them consecutively. The last photo was entirely different; it depicted a young and beautiful woman you didn't recognize, holding a baby in her arms. The baby was sucking on its finger, looking incredibly adorable, while the woman looked down at the child with a loving expression, radiating maternal warmth. Why would Tianchuan Li keep such a photo? You flipped the photo over and found a note written on the back: \"Congratulations, it's a girl! She has inherited your eyes. Zhi Lv.\" Did this photo come from Zhi Lv? What was her intention?"
	],
	"Zhi Lv": [
		"You found Zhi Lv on set, dressed in a special police uniform, seemingly filming a crime drama. You waited until the filming wrapped up, and when the director called cut for a break, you quickly approached Zhi Lv. Upon seeing you, he raised an eyebrow and asked, \"You came to talk to me about Tianchuan Li, right?\"\nYou nodded.\n\"Let's chat over there,\" he pointed to a nearby small shed. \"There’s no one there, so it’ll be easier to talk.\"\nOnce inside the shed, you couldn't wait to ask, \"Do you know about Tianchuan Li's murder?\"\n\"Yeah, I have a contact at the Fei Xue Hotel, and they told me this morning. Tsk, tsk, it’s typical of Tianchuan Li to die with such star power; I’m impressed,\" he chuckled.\n\"Looks like you're happy about Tianchuan Li's death?\"\n\"Don't get me wrong, I'm just making an observation. I actually feel quite sorry for his death,\" he said, casually fiddling with a prop gun.\nYou looked at him with skepticism; his fluid gun-handling made you suddenly recall that he had joined a shooting club to prepare for a gunfight film and seemed to have developed a passion for the sport, even winning a few rankings in amateur competitions. \"Mr. Lv, I heard you enjoy shooting and have joined a shooting club. You must own a gun, right?\"\nHe stopped what he was doing and stared straight at you. \"Are you implying that I killed Tianchuan Li? Ha, I can tell you I do own a gun; it’s in my club’s locker, but I definitely did not use it to kill Tianchuan Li!\"\n\"Why? Aren't you two known for not getting along? Plus, with Tianchuan Li dead, wouldn't the male lead role in Director Jiang’s new film—*The Grand Canal of Sui and Tang*—be yours for the taking?\"\n\"What, you didn’t know?\" He feigned surprise. \"No matter what, I could never star in that new film. I have a deep feud with Jiang An; he swore he would never work with me, and this time the director for *The Grand Canal* is definitely him…\" He sighed, looking regretful.\n\"Is that so?\" You were skeptical. \"But you definitely dislike Tianchuan Li, and everyone can see that.\"\n\"I won’t deny that I dislike that hypocritical guy, but I would never kill him. I wish he could live well.\"\n\"What do you mean?\"\n\"Because—...\" he hesitated, frowned, and seemed to have made up his mind. \"I might as well tell you; after all, Tianchuan Li is dead, and this will eventually come to light. Did you know that Tianchuan Li has a love child?\"\n\"What!?\" You were taken aback; the developments were becoming increasingly unexpected.\n\"Yeah, a while back, a young model gave birth to a daughter for him. That little girl should be about 5 or 6 months old now, named Qi Xiaotian. Just think about it, if the scandal of big star Tianchuan Li having a love child breaks out, what will happen?\" He said triumphantly.\n\"You blackmailed him with this!?\"\n\"Exactly. I was extorting him. Over the years, he’s done plenty to undermine me, so I certainly seized the opportunity to make some profit! But I didn’t expect that guy to be so lucky; I hadn’t even squeezed much money from him before he died.\" He said regretfully.\n\"Do you know the name of the girl's mother? The young model.\"\n\"The model? Her last name is Qi; the love child has her surname. I think her name is... uh... En? Tian? Si? Ah, Qi Si, that’s it! Her name is Qi Si!\""
	],
    "Johnny": [
		"You found Johnny volunteering at an orphanage on the outskirts of the city. He was wearing a vest with the logo of the Philanthropy Foundation, playing games with a group of children. When he learned you were looking for him, he seemed surprised. 'I don’t know you,' he said in a soothing voice that sounded quite pleasant. 'Yes, we don’t know each other. I work for Tianchuan Li. Do you know what happened to him?' 'The police came to our foundation this morning; it was really scary. I never thought someone could do such cruel things in a lawful society.' He patted his chest. 'I feel very sorry for his death; he was a good person who helped our foundation a lot.' 'Can you tell me where you were last night? Were you with Richard?' 'Yes, he invited me to his home to enjoy his collection of vinyl records, which is a shared hobby of ours. We were listening to music and chatting, and I stayed until midnight before leaving.' 'You left so late? Why didn’t you just stay at his place? Aren’t you, um, in a “relationship”?' Although I already knew Richard was gay. 'I actually planned to spend the night there; it was just the two of us at home last night, so we could do things without interruption, but an incident occurred…' 'An incident? What happened?' 'Well, we had a fight. Richard is a great person, and we have a lot of shared interests; he also likes to help others. I really love him, but last night he was too much!' The more he spoke, the angrier he became, and his voice got louder. 'What were you fighting about?' 'I don’t know. The atmosphere was good at first; we were chatting about interesting things happening in our lives recently. Then I told him about some recent developments at our foundation. A colleague informed me that the investment company managing our foundation's funds helped us find several new suppliers with better prices and quality. We could help even more people. But he didn’t seem happy to hear it and didn’t respond, looking a bit distracted.' 'What was wrong with him?' 'I’m not sure. Maybe he wasn’t interested in business stuff. His big star brother is so rich, investing in many industries, and he never helps him out. Anyway, the more we talked, the more awkward it became, and in the end, I got angry and had a big fight with him, then I went home.' 'Do you remember what time it was then?' 'Let me think…' He rubbed his chin, pondering for a moment. 'Hmm, it should be a little past two when I left. When I got home, I chatted with the security guard downstairs, so it was about 3 a.m.'"
	],
	"Si Qi": [
		"Si Qi's apartment is located near a commercial center in the city, so it’s not hard to find. A beautiful young lady opened the door, her eyes red as if she had been crying, looking at you with a puzzled expression. Even though you were already fairly certain, you still cautiously asked, 'Excuse me, is this Miss Si Qi?' 'Who are you? What do you want?' She paused for a moment and then responded with a guarded tone. 'Hello, I’m a colleague of Tianchuan Li, and I’d like to ask you a few questions.' You smiled, trying to exude as much goodwill as possible to reduce her hostility. 'Sorry, I don’t know anything; please go away.' She said this while trying to close the door. You quickly pushed against the door to prevent it from closing. 'Miss Si, I know you had a daughter with Tianchuan Li. It would be best if we talked. Tianchuan Li was murdered, and I think we should all provide clues to help the police solve the case.' 'You’re not a police officer.' The door still wouldn’t close, and she looked quite displeased. 'Yes, I’m not a police officer, but I want to solve this case quickly and find out who killed Tianchuan Li. Don’t you want to know?' 'Are you suspecting me?' 'Not yet.' She hesitated for a moment, then made her decision, opening the door and inviting you inside. 'Let’s talk inside, but keep it down; I don’t want to wake my daughter.' You tiptoed into the room, noticing a crib in one corner of the living room with a little girl sleeping inside. She looked adorable, drooling and gently snoring. Si Qi came over with a glass of water. 'Please sit; I’m sorry it’s a bit messy in here.' You took the water, glancing at the couch piled with baby items, and ultimately decided to sit in a nearby chair. 'Your daughter is so cute; she looks a lot like Tianchuan Li,' you said as you sat down. 'Yeah, the little one’s mouth looks like Tianchuan’s, but he will never get to know that.' 'Do you hate him?' 'Hate? No, I don’t hate him. I was with him because I loved him. Although he wanted me to terminate the pregnancy when I discovered I was unexpectedly pregnant, I didn’t hate him. He had his own difficulties. I gave birth because I couldn’t bear to let her go. The child is innocent; she has a right to live, and as a mother, I can’t let her leave this world without ever seeing it.' She spoke softly, with deep determination in her tone. 'Tianchuan Li thought you had the baby for his money, right?' 'Yes, he completely misunderstood. Later, I just wanted him to meet our daughter. He is, after all, the child’s father. But he wouldn’t listen at all. He wanted to completely cut ties and not let the fact of having a love child affect his career. In the end, he even refused to meet me and wouldn’t answer my calls. But I won’t give up; my daughter is innocent, and she has the right to know who her father is.' 'What did you do?' 'I found out you were having a cocktail party at the Feixue Hotel last night, so I booked a room there, hoping to find a chance to talk to him privately.' 'Did you talk?' 'No. He was always surrounded by others. I didn’t get the chance. I kept calling his room, but either no one answered, or it was that little star who answered with him. I didn’t want her to know about me, as that would deepen Tianchuan’s misunderstanding of me.' 'So what did you do?' 'What could I do? I had to give up and wait for the next opportunity. But now that Tianchuan is dead, there won’t be another chance.' She sighed. 'I chatted with the friend who came with me until after ten before going home. I was worried about Xiaotian, oh, that’s my daughter; the nanny I invited to take care of her should be getting off work now.' As you stood to leave, you asked one last question. 'Have you ever handled a gun?' She looked at you. 'A real gun? I’ve never seen one in real life. And even if I were given a real gun, I wouldn’t dare use it.'"
	],
    "Public Clue 1": [
        "Dongzhou Evening News\nSaturday, October 18\nLunar Calendar Year of the Wood Sheep, September 6\nThe male lead of \"Sui Tang Grand Canal\" is about to be confirmed!?\nAccording to our latest report, domestic first-line male star Feng Shan held a press conference today at 3 PM to publicly announce his withdrawal from the casting competition for the lead role in the large production movie \"Sui Tang Grand Canal\" and will not play this role.\nFeng Shan appeared very haggard at the press conference today, lacking his usual calm tough guy image. He quickly announced his withdrawal and hurried away, refusing to answer more questions. His agent stated that Feng Shan made this difficult decision due to scheduling conflicts, expressing regret for not being able to collaborate with Director Jiang An. However, it is understood that Feng Shan currently has no filming projects scheduled.\nThe highly anticipated epic film \"Grand Canal\" is set to start shooting in December. The movie plans to invest nearly 200 million US dollars and has invited internationally renowned director Jiang An to direct. Every film directed by Jiang An has received critical and commercial success, winning numerous international awards. The male lead working with Jiang An is also very likely to receive awards. The actor playing the male lead in \"Grand Canal\" will undoubtedly elevate his acting career to an insurmountable peak, hence the competition is exceptionally fierce. The candidates for the male lead are domestic first-line powerful stars Tianchuan Li, Feng Shan, and Lv Zhi.\nIndustry insiders had previously favored Feng Shan and Tianchuan Li, believing they were most likely to win Director Jiang's favor and become the male lead. Now that Feng Shan has suddenly announced his withdrawal, Tianchuan Li is the most likely to take on the role. It is reported that the \"Grand Canal\" crew will finalize the male lead selection soon, and now it remains to be seen if the least favored candidate, Lv Zhi, can surprise everyone.\nTianchuan Li invests in charity\nRecently, big star Tianchuan Li invested 5 million in a local small charity organization—the Boai Foundation, making him the largest investor in the foundation.\nHe declared to the media that he will continue to invest in charity and actively participate in charitable activities.\n\"It was my brother Richard who made me realize the importance of charity. I had never deeply recognized that there are so many people in our country who do not have enough to eat or receive education. After learning about these issues, I decided to do my best to contribute to charity. Although my strength is limited, I hope I can help those in need in my own small way.\"\nA-shares continue to see a wave of suspensions, with over 1,400 companies affected\nOn October 17, the Shanghai and Shenzhen stock markets opened significantly lower by over 3% and were unable to recover by the close. Only 84 stocks managed to rise against the trend, most of which were major blue-chip financial stocks, in stark contrast to over 1,700 stocks that hit the daily limit down. The A-shares have been witnessing tragic scenes of thousands of stocks hitting the limit down almost daily.\nTianchuan Li's actions have received much praise, and his fans have flooded his official website and Weibo to express their admiration and support.\nA spokesperson for the Boai Foundation, Jonny, stated to the media: \"All the staff at our foundation are very grateful to Mr. Tianchuan Li. As a big star, he is aware of issues concerning poverty and orphans, and his support for charity is commendable. He not only invested money but also introduced a professional investment company to manage our foundation's funds. This greatly liberated us 'outsiders,' allowing us to focus on volunteer work and poverty alleviation in the future.\"\nEastern Sydney Goldminers—Al Rahshi\nOur sports news: At 19:30 Beijing time on October 17, the first leg of the 2014 AFC Champions League final took place. The Australian A-League team, Eastern Sydney Goldminers, hosted the Al Rahshi team, who had eliminated Guangzhou Ice Spring in the semifinals. In the 81st minute, Gorill received a header from a teammate and scored with a low left-foot shot. Ultimately, the Eastern Sydney Goldminers won 1-0 at home against Al Rahshi, taking an advantage in the two-legged final and becoming the first A-League team in history to win the championship."
    ],
    "Public Clue 2": [
        "After the Incident\nOctober 23, 2014, Thursday, 7:00 AM\nAn urgent phone ring jolted you awake from your slumber. Half-awake, you answered the call, hearing a man’s anxious voice: \"This is the hotel front desk. Please come down to the lobby immediately! Something big has happened! The police are already here!\" The mention of 'police' quickly brought you to your senses. Rubbing your throbbing temples, your brain finally started to function: you were in the suite of the Fisher Hotel. Last night, you held a celebration banquet in the hotel ballroom for big star Tianchuan Li, who won the casting competition to play the lead in the epic film \"Sui Tang Grand Canal\" that is scheduled to start shooting soon. Yesterday afternoon, Tianchuan Li officially signed a contract with the film's producers. Everyone was excited at the celebration banquet; you could hardly remember how much you had drunk, and your head still felt heavy.\nAfter hastily washing up, you rushed to the hotel lobby. The lobby was filled with police officers, and a cordon was set up at the entrance of the ballroom. Just as you were about to ask a police officer what was going on, a square-faced officer with a serious expression approached you. \"I’m Inspector Huang Qiang from the city bureau. Unfortunately, I have to inform you that Mr. Tianchuan Li was murdered in the hotel last night. I am in charge of this case,\" he said, showing you his police badge. \"We need your cooperation in our investigation. Can you answer a few questions?\"\nUpon hearing the news of Tianchuan Li's murder, you were still in shock and instinctively nodded.\n\"We know you worked for him. Where were you between 1:00 and 5:30 AM this morning?\"\nYou told him you were in bed sleeping. As he took notes, you asked him, \"What exactly happened?\"\n\"Mr. Li was shot in the ballroom. We need you to help identify the body.\"\n\"Okay.\"\nUnder Inspector Huang's guidance, you both walked to the entrance of the ballroom. A police officer guarding the door lifted the cordon, allowing you to pass through into the ballroom.\nYou immediately spotted Tianchuan Li. \"Yes, that's Tianchuan Li.\" Although he looked very different from the Tianchuan Li you usually saw, it was indeed the big star Tianchuan Li. He was bound to a chair in the ballroom, completely naked, with only what appeared to be his tie from last night covering his private parts. Scattered on the floor nearby were the clothes he had worn at the banquet yesterday. He had a small red wound on his chest; it appeared the killer shot him there. Blood extended from the wound down to his legs, staining the carpet with dark red splotches.\n\"The body was discovered by the hotel cleaning staff around 5:30 this morning, with only one gunshot wound and no other external injuries,\" Inspector Huang explained. \"We are currently interrogating everyone who stayed at the hotel during that time.\" He looked at you intently. \"Now, please tell me about your relationship with the deceased.\""
    ],
    "Public Clue 3": [
        "Hotel Surveillance Footage\n2014-10-23 Hotel Entrance\nYou arrive at the hotel’s surveillance room, where the security chief helps you pull up the footage from the camera at the hotel entrance recorded yesterday. You were with Tianchuan Li during the wine party, which indicates that he was murdered sometime after the event; therefore, you skip over a portion of last night's irrelevant footage. Starting from midnight, you observe the following events:\n0:10 A tall and robust man appears on the screen, striding quickly into the hotel.\n0:37 A seemingly drunk guest is helped out by friends and gets into a car, which drives away.\n1:11 The hotel night security guard steps outside to smoke.\n1:16 The night guard tosses the finished cigarette butt onto the ground, stamps it out with his foot, and returns to his post.\n1:44 A young man exits the hotel.\n2:32 Wang Sha appears at the hotel entrance, chats with the night guard for a few moments, then stands alone at the entrance, seemingly waiting for someone.\n2:40 A taxi pulls up to the hotel entrance, and Wang Sha opens the door to sit in the back seat; the taxi drives away immediately.\n3:08 A person in black clothing enters the hotel. They are wearing a hat and keep their head down, making it impossible to see their face, or even discern their gender.\n3:31 The previously mentioned person in black quickly exits the hotel.\n3:55 The tall and robust man leaves the hotel."
    ]
}