{
	"Stage 1": {
		"Weiwen Han": {
			"Story": "Weiwen Han (Kevin Han), Manager:\nWeiwen Han is the epitome of self-made success. Four years ago, when he was still a rookie, he was lucky enough to land the job of managing the superstar Tianchuan Li. Since then, he has thrown himself wholeheartedly into his work. He did not disappoint Tianchuan Li, who has remained a huge star in the past few years, and Weiwen has also achieved success in his own career. He is known for his upright personality and righteous behavior, unlike many other managers in the industry who use various despicable methods to achieve their goals.\nAt the age of 32, Weiwen Han is still single, but he believes that his destined soulmate will appear eventually. Recently, he has developed feelings for his colleague, Manli Shen, and feels she may be his 'fated girl.'\nFriends see Weiwen as a trustworthy person, and he also has a great sense of humor, being skilled at socializing.\nFriends affectionately call him 'Brother Han.'",
			"Script": "Last night at the celebration party, Tianchuan was accompanied by his latest rumored girlfriend, a rising star named Sha Wang. They were even assigned the same hotel room. After the party, they went back to their room together, but now she is nowhere to be found. Could she have fled out of guilt? Though this alone cannot prove her guilt, it's certainly suspicious, isn't it?\nOh, right, you suddenly remember that Little Shen has been taking care of Tianchuan's life over the past few months, and she was also by his side at the party last night. You should ask her whether there was any tension between Tianchuan and Sha Wang at the party, and if she knows whether Sha Wang had any motive to kill.\nWhen the police informed you that Tianchuan was shot, cold sweat broke out on your back, as you were the one who brought a gun to the hotel. After working as a manager for so long, you've made quite a few enemies, particularly a powerful boss you offended recently. He even threatened to make you pay in blood. That's why you asked a friend who runs a casino to get you a weapon for protection. Knowing your situation, he surprisingly lent you his own smuggled gun. You couldn't refuse and accepted it, planning to return it as soon as this difficult time passed. Now, with this incident happening, you seem like a prime suspect for the murder. But you didn't kill anyone, and the gun wasn't even loaded! Plus, you don’t even know how to shoot! You definitely don't want Little Shen to misunderstand you. If she asks, you might need to explain everything clearly.\nYou drank a lot at the party last night for the sake of networking, and after it ended, you went straight back to your room to rest.",
			"Relationship": "Manli Shen (Sally Sum), Assistant:\nManli Shen graduated from school two years ago and became Tianchuan Li's assistant six months ago. Since then, she has been busy non-stop, managing Tianchuan's life with great effort and keeping everything in perfect order. She works hard, but also enjoys life to the fullest when the time is right. She believes that people should give their all when working, but also indulge when it’s time to relax.\nManli has been waiting for her 'fated prince.' She has had one or two short-term relationships in the past, but is currently single. Recently, she's developed feelings for Weiwen Han, but this might be because they spend most of their time together, as both of their jobs revolve around the superstar Tianchuan Li.\nManli is kind-hearted, though sometimes her words come off as too direct, yet she means no harm. Friends appreciate her straightforward and lively nature.\nHer friends affectionately call her 'Little Shen.'",
			"Performance": "There were no other injuries on Tianchuan's body, which suggests he voluntarily took off his clothes and allowed himself to be tied up. Who could have persuaded him to do such a thing?",
			"Purpose": "Uncover the truth",
			"Ability": ""
		},
		"Manli Shen": {
			"Story": "Manli Shen (Sally Sum), Assistant:\nManli Shen graduated from school two years ago and became Tianchuan Li's assistant six months ago. Since then, she has been busy non-stop, managing Tianchuan's life with great effort and keeping everything in perfect order. She works hard, but also enjoys life to the fullest when the time is right. She believes that people should give their all when working, but also indulge when it’s time to relax.\nManli has been waiting for her 'fated prince.' She has had one or two short-term relationships in the past, but is currently single. Recently, she's developed feelings for Weiwen Han, but this might be because they spend most of their time together, as both of their jobs revolve around the superstar Tianchuan Li.\nManli is kind-hearted, though sometimes her words come off as too direct, yet she means no harm. Friends appreciate her straightforward and lively nature.\nHer friends affectionately call her 'Little Shen.'",
			"Script": "Officer Huang, who is in charge of this case, solemnly informed you that since both you and Brother Han were at the hotel during the time of the incident, you are both considered prime suspects. You feel outraged, thinking this decision is far too hasty. There's no way you two could be murderers! Wait a minute... Brother Han has seemed distracted all morning, as if he's hiding something. Could it be…? You need to ask him if he's been keeping any secrets that he should have told you, and also what he did after the party last night.\nAt the celebration party last night, you were diligently by Tianchuan Li's side the entire time. He was in a great mood all evening, constantly flirting with his rumored girlfriend, the rising star Sha Wang. The two of them were laughing and chatting happily throughout the event. Though the media only recently broke the news of their relationship, you, being his close assistant, know they've been dating for months. Sha Wang admires Tianchuan deeply and loves him dearly, and Tianchuan is very kind to her in return. If anyone suspects Sha Wang of killing Tianchuan, you simply can't fathom what her motive could be.",
			"Relationship": "Weiwen Han (Kevin Han), Manager:\nWeiwen Han is the epitome of self-made success. Four years ago, when he was still a rookie, he was lucky enough to land the job of managing the superstar Tianchuan Li. Since then, he has thrown himself wholeheartedly into his work. He did not disappoint Tianchuan Li, who has remained a huge star in the past few years, and Weiwen has also achieved success in his own career. He is known for his upright personality and righteous behavior, unlike many other managers in the industry who use various despicable methods to achieve their goals.\nAt the age of 32, Weiwen Han is still single, but he believes that his destined soulmate will appear eventually. Recently, he has developed feelings for his colleague, Manli Shen, and feels she may be his 'fated girl.'\nFriends see Weiwen as a trustworthy person, and he also has a great sense of humor, being skilled at socializing.\nFriends affectionately call him 'Brother Han.'",
			"Performance": "After the party last night, there was a loud argument heard from Tianchuan's suite. Was Tianchuan arguing with Sha Wang? It seems you need to investigate this further.",
			"Purpose": "Uncover the truth",
			"Ability": ""
		}
	},
    "Stage 2": {
		"Weiwen Han": {
			"Story": "",
			"Script": "You had almost forgotten, but the news of Tianchuan Li's murder reminded you that when you woke up in the early hours of this morning, around 2 to 3 a.m., you vaguely heard the sound of Sally's door opening and closing. It seemed like someone left Sally's room in the middle of the night. Was it Sally? Why did she go out? It looks like you should ask her if she was alone in the room last night and what exactly she was doing in the room.\nThe decision of Feng Shan to withdraw from the casting was shocking news. Besides the official explanation, you've heard many rumors, such as: Feng Shan recently discovered that he was terminally ill; Feng Shan decided to leave the dirty entertainment industry and become a monk, etc. (Feel free to elaborate, but don't exaggerate too much).\nTianchuan Li was a proud man, and after rising to fame, he became somewhat arrogant and relentless in his actions. Many people in the industry didn't like him, even his younger brother wasn't particularly fond of him.",
			"Relationship": "Sally Sum, Assistant:\nSally Sum has been out of school for two years now. Six months ago, she applied to become the assistant to the big star, Tianchuan Li. Since then, she's been extremely busy, working very hard to manage Tianchuan Li's life in an orderly manner. Although she's diligent at work, she also knows how to enjoy herself when off duty. She believes that when people work, they should give it their all, and when it's time to relax, they should enjoy life to the fullest.\nSally has been waiting for her 'Mr. Right.' She has had one or two short relationships, but is currently single. Lately, she's been growing more fond of Weiwen Han, but perhaps it's because they spend so much time together, given that their work revolves around the big star, Tianchuan Li.\nSally is a kind girl, though sometimes her words can come across as overly direct, but she means no harm. Her friends appreciate her straightforward personality.\nHer friends call her 'Xiao Shen.'",
			"Performance": "Hotels are public places where anyone can come and go freely, so the killer might not be someone from the hotel.",
			"Purpose": "Find out the truth",
			"Ability": ""
		},
		"Manli Shen": {
			"Story": "",
			"Script": "You spent the whole night in your room alone. Since there's no one to prove this for you, to convince Kevin, you might want to mention some specific things you did, such as watching TV or going straight to bed (feel free to elaborate, but don't exaggerate). \nLast night, you were awakened by some noise. After listening carefully, you realized it was coming from outside. So you opened the door and stepped into the hallway, but you didn't see anything. \nYou know that being a celebrity means a lot of gossip, and for every person who likes you, there are just as many who dislike you. But due to his personality, Tianchuan Li seemed to have too many enemies. This casting event alone has offended quite a few people... By the way, if it weren't for Feng Shan suddenly dropping out of the competition, Tianchuan Li might not have secured the contract so smoothly. You should ask Kevin if he's heard any possible reasons for Feng Shan's sudden withdrawal, and whether he knows of anyone who doesn't like Tianchuan Li.",
			"Relationship": "Weiwen Han, Agent:\nWeiwen Han is a self-made man. Four years ago, when he was still relatively inexperienced, he was lucky enough to take on the role of agent for the big star, Tianchuan Li. Since then, he's devoted himself entirely to his work. He hasn’t let Tianchuan Li down, and in these past few years, Tianchuan Li has remained incredibly popular, while Kevin has also found success in his career. Weiwen is honest and upright, unlike other agents in the industry who use various underhanded tactics to achieve their goals.\nAt 32 years old, Weiwen still hasn't found a woman in his life, but he believes his destined partner will appear one day. Recently, he's developed feelings for his colleague, Manli Shen, and he has a growing sense that she's the one he's destined to be with.\nHis friends all see him as someone trustworthy. Additionally, he's known for his sense of humor and his skill in social interactions.\nHis friends call him 'Kevin.'",
			"Performance": "In many detective stories, when a murder occurs, the protagonist often starts by retracing the timeline. You can try this method.",
			"Purpose": "Find out the truth",
			"Ability": ""
		}
	},
    "Stage 3": {
		"Weiwen Han": {
			"Story": "",
			"Script": "Maybe you should ask Sally about her views on Tianchuan Li. You know very well what kind of person Tianchuan Li is, and working for him isn’t easy. Could Sally have developed some resentment towards him?\nIf Sally tries to dismiss your questions with vague or superficial answers, keep pressing her. You know that to survive in this industry, sometimes people have to say things they don’t believe to protect themselves, but now is the time for honesty. Suddenly, you recall a rumor you heard not long ago—about a week ago, Tianchuan Li allegedly tried to harass Sally, but she slapped him. Knowing Tianchuan Li, he wouldn't have taken this lightly and probably threatened her. Could it be that Tianchuan Li pushed Sally too far, leading her to kill him? You need to ask her carefully; after all, murder is a capital crime, regardless of the reason.\nBy the way, perhaps you should also ask Sally if she has a gun.\nIf Sally turns the question back to you, asking your thoughts on Tianchuan Li, tell her that sometimes working for him is exhausting because you're always cleaning up the messes he leaves behind. Give specific examples, like how you disapprove of some of Tianchuan Li's sleazy tactics, even though you know it's common practice in the industry, etc. But be careful not to go too far, as it might make it seem like you’re implicating yourself.\nRecently, a major international entertainment company noticed your talents and offered you a very tempting deal, but you turned it down because you don't like big companies, where there are too many 'unspoken rules.' Somehow, Tianchuan Li found out about this and confronted you angrily. His unjust accusations really upset you, and the two of you had a big fight. But later, Tianchuan Li learned the truth, and the matter was resolved.",
			"Relationship": "Manli Shen, Assistant:\nManli Shen has been out of school for two years now. Six months ago, she applied to become the assistant to the big star, Tianchuan Li. Since then, she's been extremely busy, working very hard to manage Tianchuan Li's life in an orderly manner. Although she's diligent at work, she also knows how to enjoy herself when off duty. She believes that when people work, they should give it their all, and when it's time to relax, they should enjoy life to the fullest.\nManli has been waiting for her 'Mr. Right.' She has had one or two short relationships, but is currently single. Recently, she's been growing more fond of Weiwen Han, but perhaps it's because they spend so much time together, given that their work revolves around the big star, Tianchuan Li.\nManli is a kind girl, though sometimes her words can come across as overly direct, but she means no harm. Her friends appreciate her straightforward personality.\nHer friends call her 'Sally.'",
			"Performance": "Tianchuan Li was very protective of his privacy, guarding his personal life closely. There must be a reason for this, so maybe you should investigate further.",
			"Purpose": "Find out the truth",
			"Ability": ""
		},
		"Manli Shen": {
			"Story": "",
			"Script": "Ever since you became Tianchuan Li’s assistant a few months ago, people have constantly asked you about your opinion of him. Your official response is that Tianchuan Li is a dedicated actor, very kind, and always willing to help others. You say you're honored to be his assistant.\nBut in truth, you despise Tianchuan Li. He's narcissistic, lecherous, and shameless! What you can't tolerate the most is that about a week ago, he attempted to sexually harass you and tried to 'force' himself on you. He promised great benefits if you complied, but you sternly rejected him and even slapped him. You love money but you're not materialistic, and you would never sell out your emotions or body for it. Your rejection seemed to deeply wound his twisted ego, and he threatened to ruin your career if you didn't give in, giving you one month to reconsider. You're furious. There's no way you'd ever give in to such a scumbag. At worst, you'd just quit and change industries. You've decided that once the one-month deadline is up, you'll resign, making it clear that you won't bend to his will.\nAs an ordinary girl, you've never even seen a real gun, let alone owned one.\nYou suddenly recall a rumor about an international entertainment company that noticed Kevin's excellent management skills and wanted to recruit him, but Tianchuan Li refused to let him go. The two had a big fight over this. Could Kevin have killed Tianchuan Li because of this? Maybe you should ask Kevin what he really thinks of working for Tianchuan Li and whether he enjoys it.",
			"Relationship": "Weiwen Han, Agent:\nWeiwen Han is a self-made man. Four years ago, when he was still relatively inexperienced, he was lucky enough to take on the role of agent for the big star, Tianchuan Li. Since then, he's devoted himself entirely to his work. He hasn’t let Tianchuan Li down, and in these past few years, Tianchuan Li has remained incredibly popular, while Kevin has also found success in his career. Weiwen is honest and upright, unlike other agents in the industry who use various underhanded tactics to achieve their goals.\nAt 32 years old, Weiwen still hasn't found a woman in his life, but he believes his destined partner will appear one day. Recently, he's developed feelings for his colleague, Manli Shen, and he has a growing sense that she's the one he's destined to be with.\nHis friends all see him as someone trustworthy. Additionally, he's known for his sense of humor and his skill in social interactions.\nHis friends call him 'Kevin.'",
			"Performance": "Last night, Tianchuan Li also booked a room for his brother Richard, but no one saw Richard at the party, and it seems like he didn’t show up.",
			"Purpose": "Find out the truth",
			"Ability": ""
		}
	},
    "Stage 4": {
		"Weiwen Han": {
			"Story": "",
			"Script": "The man in black seen on the hotel's surveillance footage, who entered from outside, looks very suspicious. This might suggest that the murderer came from outside. This clears both you and Manli Shen of the suspicion of being the killer. Oh, it might also clear Sha Wang of suspicion.\nYou don't know much about Tianchuan Li's younger brother—Richard. Maybe Manli Shen, as an assistant, knows more about him than you do. You should ask her how much she knows about Richard. It seems like the two brothers, Tianchuan Li and Richard, don't get along. Could there be some special reason behind it?\nThe tall, muscular man in the surveillance footage is someone you're very familiar with—your good friend who runs a casino, Xiong Zhou! The gun you have was lent to you by him. You're surprised that he came to the hotel without informing you and without looking for you. You have no idea what he came to the hotel for.\nYou cannot identify the second person in the surveillance footage, nor can you tell if they are male or female.",
			"Relationship": "Manli Shen (Sally Sum), Assistant:\nManli Shen has been out of school for over two years. Six months ago, she applied to become the assistant of the big star Tianchuan Li. Since then, she has been busy all the time. She works very hard and manages Tianchuan Li's life meticulously. Although she works tirelessly, she doesn't hold back when it comes to enjoying life. She believes that one should give their all when it's time to work and enjoy to the fullest when it's time to relax.\nManli Shen has been waiting for her 'true love.' She's had one or two brief relationships, but she's currently single. Recently, she has been growing more and more fond of Weiwen Han, but this might be because they spend most of their time together, given that both of their jobs revolve around the big star Tianchuan Li.\nManli Shen is a kind girl, though sometimes her words may come off as too direct, but she means no harm. Her friends like her for her carefree personality.\nHer friends all call her 'Little Shen.'",
			"Performance": "Although you don't want to believe it, it seems like your friend Xiong Zhou has indeed kept a lot of things from you.",
			"Purpose": "Find out the truth",
			"Ability": ""
		},
		"Manli Shen": {
			"Story": "",
			"Script": "It seems like everything is becoming clear now. The surveillance footage has captured your main suspects. The tall, strong man and the person sneaking into the hotel after him are the most suspicious. First, figure out who they are. Ask Han if he recognizes these two people.\nYou don't know much about Tianchuan Li's brother—Richard. He's always polite to you and greets you every time you meet. You recall a story you heard about Richard. Last year, Tianchuan Li found out that Richard was hosting a debauched party at home and had called for sexual services. What shocked Tianchuan Li the most was that Richard had hired male prostitutes! He is homosexual. Tianchuan Li reported Richard to the police for prostitution, and he was taken away by the police, spending a few days in detention. This incident left Richard with a criminal record at the police station. It seems like Tianchuan Li also used this incident to heavily promote his image as a wholesome artist.",
			"Relationship": "Weiwen Han (Kevin Han), Manager:\nWeiwen Han is the epitome of self-made success. Since taking on the role of managing the big star Tianchuan Li four years ago, when he was still relatively inexperienced, he has fully dedicated himself to his work. He hasn't let Tianchuan Li down, as the star has remained popular throughout the years, and Weiwen has also achieved success in his own career. He is honest and upright, unlike other managers in the industry who use all kinds of unscrupulous methods to achieve their goals.\nAt 32, Weiwen Han, still single, believes that his destined one will eventually appear. Recently, he has developed a fondness for his colleague Manli Shen and secretly feels that she might be the one.\nFriends consider Weiwen Han to be a trustworthy person. He's also known for his humor and social skills.\nHis friends call him 'Brother Han.'",
			"Performance": "Maybe the tall, strong man in the surveillance footage is a key witness, or perhaps a primary suspect. You should find him and get more information.",
			"Purpose": "Find out the truth",
			"Ability": ""
		}
	},
    "Stage 5": {
		"Weiwen Han": {
			"Story": "",
			"Script": "Although Tian Chuan has a bad temper and has offended quite a few people, most of these incidents are minor, and as far as you know, there are no deep-seated grudges. He has maintained a bright and healthy image at work, and fans generally like him. For the upcoming blockbuster being prepared for filming, the industry consensus is that the casting for the male lead, Zhi Lv, is not promising. Compared to the other two stars, he is somewhat lacking in both fame and acting skills. You know a bit more about him; his private life is a mystery, and he has never been involved in any scandals. By the way, he and Li Tian Chuan are not on good terms, having repeatedly attacked each other on Weibo, and they often ignore each other in public appearances. You think you need to broaden your scope and consider other possibilities; no matter how far-fetched, any situation could happen, and anyone who has had contact with Tian Chuan could be a suspect. You just recalled that Tian Chuan has recently become enthusiastic about charity work, which he used to disdain. Perhaps Xiao Shen knows something; you should ask her if she is aware of any potential reasons behind Li Tian Chuan's sudden change of heart towards charity work. Oh, and casually ask her how much she knows about the representative of the foundation that Li Tian Chuan is heavily sponsoring—Jonny.",
			"Relationship": "Manli Shen (Sally Sum), Assistant:\nManli Shen graduated from school two years ago. Six months ago, she applied to become the assistant of the big star Li Tian Chuan. Since then, she has been busy, working very hard to keep Li Tian Chuan's life organized. Despite working tirelessly, she also 'spares no effort' in enjoying herself. She believes one should work hard when it's time to strive and enjoy life to the fullest when it's time to indulge.\nManli Shen has been waiting for her 'true love.' She has had one or two brief relationships but is currently still single. Recently, she has developed feelings for Weiwen Han, but this may be due to the fact that they spend most of their time together, given that their work revolves around the big star Li Tian Chuan.\nManli Shen is a kind girl who can sometimes be overly direct, but she is definitely not malicious. Her friends appreciate her straightforward personality.\nHer friends call her 'Xiao Shen.'",
			"Performance": "Li Tian Chuan's sudden financial support for charity work is a bit suspicious; investigate to see if there are any underlying reasons.",
			"Purpose": "Find out the truth",
			"Ability": ""
		},
		"Manli Shen": {
			"Story": "",
			"Script": "In your previous reasoning, you have always assumed that Li Tian Chuan was killed by someone close to him, but the killer could just as easily be a stranger. For example, someone he has offended or a fan who dislikes him... Ask Han Ge if Li Tian Chuan has offended anyone or if anyone has a deep grudge against him. Also, inquire about the other candidate for the blockbuster casting—Zhi Lv, and what he knows about him.\nAs far as you know, Li Tian Chuan has never shown much interest in charity work, nor has he ever participated in any charitable activities. However, he has recently started to take an interest in charity, and the reasons for this are merely speculative. Perhaps it was his brother Richard who asked him for help; you know that Richard has always been passionate about charity work. Maybe he has realized that supporting charity can help build a positive image and enhance his fame.\nYou don't know anything about the representative of the Philanthropy Foundation—Jonny. The foundation he represents has received substantial support from Li Tian Chuan, and he has publicly expressed gratitude and high praise for Li Tian Chuan in front of the media. Perhaps it's time to delve deeper into understanding him.",
			"Relationship": "Weiwen Han (Kevin Han), Agent:\nWeiwen Han is a prime example of someone who has risen from humble beginnings. Since he was fortunate enough to become the agent of the big star Li Tian Chuan four years ago, he has devoted himself entirely to his work. He has not let Li Tian Chuan down; Li Tian Chuan has remained popular over the years, and he has achieved success in his own career. He has an upright character and conducts his business properly, unlike other agents in the industry who use various unscrupulous means to achieve their goals.\nAt the age of 32, Weiwen Han has not yet found a woman, but he believes that his destined partner will eventually appear. Recently, he has developed feelings for his colleague Manli Shen and suspects that his 'true love' may be her.\nHis friends consider Weiwen Han to be a trustworthy person. In addition, he has a great sense of humor and is skilled at socializing.\nHis friends call him 'Han Ge.'",
			"Performance": "If the motive for the murder is related to grudges within the entertainment industry, then there must be some clues in Li Tian Chuan's office at the company.",
			"Purpose": "Find out the truth",
			"Ability": ""
		}
	},
    "Stage 6": {
        "Weiwen Han": {
            "Story": "",
            "Script": "When he discovered the corpse of Tianchuan Li, he was completely naked and tied to a chair. Either the murderer stripped him and then killed him while he was bound there, or he was already in the embarrassing situation of being naked and tied to the chair when the murderer walked in. But this is quite unscientific. Since the murderer used a gun to kill, why go through the trouble of tying Tianchuan Li to the chair? If Tianchuan Li was already bound when the murderer entered, why not choose a quieter, more discreet way to kill him? Ask Little Shen if she has a reasonable explanation.\nTell Little Shen who you think killed Tianchuan Li and how he (she) did it. You haven't investigated enough clues yet, so it's okay if your reasoning is incorrect.",
            "Relationship": "Manli Shen (Sally Sum), Assistant:\nManli Shen graduated from school two years ago. Six months ago, she applied to become the assistant to the big star Tianchuan Li. Since then, she has been extremely busy, working hard to keep Tianchuan Li's life in order. Although she works tirelessly, she also enjoys herself without holding back. She believes that one should give their all when it's time to work hard and fully enjoy life when it's time to relax.\nManli Shen has been waiting for her 'true love.' She has had one or two short-lived relationships, but she is still single. Recently, she has developed feelings for Weiwen Han, but that may be because they spend most of their time together, as their work revolves around big star Tianchuan Li.\nManli Shen is a kind girl who sometimes comes off as overly direct in her speech, but she means no harm. Her friends love her carefree personality.\nHer friends call her 'Little Shen.'",
            "Performance": "In detective studies, when clues are numerous and complicated, one must focus on the key points. The key factors in solving a case generally include motive, opportunity, and method, and the murderer must satisfy all three.",
            "Purpose": "Find the truth",
            "Ability": ""
        },
        "Manli Shen": {
            "Story": "",
            "Script": "The method of Tianchuan Li being tied to a chair and shot is indeed strange. You've thought of several possible reasons: perhaps the murderer hated him so much that they wanted to humiliate him before killing him. Or maybe the murderer didn't want to get blood on their hands while using a knife (feel free to elaborate, but don't exaggerate).\nYou already have some clues about the truth of this case, but you want to understand Weiwen's reasoning first. Ask him who he thinks killed Tianchuan Li, what that person's motive was, and how he did it.",
            "Relationship": "Weiwen Han (Kevin Han), Agent:\nWeiwen Han is a prime example of starting from scratch. Ever since he fortuitously took on the management of big star Tianchuan Li four years ago when he was still inexperienced, he has dedicated himself entirely to his work. He has not let Tianchuan Li down; the star has remained popular over the years, and he has achieved success in his career. He is upright and proper, unlike other agents in the industry who use various despicable means to achieve their goals.\nNow 32 years old, Weiwen Han is still without a woman by his side, but he believes that his destined partner will eventually appear. Recently, he has developed feelings for his colleague Manli Shen and vaguely feels that she is his 'true love.'\nHis friends think Weiwen Han is a trustworthy person. Additionally, he has a great sense of humor and is skilled at socializing.\nHis friends call him 'Wei Ge.'",
            "Performance": "Clues must be analyzed in connection with one another; when new clues are discovered, it's essential to review related old clues, as new insights may emerge.",
            "Purpose": "Find the truth",
            "Ability": ""
        }
    },
    "Stage 7": {
        "Weiwen Han": {
            "Story": "",
            "Script": "You don't have much time left. You can't investigate all the clues. Who holds the most critical information?",
            "Relationship": "Manli Shen (Sally Sum), Assistant:\nManli Shen graduated from school two years ago. Six months ago, she applied to become the assistant to the big star Tianchuan Li. Since then, she has been extremely busy, working hard to keep Tianchuan Li's life in order. Although she works tirelessly, she also enjoys herself without holding back. She believes that one should give their all when it's time to work hard and fully enjoy life when it's time to relax.\nManli Shen has been waiting for her 'true love.' She has had one or two short-lived relationships, but she is still single. Recently, she has developed feelings for Weiwen Han, but that may be because they spend most of their time together, as their work revolves around big star Tianchuan Li.\nManli Shen is a kind girl who sometimes comes off as overly direct in her speech, but she means no harm. Her friends love her carefree personality.\nHer friends call her 'Little Shen.'",
            "Performance": "You don't have much time left. You can't investigate all the clues. Who holds the most critical information?",
            "Purpose": "Find the truth",
            "Ability": ""
        },
        "Manli Shen": {
            "Story": "",
            "Script": "You don't have much time left. You can't investigate all the clues. Who holds the most critical information?",
            "Relationship": "Weiwen Han (Kevin Han), Agent:\nWeiwen Han is a prime example of starting from scratch. Ever since he fortuitously took on the management of big star Tianchuan Li four years ago when he was still inexperienced, he has dedicated himself entirely to his work. He has not let Tianchuan Li down; the star has remained popular over the years, and he has achieved success in his career. He is upright and proper, unlike other agents in the industry who use various despicable means to achieve their goals.\nNow 32 years old, Weiwen Han is still without a woman by his side, but he believes that his destined partner will eventually appear. Recently, he has developed feelings for his colleague Manli Shen and vaguely feels that she is his 'true love.'\nHis friends think Weiwen Han is a trustworthy person. Additionally, he has a great sense of humor and is skilled at socializing.\nHis friends call him 'Wei Ge.'",
            "Performance": "You don't have much time left. You can't investigate all the clues. Who holds the most critical information?",
            "Purpose": "Find the truth",
            "Ability": ""
        }
    }
}