{
	"韩乘务": {
		"Story": "韩乘务，全名韩亦暮，女25岁，去年9月进入船上工作，现在是东方之星号的乘务员。你有着强烈的好奇心，是船上的包打听。\n你对刘大副异常厌恶,他一直像指挥仆人一样指挥你，你想谋杀他，今天晚上，你把一瓶含有硫酸的饮料送到仓库给他。\n你的房间的墙上贴着一张刘大副的照片，你有一把BB弹手枪，你心存不满时就用BB弹打刘大副的照片。你用一张其他海报掩盖这张照片。\n你觉得林歌手和刘大副在约会。\n你来船上工作之前是一名芭蕾舞演员,厌倦了舞台生活才做了船上的乘务。",
		"Script": "当天下午,你被刘奇狠狠的教训了一顿,他拎着你的衣领打了你的头。原因是昨天船靠岸的时候你拿好巧克力后忘记帮他投递了。然后，你把这个事情告诉了修经理。\n之后，你非常气愤的回到自己房间，你想杀了他，于是你把你藏在房间里的一瓶硫酸倒进了一个饮料瓶里。\n晚上19点20分,你把饮料瓶拿给在仓库的刘大副,刘大副看到你后，立马赶你出去，你只好把饮料瓶放在仓库的柜子上便离开了，回到自己的房里。\n19点30分，你在房里上网的时候看到一段刚刚上传的视频，视频的内容是张二副得罪了船上的VVIP，VVIP当众羞辱他，张二副下跪道歉。(事情是该VVIP花生过敏，而张二副却给她拿去了花生冰淇淋。)20点后因为烟花表演，有很多客人，所以这个时段你在游轮的移动通道进行安全检查。",
		"Relationship": "刘奇(大副):你非常的讨厌他，自从你在船上工作以后，他仗着大副的头衔一直像指挥仆人一样指挥你，经常发短信给你，让你帮他煮面,打扫卫生，甚至洗内裤,最近每次在船靠岸时都要你帮他送快递，快递是物品是巧克力。\n修仁杰（酒吧经理):你对他印象不错，经常会和他谈心，有时他会和你一起抱怨刘奇。有一次酒后失言，你对他说你想杀了刘奇。\n林若彤（歌手):你觉得她似乎和与刘大副有染，于是你帮林歌手取了个外号“林磁铁”，外号的事情被林歌手得知了、为此，5月6日当天，林歌手在公众场合和你吵架。\n洪子廉（船长):5月6日你与林歌手吵架，之后船长赶来，以打扰乘客有损形象处罚了你，并让你写了检讨。第二天你写了检讨交给船长，尽管你很不服气。\n张文远（二副):你知道他是枪支保管员，操舵室有一把左轮手枪。\n20点30分，你被通知刘奇死在了仓库。",
		"Performance": "刘奇是一个很严格的人，你觉得没人喜欢他。\n20点后因为烟花表演，有很多客人，所以这个时段你在游轮内移动通道进行安全检查。\n20点30分，你被通知刘奇死在了仓库。",
		"Purpose": "与大家共同合作找出本案的凶手,但同时要注意避免自己被怀疑。",
		"Ability": "犯人是场上唯一一个可以说谎的人，你不能说谎，但可以隐瞒掉一些对自己不利的证据。"
	},
	"洪船长": {
		"Story": "洪船长，全名洪子廉，男，38岁，国内海洋大学毕业，已经在船上工作12年，1年前前船长意外死亡后,成为东方之星号的船长。强调你是这里所有人的领导。\n1你知道张二副是负责管理枪支的,几乎所有人都知道操舵室里有把左轮枪。\n2你有一把私人的手枪和一些子弹藏在你的房间里，用来防范毒品运输中存在的危险。\n3你最近送了一条项链给林歌手。\n4你有烟瘾，但在船上只能用尼古丁液抽电子烟。\n你需要隐瞒的是你和林歌手是恋人关系。以及你和韩国黑道三合会有联系，你在船上偷偷运输毒品。你负责与三合会对接，然后让刘大副负责运输毒品。",
		"Script": "18点40分:你接到餐厅电话，是说出大事了，你赶去餐厅，是看到张二副跪在船上最尊贵的客人(vVIP）面前，因为VIP有花生过敏症，而张三副把花生冰淇淋拿给了她。张二副被要求下跪道歉，你立马也道歉了，带着张二副走了。你把这个事情汇报给了董事会。19点40分:你收到三合会的传真，是一些塔罗牌，内容是船长，秘密交易，背叛，碰面，港口，杀。你也不是非常确定里面的内容，你猜测是三合会警告你如果敢背叛，就会杀了你。所以决定一会去问问刘奇。\n你把塔罗牌藏在了你设有密码的箱子里，箱子放在操舵室的暗格里。20点的时候，你看到林歌手回到她自己的房间，穿的是演出服装，衣服似乎被扯坏了。\n20点到20点15分你在甲板看烟火。\n20点15分左右,你知道刘奇一般都会在航行结束前去仓库整理东西，所以觉得他在仓库。20点25分到的仓库，发现刘奇已经死了。",
		"Relationship": "刘奇(大副):刘奇是你的大学学弟，本来是船上的三副，前任杨船长于一年前死亡后，你升任船长，便把原来的三副升为大副，他也是你走私毒品的手下。\n修仁杰（酒吧经理):修仁杰是东方之星号游轮的经理，于2年前过来上班。与你并没有太多的交集。\n韩亦暮（乘务):你看到韩乘务5月6日与林歌手当众吵架，你认为这影响到了其他乘客和有损东方之星号的形象,所以你让韩乘务给你写了份检讨书。(如果有人问你为什么没有处罚林歌手，你可以说林歌手是修经理的直系下属，要处罚应该修经理处罚)\n林若彤(歌手):林歌手是酒吧的爵士乐歌手，是修经理的直系下属。她其实是你的恋人，你对她的昵称是“小黄莺”。\n张文远（二副):毕业于国际航海学校，文凭是船上最高的人。对刘大副的升职心怀不满，给你写过刘大副工作失误的报告,你并没有理会就把报告给扔了。",
		"Performance": "刘奇是你的学弟，出于份属同门，你比较照顾他。\n烟花表演于20点开始，20点后你到甲板看表演，20点15分，你想起来你有些话要对刘大副说，通常在船靠岸前他都在仓库整理东西，所以你去了仓库，然后发现了尸体。你是尸体的第一发现者。",
		"Purpose": "与大家共同合作找出本案的凶手,但同时要注意避免自己被怀疑。",
		"Ability": "犯人是场上唯一一个可以说谎的人，你不能说谎，但可以隐瞒掉一些对自己不利的证据。"
	},
	"林歌手": {
		"Story": "林歌手， 全名林若彤，女31岁在船上工作时间1年,是东方之星号酒吧专属爵士乐歌手。你非常漂亮，很吸引大家的目光。\n洪船长最近送了一条项链给你。\n你和洪船长是真正的恋人，但迫于无奈你最近和刘奇在约会，约会已经3次了。",
		"Script": "当天19点45分，你通过短信和刘奇约了在仓库碰面。当时你穿着表演服，你一到仓库，刘奇就扑向你，撕扯你的衣服，想要和你亲热。情急之下，你你从头上拿下了簪子，狠狠的刺进了刘奇的后背。趁他疼痛之际，你迅速逃跑了。\n20点左右，你回到了自己的房间，换下被扯坏的衣服。你很愤怒也很害怕，你突然想起来你的恋人洪船长这里有一把私人的左轮手枪。20点20分，你偷偷跑到船长室偷了洪船长的手枪，藏在自己衣柜的包里。\n20点30分，你被通知刘奇死了。",
		"Relationship": "刘奇（大副):刘奇是你的追求者之一，他送你名牌包包，但你不喜欢他。你于去年欠下100万的债务，无力偿还，刘奇得知后，主动帮你偿还，但是要求和你约会10次来抵这比钱，你同意了并和他签订了约会合同。(约会就是看电影，吃饭)\n洪子廉（船长):他是你恋人，他叫你“小黄莺”，他并不知道你和刘奇偷偷约会的事情。\n张文远（二副):你知道他是枪支保管员，操舵室有一把左轮手枪。\n韩亦暮（乘务):最近你得知，她帮你取了个外号，“林磁铁”你很生气，5月6日当天找茬和她当众吵架。之后船长来了，以影响到了顾客为由批评了她。\n修仁杰（经理):他是你的直系领导，你知道他很喜欢喝酒，特别是洋酒。",
		"Performance": "刘奇经常来酒吧,所以只是在酒吧里和他聊天，普通朋友。\n因为晚上20点30分要举办酒吧公演,所以这段时间在房间里为即将到来的表演做准备。",
		"Purpose": "与大家共同合作找出本案的凶手,但同时要注意避免自己被怀疑。",
		"Ability": "犯人是场上唯一一个可以说谎的人，你不能说谎，但可以隐瞒掉一些对自己不利的证据。"
	},
	"修经理": {
		"Story": "修经理，全名修仁杰，男32岁，在船上工作2年，是东方之星号豪华游轮的酒吧经理。\n你本来以为只有刘奇和你两人秘密运输毒品,而现在你觉得还有一个人，但你不知道是谁。\n你是船上的毒贩，当然最重要的秘密是你杀了刘奇。",
		"Script": "年前，经过父亲的朋友介绍你成为了东方之星号豪华游轮的酒吧经理,在船上的生活,让你对奢华生活产生了强烈的憧憬，之后，在酒吧偶然遇见了自己的高中校友,刘奇，当时在船上担任三副,不久后，刘奇像你提出秘密交易的事情,告诉他利用游船偷偷运毒可以获得巨额的利润，你接受了这个提议。你在自己管理的装有火药的烟花盒子里偷偷塞毒品，刘奇每个月都会有5万块打进来。1年前，船上运毒的事件被发现老船长杨晨林发现，刘奇将杨船长条死,然后强迫你去做假证，之后刘奇就被无罪释放了。你对刘奇感到恐惧所以买了把左轮枪来防身。杨船长死后，刘奇升为了副船长。半年前，刘奇告诉你，把运来的毒品进行私下交易应该会赚的更多，于是让你将毒品藏在巧克力里面然后投递出去，为了钱，你同意了。但是2个月前，毒品的单子越来越少，你问理由，刘奇却无视你。案发当天下午，你在房间里和韩乘务聊天的时候知道，她一直在帮刘奇送巧克力。受到背叛的你向刘奇质问理由，并发短信威胁他。那天傍晚，刘奇来到你房间送来你喜欢的洋酒作为道歉礼物。你感到很奇怪，所以仔细的检查了酒、发现盖子上面有针眼，然后你将酒倒进银杯，银杯发黑，知道酒中有毒。刘奇想要像杀了以前船长一样杀人灭口。所以你决定先下手为强，你先去操舵室拿了张二副手枪里的一发子弹。(船上所有人都知道那里有枪，钥匙在他的抽屉里）然后再等到20点烟花开始之后，逃离了人们的视线，跑到刘奇在的仓库，仓库里看到后背受伤的刘奇，然后对他开了枪。枪声被烟火的声音掩盖住了。杀了人之后你跑回自己房间，将刚拿的那一颗子弹放进枪膛里。然后将空的弹壳藏到了香蜡里面。\n看到香蜡逐渐凝固，你露出了得意的微笑。",
		"Relationship": "刘奇（大副):他是你的高中校友，也是你船上私运毒品的领导人。洪子廉（船长):你和他并没有太多的交集。\n韩亦暮（(乘务):她对你颇有好感，她对刘奇也很厌恶，你们经常在一起喝酒说他的坏话。有一次，喝醉酒后，她对你透露如果有机会一定会杀了刘奇。\n林若彤(歌手):她是隶属于你酒吧的，你是她直接的领导。\n张文远（二副):你知道他是船上的枪支保管员，操舵室里有一把左轮手枪。",
		"Performance": "你和死者是高中校友,这是2年前你上船工作后和他聊天后才得知的。20点-20点25 分，外面在烟火表演，客人们在甲板上看烟火，你于20点准备好烟火之后，就回房间休息。烟火表演是由酒吧准备的，",
		"Purpose": "隐瞒掉你杀死被害者的事实，并把它嫁祸给其他人。",
		"Ability": "你是场上唯一一个可以说谎的人，其他人都不能说谎"
	},
	"张二副": {
		"Story": "张二副，全名张文远，男34岁国际远洋航海大学毕业，在船上工作7年，是东方之星号上的二副，是被害人的直系下属。你是船上学历最高的人。\n你很尊敬以前的船长杨晨林，你觉得他就是你的第二个父亲。一年前他意外死亡后，你很难过，你还将老船长那时的船员联络表贴在你的办公桌上。\n你抽电子烟，所以你抽屉里有尼古丁液。\n大家都知道你是船上的枪支保管员，你把枪放在操舵室上锁的盒子里，钥匙你放在你的抽屉里。\n最近分发弹药，还有3颗子弹没有用。\n前几天你和刘奇发过短信，问他处处针对你的事情，刘奇否认了。\n你刚刚收到董事会的报告，你因为得罪VVIP的事情被开除了，(VVIP花生过敏，而你端了花生冰淇淋给她）这个VVIP是刘大副让你亲自接待，并且是他告诉你让你给她端上花生冰淇淋。",
		"Script": "晚上18点30分，刘奇让你去餐厅接待VVIP，因为是非常重要的客户，他坚持要你亲自接待，并告诉你她点了花生冰淇淋让你端给他。因为刘奇是你的领导，你只好答应了。谁知道该vIP吃了冰淇淋后大发雷霆,说她提前跟你们说过她花生过敏,接着要你当众下跪道歉。你照做了，之后洪船长出现了，一同道歉后便拉着你走了。\n19点10分的时候，你在办公室收到董事会发来的传真，上面写着你被开除了。你把报告藏进了抽屉，便上了甲板看海。\n20点烟花表演开始，甲板上都是乘客，你想最后驾驶一下东方之星号，便回到了操舵室,直到20点30分，你被通知刘奇死在仓库。",
		"Relationship": "刘奇(大副):你很讨厌他，一年前他还只是三副，是你的手下，而在老船长意外死后，原来的洪大副上位后，迅速将刘奇调为大副。变成了你的直系领导。刘奇对你态度很傲慢，处处针对你，于是，你开始调查刘奇工作中的错误,最近你发现刘奇在记录仓库清单的表格上私自签字，而原本应该是船长签字的。你把这个写成报告给了船长。\n洪子廉（船长）你对他提拔他的学弟刘奇的事情很不满意。\n韩亦暮(乘务)她和你没有特别的交集,你知道她是个爱管闲事的人。\n修仁杰（经理)他和你没有特别的交集，你知道他很喜欢喝酒。\n林若彤（歌手〉你对他没什么特别的交集。",
		"Performance": "你觉得刘奇是一个懒惰和懈怠的人。\n20点至20点25分，你一直在操舵室看着船航行，以及在操舵室看看业务报表。",
		"Purpose": "与大家共同合作找出本案的凶手,但同时要注意避免自己被怀疑。",
		"Ability": "犯人是场上唯一一个可以说谎的人，你不能说谎，但可以隐瞒掉一些对自己不利的证据。"
	}
}