{
  "东方之星号游轮事件": "2年前，经过父亲的朋友介绍修仁杰成为了东方之星号豪华游轮的酒吧经理，在船上的生活，让他对奢华生活产生了强烈的憧憬，之后，在酒吧偶然遇见了自己的高中校友，刘奇，当时在船上担任三副，之后2人越来越熟，不久后，刘奇像修仁杰提出秘密交易的事情，告诉他利用游船偷偷贩毒可以获得巨额的利润，修经理接受了这个提议。他在自己管理的装有火药的烟花盒子里偷偷塞毒，刘奇每个月都会有5万块打进来。1年前，船上运毒的事件被发现老船长杨晨林发现，刘奇将杨船长杀死，然后强迫修经理去做假证，之后刘奇就被无罪释放了。对刘奇感到恐惧的修经理买了把左轮枪来防身。杨船长死后，刘奇升为了副船长。半年前，刘奇告诉修经理，自己贩卖毒品的利润会更高，于是让修经理将毒品藏在巧克力里面投递，为了钱，修经理同意了。但是2个月前，毒品的单子越来越少，修经理问理由，刘奇却无视他。案发当天下午，修经理在房间里和韩乘务聊天的时候知道，她一直在帮刘奇送巧克力。感到受到背叛的修经理向刘奇质问理由，并发短信威胁他。那天傍晚，刘奇来到修经理房间送来修经理喜欢的洋酒作为道歉礼物。修经理感到很奇怪，所以仔细的检查了酒、发现盖子上面有针眼，然后将酒倒进银杯，银杯发黑，知道酒中有毒。刘奇想要像杀了以前船长一样杀人灭口。修经理决定先下手为强，先去操舵室拿了手枪里的一发子弹。(船上所有都知道那里有枪）然后再等待烟花开始之后，逃离了人们的视线，跑到刘奇在的仓库，仓库里看到后背受伤的刘奇，然后对他开了枪。枪声被烟火掩盖住了。杀了人之后的修经理跑回自己房间，将刚拿的那一颗子弹放进枪膛里。将那颗空的弹壳藏到了香蜡里面。",
  "博物馆奇妙夜": "案情解析\n完整的事件过程\n本案当中，杀死甄馆长的真凶就是\n【魏保安】\n杀人过程解析\n天天在厉害了我的馆巡逻的魏保安，其实并不是一个现代人。他的真实身份是800年前辅佐成吉思汗开国的大将军博尔术的盔甲\n复活秘术上记载：用成吉思汗后人至纯的血液浸泡博尔术随身的盔甲上，可以复活博尔术。\n2016年10月，甄馆长找到了拥有成吉思汗纯正血脉的后人白小爷的妈妈白木真。用她的血液浸泡了盔甲。经历这样的仪式之后，博尔术确实被复活了，然而，意外的是盔甲的灵也被复活了。\n真正的博尔术灵魂复活后，附着到了撒干事的身上，在博物馆门口醒来；而盔甲的灵化成人形,在博物馆内醒来。所以，甄馆长把盔甲的灵一魏保安当成了博尔术，不断逼问他墓穴的位置。而博尔术本人以撒干事的身份生活，2017年1月加入博物馆当讲解员。\n魏保安曾告诉过甄馆长一个自己记忆模糊的地点，没想到甄馆长真的找到了一批宝藏，他很懊恼。案发之前，甄馆长觉得上次的陪葬品不多，再次逼问魏保安主陵墓的地点，想找到更多宝藏，否则就将他封印回去。然而;一来虽然盔甲跟随博尔术多年，却只拥有一部分记忆，无法记起宝藏的位置，魏保安真的不想再被封印了﹔二来，魏保安了解了甄的为人，知道他贪得无厌，破坏大汗的宝藏，心生恨意。于是,魏保安决定杀了甄。\n案发当天(2017年2月17日)\n14:00，白小爷撬锁，拿走了甄房间里，关于妈妈的资料的木盒，\n14:30，离开，忘了关门。\n14:40，撒干事发现甄房间门没关，进入房间把甄的高血压药中的粉末替换成了展馆内的蒙汗药。\n15:00，撒离开。\n15:00，何古玩来到甄房间，发现没关门，进门搜索后，带走了他爸爸的箱子\n18:00，魏保安带着展厅的比首来到三叔房间，发现锁坏了。为避免三叔起疑，他修好门锁后，躲入沙发前的长木柜子，想等甄回来，找机会茶了甄，却不小心睡着了。\n18:30，甄回到房间，发现装着宝物的箱子不见了，气得犯病，吃了内含蒙汗药的高血压药，晕倒在地。\n18:45，魏保安醒后发现三叔昏倒在沙发上，趁机反锁门，把三叔拖到浴室，让他跪在浴缸前，用匕首割破他的手腕，造成自杀假象。\n19:00，看血流得差不多了，魏保安准备离开。然而，不断有大在门口徘徊，魏保安不敢开门离开。\n19:05，何古玩来到门口，尝试拧开门，但是打不开；\n19:15，撒干事来到门口，尝试开门，但打不开。\n19:30，鸥神秘来到门口，尝试开门，这时侦探鬼邻居也来到门口，准备破门而入。魏保安听到门外的动静，急中生智，用烟灰缸狠狠砸了自己，倒在地上装晕。\n\n",
  "大明星最后的演出": "李天船就是个卑鄙无耻的小人，他花钱请黄迪去陷害山峰，让山峰洁染了毒瘾，并拍下了照片威胁山峰，逼山峰自己退出选角，“除掉”了山峰这个最大的竞争对手。他还从事了非法勾当，与开赌场的周雄合作，帮周雄洗黑钱，从中牟利。他让之前交往的一个小模特--齐思怀孕了，但却不想要孩子。即使齐思把孩子生下来之后他也拒绝承认他这个女儿，只为了保住他大明星的形象和事业。最近他或许爱上了王纱，但他最爱的永远只有他自己，而且依照他花心的本性，谁知道他能与王纱维持多久呢?一年前他亲手举报了自己的弟弟--李察德，让李察德留下了案底。现在他又假意支持李察德和强尼的慈善工作，实际却是利用他们的慈善基金会洗黑钱。他还利用自己支持慈善是事情做文章，大大为自己做了一把宣传，可谓一举两得。昨天晚上庆祝酒会之后大家各自回去休息，李天船和王纱回了他们的套房，韩伟文和沈曼离也各自回套房休息了。李天船约了周雄来酒店谈生意，王纱接到了黄迪打到他们套房想找李天船的电话。黄迪决定把他帮李天船做的坏事都告诉王纱，他们约在费雪酒吧见面。之后王纱去了酒吧跟黄迪见面。王纱走后不久周雄到了酒店，上去套房里与李天船洽谈。李天船与周雄谈的很不愉快，两人还发生了争吵，沈曼离就是被他们的争吵声吵醒的。与此同时，王纱得知了李天船的恶行，决定找李天船当面对质。李天船也正好与周雄谈僵了，想找王纱安慰一下自己，于是叫王纱在宴会厅等他。酒会结束后那里肯定空无一人，正好可以二人世界。谁知王纱一见面就开始质问他，问的还是他不愿意让别人知道的秘密。李天船决定先哄哄王纱，稳住她，再想对策。看到李天船假惺惺的哄骗，王纱彻底对李天船失望了，并决定给他个教训。王纱假装与李天船和好，哄骗李天船脱掉衣坐到椅子上，然后突然绑住李大船，并把他留在那里，自己扬长而去。夜班保安帮离开酒店的王纱叫了出租车，主纱走后保安就到值班室里去偷懒了，他没看到在费雪酒吧里喝了儿杯后才离开的周雄。他同样没有看到监控录像里那个进入酒店的黑衣人，那人就是李察德!昨晚李察德本来是和强尼在家里共度二人世界的，但却被他哥哥毁了这一切他知道李天船帮周雄洗黑钱的事情，所以当强尼说到利源财管投资公司在他们的博爱基金会的操作方式时他意识到李天船极有可能是在利用基金会做幌子洗钱。李天船骗了他，利用了他，还把强尼和基金会一起拖下了水。他感觉非常愧对于强尼，整个脑子都乱了，没办法跟强尼继续聊天。他冷淡的回应导致了两人的争吵，之后强尼一气之下回家了，那时是大约是凌晨两点。李察德跑到李天船的卧室里找到了利源财管投资公司的资料，证实了自己的猜测。又想起之前李天船向警方举报自己的事，一瞬间新仇旧恨交织之下，他拿了李天船放在卧室的枪，出发去酒店找个大船。李人船的套房里没有人，于是李察德找到了昨晚举办庆祝酒会的宴会厅。一进宴会厅他就看到还绑在椅子上的李天船，自己亲生哥哥裸体被绑在椅子上求救的丑态让李察德感到很恶心，怀着若耻、失望、愤怒等多种感情，他毫不犹豫的拿出枪，朝李天船的胸口开了一枪，结束了眼前这丑陋的一切，同时也结束了李天船的生命。李天船的死看似扑朔迷离，但抽丝剥茧之后，真相只有一个。王纱是最早的怀疑对象，但她没有枪来完成谋杀。之前的酒会上她与李天船还是对甜蜜的情侣，她不可能提前准备枪并带到酒店。与黄迪谈过之后王纱可能会产生杀人动机，但她 2:32就离开酒店了，短短时间内她不可能专门去找一把枪来杀害李天船。黄迪和山峰案发当时在一起开 party，而且他们身边还有很多朋友。他们有明显的不在场证明。齐思并不想李天船死，她希望李天船能与他们的孩子相认。而且她也不可能半夜丢下孩子一人在家跑去酒店杀人。强尼没有杀人动机，他不知道李天船利用慈善基金会洗钱的事周雄有不在场证明，他先是在酒吧喝酒，酒保和其他客人都有可能看到他。之后他就离开了酒店，监控录像也拍下了这一点。还有一点，他并不想李天船死，他希望李天船能“回心转意”，继续帮他洗钱。吕智也没有杀人动机。首先，他正在勒索李天船，人死了他就什么都行不到了。其次，即使李天船死了，他也不可能成为《大运河》的男主角。。沈曼离不会为了骚扰的事情就去杀人，事实上她已经打算辞职了，。韩伟文带了一把枪到酒店里，但他同样没有杀人的动机。他拒绝了大公司的招揽，李天船是他的“摇钱树\"，他不会傻到去杀害李天船。李察德是唯一既有强烈动机，又有时机和能力实施犯罪的人。李天船曾经举报他，害他被关进监狱。而现在又假意支持他和强尼的慈善事业，背地里却利用基金会进行洗钱的勾当。强尼离开的时候大约2点多，这之后李德都没有不在场证明。而且，李察德与哥哥个人船住在一起，他可以轻松地拿到李天船放在自己卧室里的那把枪\n",
  "孝衣新娘": "过去的故事\n“百里村”的土地原本属于“法蓝庄”主人【孟深】(也是“法朗”商行的主人)，【孟深】醉心于化学研究，很多私事都交由【杜老总管】(杜辉信)负责，苏州商行的生意由【陈轻梧】照管，“百里村”的地租交由【姚长寿】收管，【杜老总管】信任助手【方乘山】，并安排【方乘山】和【姚长寿】一家都住在“百里村”属于【孟】家的大宅里。【方乘山】的女儿【方敏月】做了【姚孟仁】和【姚仲义】的启蒙老师，和【张得采】相恋。\n(1900年)【虞北辰】找到一批稀有“荧石”，和其他矿石一起交给【孟深】,【孟深】就让【杜老总管】收藏在“百里村”里。【田红娇】介绍自己的未婚夫【范金魁】给姨父【方乘山】来做这份工作。【范金魁】带着“李家兄弟”在隧道里开的洞，位于村北树林中洋馆的地下，因对地质不了解，危险作业，被【虞北辰】见到后立刻制止，但是为时已晚，发生塌方，“李家兄弟”因此去世。\n【杜老总管】掩盖真相，执意为兄弟讨回公道的【范金魁】去别墅里找他，引发意外，【杜老总管】身亡，【杜贵成】返回接任“法蓝庄”总管职位。\n【方乘山】把埋藏的东西的位置画成地图,要和锁洋馆的钥匙一起送还给【孟深】，却被他的同僚【姚长寿】和【陈轻梧】挟持到村北树林里，想夺走【方乘山】手里的地图。\n【方乘山】不愿交给他们，在撕开地图时被他们杀害，然后被逃亡的【范金魁】交换衣服，伪装成自己的尸体。【姚长寿】和【陈轻梧】因当时【孟深】在世，不敢私挖宝藏，就各自拿走一半地图，为表信任，互相提防的二人当场约做儿女亲家。【方乘山】被当作失踪，他的妻子带女儿【方敏月】离开“百里村”，去了上海。\n(1901年)“法蓝庄”主人【孟深】被害后（杜贵成被作为真凶被抓，并由虞北辰送去警局)，【陈轻梧】和【姚长寿】私吞【孟】家的在苏州和“百里村”的资产，但是也从此相互防范，都想独吞宝藏，但两人的地图都只有一半。\n(1903年)【姚长寿】的大太太【徐夫人】利用阳台栏杆害死婢妾【张雅娣】,又让丈夫把【张雅娣】的儿子送往外面，但是不久自己也因病过世。【张雅娣】的侄子【张得采】离开大宅前因偷盗被捕，无法履行和【方敏月】的约定。\n(1911年)【姚孟仁】娶【田红娇】后，【姚孟仁】和【陈均梦】完婚。当时【姚孟仁】已经和父亲产生嫌隙，向往革命——他趁送妻子回门的机会，私自前往武昌，【姚长寿】非常害怕，就对外谎称他得了传染病死亡，并写信叫回次子【姚仲义】。【姚长寿】这时根据地图找到隧道在树林里的出入口，为了防止被人发现，就在上面修了【姚孟仁】的假坟。【陈轻梧】怀疑此事跟宝藏有关，马上送女儿回“百里村”,【姚长寿】只能打通洋馆后墙，安排她在住进去“守孝”。\n现在的故事\n半个月前，【姚长寿】在洋馆一层失足摔落，身上染了有毒物质引起生病，【方医生】不能对症下药，加之服用含有“东莨若碱”的“镇静剂”导致【姚长寿】病情更加严重。\n“白头蛇”偷出军火，利用【朱迪】(张得采）藏进隧道，却被【范金魁】灌醉，因此被捕。他被搜出的“半张地图”就是当年【陈市田】从【陈轻梧】处偷出，又被【范金魁】杀死后夺走的。后来“白头蛇”试图逃亡，被这时已经改名【徐伯清】的【姚孟仁】击毙。\n【徐伯清】作为民国军人回南方，收到部队命令调查此“军火买卖”，带着“半张地图”来“百里村”等待抓捕“金胡子”(范金魁）和“内应”【朱迪】。\n提示\n00、杀人动机来自死者持有的“半张地图”(地图上的血迹是陈市田的，方敏月却以为是她父亲的)。【方敏月】行窃被发现，死者借月色认出并且要拥抱【方敏月】，却被【方敏月】误以为是要来抓她、而且她听见死者亲口承认打死“地图的前主人”(徐伯清指的是被他就地正法的“白头蛇”而不是方乘山)，愤恨之下开枪杀人。【朱迪】晚上第一次出来时，看见死者的房门是打开的，第二次就已经关上了，当时死者已经和姚仲义在天台上，【方医生】就是这时潜入死者的房间。死者的表情惊恐，是他认识开枪的人但又不相信对方会杀他。\n01、【姚孟仁】从小喜欢【方敏月】这样的女性(自主、偏男性打扮)，因此才会追求【云凌】，并在结婚时要求妻子装饰上“桔梗花”和“文竹”。他同时也是一个矛盾的人，他一方面向往【方敏月】教他的自由平等，另一方面因为出身家庭，和很多从小养成的大少爷习惯，比如对弟弟和下人的态度——他之前私自前往武昌和因为感情受挫而放弃军人的身份和责任，也都是任性和不顾后果的表现。\n02、【孟】家埋藏的宝藏主要是“硫磺”(规避毒虫、燃烧时产生青色火焰)、“硝石”还有“荧石”(有荧光)。\n03、总共开过四枪，分别是:\n一、(22:30)【姚仲义】在天台用“特制弹夹手枪”打空。\n二、(23:00)【云凌】在二楼阳台用“特制汉阳步枪”打中“栏杆”。\n三、(23:00)【方医生】在二楼徐伯清房，用“特制弹夹手枪”打死【姚孟仁】。\n四、(00:30)【胡人玉】在门外，用“马牌橹子”打中“白围巾”。\n04、【姚孟仁】中枪前认出【方敏月】。\n05、【姚长寿】在洋馆跌落时扬起的尘土中，都含有硫和荧石的粉尘，沾到【陈均梦】身上。\n06、【云凌】收到的“字条”和【张得采】给【方医生】最后的“信”上的笔迹相同,`都是【朱迪】(张得采)写的。\n07、【贵叔】【方医生】【虞医师】中只有【贵叔】真的有行医资格。\n08、在阳台和【云凌】对峙的是【朱迪】假扮的【神秘人】，“三件伪装”分别是“墨镜”(留在朱迪房里)，“黑爵士帽”(被姚仲义捡走，内有陈均梦用信鸽传的消息)，“白围巾”(朱迪扔下后，被胡人玉开枪打中，拖拽尸体后留在尸体上)。\n09、【朱迪】放火时引燃了混在土地上的化学物质，导致大火和毒烟。\n10、【胡人玉】的名字来自于“金胡子”。\n11、【贵叔】在房间里吸食“鸦片”，【红夫人】进屋后误吸，导致幻觉。\n当晚的时间线\n虞医师23点00分醒来\n虞医师23点10分阳台推人\n虞医师23点20分在阳台活动\n虞医师23点30分回房\n虞医师23点40昏睡\n\n陈均梦21点30分摸到手\n陈均梦21点40分摸出金锁\n陈均梦22点30分听见枪声\n陈均梦23点听见枪声\n陈均梦23点10分听见坠地\n陈均梦23点40分听见坠地\n陈均梦23点50分出门\n陈均梦00点00回房\n陈均梦00点30分听见枪声\n陈均梦00点40分听见说话\n\n胡人玉23点00分听见\n胡人玉23点10分目击推人\n胡人玉23点20分回房\n胡人玉23点50分见陈均梦\n胡人玉00点00分躲藏\n胡人玉00点10分离开旧屋\n胡人玉00点20分见红夫人\n胡人玉00点30分对围巾开枪\n胡人玉00点40分移尸\n胡人玉00点50分去主卧室\n\n云凌23点00分阳台开枪\n云凌23点10分回房\n云凌23点20分开门看\n云凌23点50分下楼\n\n姚仲义21点50分拿鱼\n姚仲义22点00分上二楼\n姚仲义22点10分上天台\n姚仲义22点30分开枪扔枪\n姚仲义22点40分失神\n姚仲义23点00分看见尸体\n姚仲义23点10分要下楼\n姚仲义23点20分拿鱼敲门\n姚仲义23点30分回房\n姚仲义23点50分捡爵士帽\n姚仲义00点00分找陈均梦\n姚仲义00点10分逃走\n姚仲义00点20分主卧室找药\n姚仲义00点50分看见红夫人\n\n贵叔22点00分 思考病情\n贵叔22点10分找红夫人\n贵叔22点20分去客厅\n贵叔22点30分抽鸦片\n贵叔22点40分见红夫人\n贵叔23点10分吸食鸦片\n贵叔01点00分看见尸体\n贵叔01点10分出门移尸\n\n 红夫人21点30分去拿安眠药                                \n 红夫人21点40分放安眠药\n 红夫人21点50分再去找药\n 红夫人22点10分找方医生\n 红夫人22点20分被叫走\n 红夫人22点40分去客厅\n 红夫人22点50分去厨房\n 红夫人23点00分鱼不见了\n 红夫人23点10分捡到枪\n 红夫人23点20分找贵叔\n 红夫人23点40分听见响动\n 红夫人23点50分害怕\n 红夫人00点20分见胡人玉\n\n方医生22点10分说病情\n方医生22点20分进徐伯清房\n方医生22点30分从天而降\n方医生22点40分见徐伯清\n方医生23点00分开抢\n方医生23点10分镇静下来\n方医生23点20分听见敲门\n方医生23点30分回房\n方医生00点40分看见移尸\n\n朱迪22点10分看见方敏月\n朱迪22点20分伪装塞纸条\n朱迪22点30分等在阳台\n朱迪22点40分\n朱迪22点50分听到喊声\n朱迪23点被吓到\n朱迪23点10分被谁撞栏杆\n朱迪23点20分回房见尸\n朱迪23点30分拿工具清理\n朱迪23点40分推落尸体\n朱迪23点50分拿清理工具\n朱迪00点30分扔白围巾\n\n陈安巧21点50分上天台\n陈安巧22点00分藏起来\n陈安巧22点30分听见枪响\n陈安巧22点40分跑回下人房\n陈安巧23点00分听见开枪\n陈安巧23点10分踢枪\n陈安巧23点20分看见虞医师\n陈安巧23点50分休息\n\n徐伯清22点10分上天台\n徐伯清22点20分辱骂\n徐伯清22点30分摔下天台\n徐伯清22点40分爬起\n徐伯清22点50分呼救\n徐伯清23点00分被杀\n徐伯清23点10分掉进朱迪房\n徐伯清23点50分尸体被推落\n",
  "怒海余生": "当天，除了小布莱克以外，杰西帕是第一个到达庄园的，老布莱克让他父亲的劳伦造船厂倒闭，改变了她一家人过去富裕的生活，因此她和她父亲一起合谋要报复老布莱克，她利用自己财务的身份，从布莱克的家族企业中偷取了大量的财产，并且假意和小布莱克在一起来为自己提供便利。然而在这个过程中，她渐渐爱上了小布莱克，甚至怀了他的孩子。但是仇不能不报，根据她和父亲的计划，她提前几天故意打碎了老布莱克心爱的杯子，并且答应送他一个新的。她知道老布莱克是一个老烟枪，所以她在杯子的杯柄上涂上了剧毒的氰化物，这样当老布莱克用这个杯子喝完饮料以后，只要用沾有毒物的手抽烟，就会因为摄入了滤嘴上的剧毒而身亡，而此时杰西帕应该已经不在案发现场，即使那个杯子是她送的，她也可以装作不知情来逃过罪责，所以她今天午后将杯子送给了房间内的老布莱克，并且特意给杯子斟满了美酒，然后便离开了。但是杰西帕的完美计划遭遇了一点问题，当天的老布莱克完全没有碰香烟。因为当天山姆医生来到庄园为老布莱克做定期的心理检查，虽然他只是个心理医生，但是老布莱克还是为了避免被医生反复提醒而克制住没有抽烟。不过，山姆也自有他的计划，他受人指使，要来杀死老布莱克。老布莱克患有较为严重的心脏病，因此山姆在做完例行检查之后，偷偷将老布莱克的心脏病药换成了普通的感冒药，这样只要老布莱克心脏病发，就会因为得不到治疗而身亡，山姆则可以置身事外，今晚就和自己心爱的人远走高飞。而这个心爱的人，也就是指使他杀人的人，就是安妮。安妮和杰克的婚姻生活并不幸福，所以她一直在和人偷情，山姆就是她的情夫。安妮的童年生活并不幸福，父母的公司倒闭以后，母亲重病，生活困苦，不久父亲就死了，她因为钱嫁给了黑帮老大杰克，母亲也得到了治疗，但是好景不长，母亲因为一次医疗意外去世了，安妮从此变得孤苦无依。和山姆相识的生活还算愉快，但是她突然了解到，导致她母亲去世的医疗事故，就是山姆一手造成的，并且，当年导致她父母工作的公司倒闭的，就是老布莱克。因此她想出了一个一箭双雕的办法，以感情为名要求山姆帮她杀死老布莱克，然后想办法让山姆被抓住定罪，然后自己划清与她的关系就可以了，而山姆也在犹豫之后答应了杀人的请求，安妮清除了大部分自己和山姆之间来往的证据，就等着收获自己计划的成果了。不过这个计划被另一个人打乱了，这就是安妮的老公——杰克。杰克实际上是一个同性恋，他会和安妮结婚，只是因为需要一个明面上的妻子来掩盖他的真实的性取向。杰克早年丧父，他的父亲是一名老船长，母亲告诉他他父亲是死于一次海难，所以他孤儿寡母的童年过得异常辛苦，且不说他还小的时候母亲也过世了。他混进黑道以后努力爬上了现在的位置，然后一个偶然的机会，他了解到自己的父亲当年其实是被害死的，害死他的就是他船上的大副老布莱克。由于他和小布莱克有很多生意上的往来，所以要实行一个复仇的计划对他来说并不困难，在山姆离开老布莱克的房间后，杰克派人从房顶翻进去，将老布莱克制服，并把他的下巴卸掉让他无法呼救，然后给他注射了过量的肾上腺素，使他心脏病发，在痛苦中死去。杰克欣赏着老布莱克挣扎的样子，却发现老布莱克指着墙上的海图想向他说些什么，他拿下海图发现后面有一个保险箱，在老布莱克的指引下他打开了箱子，在里面看到了一堆他并不懂的财务报告，翻看间他发现一张他父亲和老布莱克的照片，他非常气愤，觉得老布莱克不配拥有这样的合照，转头却发现老布莱克已经死了，于是他匆匆还原了海图，拿走了照片，离开了房间。而帮他执行杀人计划的，也就是真正的凶手——约翰。约翰是一个退伍军人，也是一个同性恋，此前他接受杰西帕的雇佣，出任小布莱克的保镖，监视小布莱克，以方便杰西帕的行动。他偶然认识了杰克，两人情投意合，他在了解了杰克的事情后，愿意贡献自己的身手来执行杀人计划，并且事先买好了保险，准备做完之后消身匿迹一段时间，既为了安全，也可以骗得巨额保险金。今天是他辞职前的最后一天，他当天下午做完一切，把针筒放进了小布莱克的包里嫁祸给他，然后就准备从世上消失。所以，虽然杰西帕和山姆都实施了自己的杀人计划，但是真正成功的凶手是约翰，而他的幕后黑手，就是杰克。至于当年的事情，事实上，当时的大副老布莱克，和船长的老婆偷情，并且生下了杰克。在那次海难意外中，活下来的船医、水手长、大副和船长，用剩余的资源搭了一个木筏，但是木筏只够三个人使用。四个人中最强壮的是大副和船长，于是船医和水手长劳伦两人威胁大副帮他们做掉船长，让他们三人得以存活，否则就把偷情的事告诉船长，让船长做掉大副。大副当时想了一个委曲求全的办法，他打晕了船长，留下了水和食物，准备获救后再回来营救船长，但是等他回来，船长还是已经死在了荒岛上。这件事让他非常自责，回来后他想和自己妻子离婚，娶船长的老婆，但是船长的老婆不仅拒绝了，还带着杰克离开了他。他为了报当年的一箭之仇，暗中用手段搞垮了劳伦的公司，并让劳伦屈居他之下，做了一个管家。多年以后，他偶然认识了已经混进黑道的杰克，他发现这很有可能就是他失散的儿子，所以他一边偷偷资助杰克，一边暗中调查他。现在，他已经发现了杰克就是他的亲生儿子，但是，他还没有来得及父子相认，悲剧就发生了……",
  "漓川怪谈簿": "松尾一郎，他在常世出生，长大后在树下与良子相遇，后来结为了夫妻。两人的生活，非常幸福，良子不仅有了月和这个可爱的女儿，还怀上了日和，征兵的人忽然来到这个平静的村庄，没有任何拒绝的机会，他就被送往了战场。这是最为恐体的经历。大人物们的想法和这些底层拼命的蚁没任何关系。在战场上，如果他想要活下去就必须拼尽全力的挥舞手中的刺刀，但那个冰冷物件穿透对方柔软肉体的瞬问，他常常想，对方是谁呢?是否也有了妻子，像良子一样一个人在家盼望着丈夫的归来。血腥味，腐败味常常紫统在他的身旁，不管如何努力也不能将它们洗去。他明明只想当个普通人，回过头来，却发现自己居然已经沾了满手的血污。\n战争终于结束，平将门失败了。所有人都在忙着逃命，他却只想快点回到常世，山越岭，长途跋涉都不算辛苦。但常世就像从这个世界上消失了一样，不管他如同的徘寻，始终都找不到一点踪影。直到这个时候松伟一郎才意识到，原来还有比战场更为绝望的事情，他回不了家了无论如何恺都想要回到良子和孩子的身边，所以一直没有故弃过对常世的导找，时间压弯了他的脊梁却始终无法浇他心中的焰火。后来与他有绊的精怪收藏家被他的坚持感动，给了他一份叫追虹的图纸。\n追虹可以带他回到常世，但同时也模糊掉了关于良子和常世的所有记忆，在他的印象中，自己是一个固执的老头，把大半生的时问都花费在追逐那些虚幻漂的彩虹里。他终于又回到了这里，只是已经不再记得，自己苦苦导找这里的理由，干春偶然将其数下，带回家中，一老一小这两个孤独的灵魂就这样组成了新的爸异家庭过着日子。一郎又遇到了良子，日日都与她对坐在村口的大槐树下，却再也认不出彼此。\n而良子，在树下和一郎相识相恋后，遭到了家族的反对。在与家族底斯地关系后，终于与一郎组建了幸福的家庭。还按照传统，原本竹内的姓氏改成了松尾。后来征兵的人将一郎带走，她个人服顾年幼的月和，雪上加霜的是还忽然发现自己又有了身孕，每一天她都在盼望着丈夫的平安归来。流意开始作乱，神官答应了以封闭常世为条件和平将门交易。结界一旦布下，在外的游子便永远无法路入家园，所有人都在沉默，只有良子一个人在抗议。不管她如何的奔走喊，也叫不为求自保，装经着的人群。什么都改变不了，这就是血淋淋的现实，结界已经布下，她依然不肯放弃，神官瞳子忌惮她的行为，奈何便盗取了场男的力，抹去了她关于丈夫松尾一部的全部记忆，残缺的记忆磨平了她的校角，也改变了她的性格。她变得整日，靠着本能行动，每日都会去愧树底下，坐着发呆。虽然什么也不记得了，但身体依旧驱使着她，等待那个再也回不来的人。那些曾经连眼睛都不敢直视她的人，现在纷纷开始了对她的欺凌。孩子变成了她生活的全部。绝望的是日和被平将门刺死。她和月和的关系也渐新变差。为了给日和报仇，她勇败的去刺杀了平将门。可没想到展现在大众面前的一直是有时间停止能力的影。一郎碰巧将她数下，还将宝伞多文送给她防身，才使她保住了自己的性命，\n然后千春，千春的父亲当年也是因为征兵离开了常世，而她的母亲为了保护干春，在子与平将门交易的时候，选择了沉默，决定已经做下，但她也无法面对这样残忍的自己，所以每一次干春问起父亲的时候，她都含糊的帮过了事，因为身体的关系，在干春很小的时候，她就去世了。从此一直都是千春一个人现独的生活。为了活下去，小小的她很早就学会了人情世故，每日都在大人的验色下讨着生活。偶然的一天，她遇到了正在被欺负的日和，胆小的她选择了逃避，转身离开了霸凌现场，此后她一直被内疚所折磨，没想到的是，日和非但没有怪她，还乐呵的想与她做朋友，两个单纯的小家伙很快成为了最好的朋友，一起经历着只属于他们自己的小小冒险。日和是个好奇心很强的小朋友，老是想拉着干春一起前往通气楼进行探险。在他观察许久后终于发现了守卫轮班的空隙，激动的他泼请干春一起，当时的干春因为别的事情拒绝了日和的提议，却没想到日和就这样永远的离开了这个世界。干春又变成了一个人。很久以后，她在常世的偏角落捡到了晕倒的郎。几经试探后，终于对他产生了信任，不再像以前一样验的生活，后调到看到鬼魂的百鬼目百鬼目能够与鬼魂沟通，并且委托干春那些鬼晚送灵魂百合，在不告诉鬼的亲人朋友真相的情况下，如果他们收下后，自发地好好照顾，并且让那朵花两天不败的话。它们就够拥有一分钟时间和思念的人再见一面的机会。但是在场所有收到花的人，包括萨原干春，都没有收下并且好好爱惜这些花朵。(给良子和月和送花的是死去的日和，给庆太，敬，子送花的是北原直人。直人之所以知道庆太这个起的名字也是因为庆太和他所扮演的茂树提起过自己的愿望，希望自己来世能叫庆太，做一个捕鱼人家的孩子。)\n星野笃敬，人生的前十八年，一直都被囚禁在地下的小小石室当中，和庆太的关系虽然没有太坏，但因为对立的命运始终也算不上亲近。孤独是他无法避开的难题，。在他的印象中，陪伴他最多最多的就是那只每天都热衷于以全新血腔面貌来吓他的女鬼雪姬，一开始他也感到恐惧，对雪姬非常抵触，但时间久了过后，也渐渐习惯了她的存在，有时还会对着雪姬倾述自己无法对他人言说的心事，而雪妈这样一天一天陪伴笃歌。在见证了这个少年的成长点滴后，她渐渐喜欢上了这个单的少年，而她其实也不是有意想吓唬笃敬，只是每天精心打扮的去见心上人，却因为精怪对人类的错误认知造成了这样的误会。后来在气敬无法用心之咒修复神水界的时候，也是雪姬出手帮忙进行修复的。\n星野降子，作为双生草选定的副枝，没有名字，在星野家的重压下长大。他的父亲非常冷，只肥她当做主枝的工具来抚养。双生姐妹也因为对立命运的关系，对她百般导，所以从小子没有感受过任何来自家庭的关爱，在她成长的过程中，认识了北原直人。原本是主枝瞳子的未婚夫，她以主枝的身份与他接触，也在人生中第一次感受到真心的关怀。两个人一同长大，相似的命运让两人在相处的过程中慢慢坠入爱河，可惜的是，还没到继承大典来临，子的父亲就发现了，两个人秘密备会的事情。显怒之下，对瞳子各种海每打骂，绝望促使着子不跌-切的逃离这个冰冷的家庭。她划着小船离开了届气楼，却没想到意外跌入了水中，又被她的父亲了回去。因为落水的关系，她与澜川的精怪亲何达成了丽绊。奈何与川的妖怪们有些不同，它并不满足与吸食妖灵，而是想要靠吸食宿主心甘情恩提供给它的正向情感为生，子就是它的最佳猎物，它一直默默的观察着瞳子的生活。终于在继承大典隆子就快要被烧死的那一刻，向子伸出了缓助的手。它在征得瞳子的问息后，以获取瞳子以后所有的正向情感为条件，盗取了真正钩易夫人的能力交换了子这个副技与主枝的灵魂。让瞳子用她双生姐妹的身体活了下去，就在子以为可以和直人幸福生活在一起的时候，却发现自己的生活又悄然走进了另外一个深渊，她再也感受不到任何正向快乐或幸福的情绪，甚至连爱一个人也再也做不到了。麻木和冷漠充满了她的整个生活。不管是面对丈夫还是自己生下的孩子，她都挤不出半点笑脸。与直人的婚姻，虽然相敬如宾，却并不幸福，在她的眼中所有的东西都失去了光彩。直人感受得到隆子的变化，却找不到任何理由。在他的眼中，只能单纯的认为睡子并不爱他，后来流忘入侵，本该保护百姓的神官量子却因为是副技的关系，没有半点攻击型的阴阳术。为了掩饰身份只能以接着照顾孩子为由，躲在气楼中。最后流攻进了屋气楼，她因为被父亲发现副校的真实身份关进了密室，逃过了一劫。被放出来后，却得知丈夫直人被流寇伤害，落湖而亡的消息。虽然验子感受不到正向的爱，但当她以为直人死亡了的时候。却被巨大的悲伤冲击，那些冰冻起来的爱在这一刻，全部反向的传到了子的每一根神经，这个时候她才知道原案她对直人的爱从来都没有发生过任何的改变，后来她发警为直人报仇，平将门的到来刚好给了她绝佳的机会。被们恨冲昏头脑的她。答应了平将门设立神水界的需求。作为守护常世的神官，亲自独弃了那些为了保护家人被迫征兵离开的百姓，恐惧让人狂，几乎所有人都默许了两人的交易，神水界很快就布在了常世的头顶。只有一个女人例外，松尾良子。她为了自己的丈夫终日在街上奔走怒骂，痛斥那些沉默者的虚的软弱，瞳子担心她长久的这样下去，难免影响人心，奈何又一次帮地摆平了麻烦，偷取了场男的能力抹掉了良子所有关于她丈夫的记忆。一切又恢复了平静。而直人其实并没有死，真相是她的父亲为了保护星野家的双生税密，用孩子助迫直人自杀跳湖。但幸好直人的水性非常好，跳入水中反而给了他一线生机，被村民救上来后，他乔装打扮化成一个老人茂树又愉愉潜进了星野家，打探星野的秘密，后来他终于获得了子父亲的信任，了解到了一切的真相，作为一个父亲和一位丈夫，他选择留在了这里，以另一种方式保护自己最爱的家人。在笃敬和庆太生活的漫长岁月中，峰子不能给到的关爱，也都由茂树的身份给予。时间终于到了继承大典，茂树知道他可以救出庆太，但是若星野家的人检查火场的时候没有发现尸体，那庆太永远都不可能有安静的日子。所以身为父亲，为了孩子他甘愿牺性了自己。他提前打点好做木箱的工人，让他到时候把自己的尸体故进木盒的夹层里，然后自杀，在火场中，他就能变成被燃尽的焦尸代替庆太被星野家的人找到，如她所愿，他数下了庆太，自己则悄无声息的永远离开了这个世界。场外的子毫不知情，因为认为庆太死在火场中，再一次感受到她对儿子的爱的反向冲击。这么多年案，她从没有对她驾敬和庆太英过一次，现在却望着火场询大哭，像个孩子。她是这样的爱这个活泼好动的孩子，只是自己从来都不曾知道，\n庆太，作为星野家新一任的副枝，他从小就知道自己十八岁就会死亡的宿命，但依然乐观，对世界充满好奇。可能是因为稀少，所以倍加珍惜，他非常认真的对待着自己的生活，用尽全力去和这个世界的美好相遇，每天晚上他都会求茂树放他出去玩，也是这个机会让他认识到了月和。在庆太的厚脸皮下，两人渐渐成为了朋友，后来也发展成了暖昧关系，可因为知道自己未来的命运所以他从不敢透靠自己的心意。后来继承大典就要来临。庆太约月和在花树下相见，想要在最后好好的与之告别。却没想到因为双生草的作用，皮肤变得透明，看着月和渐渐走进。他害怕吓着月和，只能躲在附近的草丛里。那一晚很安静，他就这样默默的陪着月和做到了天明。继承大典，他认命的走进了火场。却意外发现了木夹层中尸体，他明白了茂树的用意，还在尸体上发现了刻有撞子名字的玉假。过多的信息，让他来不及反应，那个时候已经黄昏，他的身体已经变得透明，他本来可以趁乱逃出火场，却因为太过震惊失去了行动力，他的精怪汤男情急之下用能力副掉了他看到这一切的记忆。慌乱中储促着他赶紧离开这里。而玉佩则被庆太带离了火场。话了下去的他默默守护在了月和身边，保护她不再受到旁人的救没。莫名弹开的石头，凭空国起的被子其实都是透明人庆太所留下的证明。\n月和，从小生于无姓之家，没见过自己的父系，还有一个看着有些迟镜的母亲。因为家庭的关系从小受到周围人欺凌。生活中唯一能够给她关爱的，就只有自己那个开朗得像太阳一样的弟弟。可是没想到一次察拜仪式，平将门夺走了弟弟的生命。她和母亲的关系也开始恶化，生活变得一片寂静。后来在水下认识了庆太，两人成为朋友，渐渐发展成暖球的关系，庆太为人马虎，常常送给月和一些有着星野家徽的东西，所以早早就被月和猜出了星野传人的身份。从两人接的开始，她就已经预见到了结局，所以每一天都在为两人的分别进行倒计。樱花树下相约的那天，月和心中也早就有了预感，继承大典就要靠近，或许这就是两人最后一次相见，没想到的是庆太根本没有出现，但因为一直都在心里做准备的关系。最后懂事的她在树下默默的与庆太进行了告别。\n\n\n可能是星野血脉中断的缘故，屋气楼里困住你们的结界开始渐渐失去作用。不知过了多久，你\n们终于从颜气楼里逃了出来，\n常世的一切都不一样了。精怪和人类竟然都可以通过湖水，直接在永夜和人间穿梭。神水党也伴随着平将门大人的死亡面消散。整个常世再次和这个世界紧紧联系在了一起。过渡的自由总是伴陆着难以受控的放肆和疯狂。没有了结界的约束，精怪们借着自己的能力在人问肆无总惮的胡闲，野心家们也已经间风而至，残忍的属杀和捕获那些能力奇异的妖。种族间的矛盾愈演愈烈，眼看着就要登上战场，星野家又早就设落，没有人能够阻挡，常世所有人和精怪的平静生活都被打碎，兵荒马乱中四处亡，失去了法力的气楼，早就沉入了常世湖底。从来没有人发现过，在这楼里，还有几具已经冰凉的尸体正紧紧的相互依靠。",
  "狐狸旅馆": "第一幕结局\n小暖进来后\n稻荷神大人：让我想想还有什么事情没有完成呢？哦对，雪女的乌云和诅咒。你们一定很好奇雪女的妈妈是怎么回事吧？让我掐指一算~（假装掐指）...竟然是这样~这事竟然和大天狗你的父亲有关啊~他们是...相爱了？不对...好像不是...嗯~？我感受到的，是正义，是守护的力量。哦...(若有所思的点头）原来是这样，大天狗的父亲接到了任务，需要去抹杀那个情绪失控的富士山雪女。可是他的父亲是一个非常正直的人，他认为无论是什么原因都不应该擅自剥夺其他人生活的权利。但是当他到了富士山之后，他发现雪女的母亲情绪和法力都失控了，冰封了方圆百里，冻死了很多人。他父亲知道不能这样继续放任大雪女下去，不然会死更多无辜的人。他的父亲将大雪女打晕，并带到了富士山下面，充满岩浆的地方。他利用岩浆的力量来封印大雪女失控的法力。可是他又害怕岩浆会伤害到她。于是便用自己的法力做了一个防护罩，将她的母亲放在里面。之后的许多年中，他们两个一个疯狂的叫嚣着：你放我出去！我要杀光天下所有男人！另一个呢，就不急不躁的劝说着：你冷静一点...\n就这样许多年过去，直到他的父亲因为法力即将消耗殆尽，头发翅膀都变成了白色。直到大雪女终于意识到这个防护罩不是囚禁，而是守护。大雪女终于愿意冷静下来，轻轻对天狗的父亲说：你放我下来吧，我愿意冷静下来了，我...我想回家了，我想我女儿了.。至此，天狗父亲坚持了自己的正义，也完成了自己的使命。所以雪姬，你母亲的诅咒，其实已经解除了。因为大天狗的父亲，是真心的守护着你的母亲。那就让我来破解你的诅咒吧！...咦？你的诅咒也已经破解了啊？是谁破解的？滑头鬼吗？让我看看...（装成神棍假装占卜一下）嗯...滑头鬼确实为你做了很多事...但是，我看到的，是一个红色的，毛茸茸的小爪子！它一下一下的，敲着一个被冰封的大门...那个小爪子上全是冻疮和小伤口，但是那个小爪子还是坚持不懈的敲啊敲啊...终于，她敲开了那扇被冰封的大门，也敲开了雪姬的心门。那个爪爪饼干，温暖了雪姬冰封已久的心...所以雪姬，你知道你的诅咒，是谁破的了吗？是啊，谁说只有爱情才能破解诅咒？友情，也可以温暖这世上最最寒冷的冰封啊...\n那么最后一件事！（按 优子—大天狗—滑头鬼—小暖—雪姬—狐狸—狸猫的顺序问：你觉得风一郎做饭好吃吗！一定要每个人都回答好吃）我稻荷神大人也觉得很好吃！那么阿玉，你觉得风一郎做饭，好吃吗？（等阿玉回答好吃）那么阿玉，风一郎已经实现和你的约定了哦~你愿意接受他吗？（等阿玉回答）\n那就让我们来看看，各位的结局吧~风一郎跟着阿玉来到了阿玉的白狐村里。小小白看到阿玉后立刻扑进了阿玉的怀里哭着说妈妈，你终于回来了！风一郎和阿玉在这个村里开了一家阿玉料亭，还把风一郎的父母都接了过来，一大家子人都幸福的生活在这里。优子终于不用在通过两个小小的洞看世界了。她和大天狗一起飞遍了世界的每一个角落，一起去触摸春天的樱花，付过夏天的溪流，踏过秋天的枫叶，踩过冬天皑皑的白雪。大天狗还经常带着她一起去白狐村看望阿玉姐姐和风一郎哥哥。雪女回到了自己家的冰洞。许久未见的母亲看到她后立刻将雪女抱进了怀里哭着说：女儿，妈妈让你受苦了，对不起啊，妈妈以后哪都不去了，也不会再发脾气了，妈妈就在家，陪着你。雪姬鼓起勇气承担了守护富士雪山的职责，和妈妈一起幸福的生活在一起。滑头鬼大人虽然没了狐狸旅馆这个蹭饭的好地方，可是富士山离京都也不远啊~滑头鬼大人啊，三天两头的往富士山顶的冰洞跑，也不知道那冰天雪地有什么好吃的？小暖呢，虽然被稻荷神带上去扇五百年的扇子，可是稻荷神大人总要吃饭睡觉打妖怪牌呀~所以总有人看到一个红色的小身影从神域偷偷溜下来，有时跑到白狐村的阿玉料亭吃东西，有时跑到富士山顶给人家送爪爪饼干，有时在京都一个大院子和一个头很长的妖怪一起放风筝~抓虫子~这狐狸旅馆的一大家子人啊，有时也会在樱花盛开的季节相约稻禾神山，一起赏樱，野餐，打妖怪牌~\n\n\n\n\n\n\n\n单人结局文字版（音频的文字内容，可以配合无旁白的背景音频使用）\n2000年 6月 12日\n京都 抵园\n商店街口站着一个成熟性感的女人，她牵着一个六七岁的可爱女孩驻足在这商店街口，已经很久了。\n不知为何，这女人迟迟不肯进入这条开满了料理店的街道，也不知她在犹豫什么。许久之后，她终于鼓起勇气牵着女孩向街道里走去。\n女人边走边四处张望着，寻找着什么。她的眼里满是紧张，又含着些许期待。\n突然，女人停下了脚步，呆呆的望着一个叫‘阿玉料亭’的招牌。她望了很久很久，眼泪偷偷的从她精致的脸庞滑落。女人伸出手擦了擦脸上的泪痕，拉着女孩走进了这家料亭。\n随着‘吱吖’一声，老旧的木质推拉门被推开。门口正对着的吧台后面站着一个胡子拉碴的中年男人，穿着有些油渍的料理服，正熟练的切着手中的食材。他没有抬头，只是道了句：一拉下一马赛，请随便坐，菜单在墙上贴着，想吃什么告诉我就好。\n女人拉着女孩轻轻的坐在吧台前，四处望了望，墙壁上除了简单地菜单外贴满了便利贴。每张便利贴上都写着：好吃！这家店的料理真好吃。\n女人看着吧台后的男人。他有些老了，脸上有皱纹了，但是，他还是那个记忆里的一郎啊...女人用略微有些颤抖的声音小声地问：老板，有没有...章鱼烧？\n男人听到章鱼烧的瞬间猛地抬头，却在看到女人的瞬间立刻转身。他停顿了片刻，便开始准备章鱼烧的食材。可就在他切生包菜的时候，豆大的泪珠却砸在了菜刀上，包菜上，彩板上。\n男人用袖子胡乱抹了抹脸，飞快的做好了一盘章鱼烧。\n他低着头不敢看女人，把章鱼烧放在吧台上轻声说：尝尝吧。女人吃了一颗，又喂女孩吃了一颗。女孩欢快的对身旁的女人说；妈妈，这是小小白吃过的最好吃的章鱼烧！\n女人宠溺的笑了笑摸了摸女孩的头说：这也是妈妈吃过最好吃的章鱼烧。男人这时终于鼓足勇气抬头看着面前的女人。他们四目相对，男人看着她轻声问着：你来啦。\n女人笑着，哭着，轻声回到：我来啦，久等了吧。\n\n2006年 3月22日  鸭川\n凌晨两点半，随着‘叮咚’一声。鸭川旁一家阳光便利店的电子感应门应声而开。一个身穿风衣戴着格子帽的男人风一般的冲进了便利店。他快步走到架子前拿起一个红豆面包，又到冷柜前拿了两罐啤酒。\n他刚把面包啤酒放在收银台前准备买单，谁知在收银台后面那个比别人矮了一头的收银女孩竟然把面包啤酒统统丢进了垃圾桶里。她嗔怪的看了一眼面前的男人，从抽屉里拿出了一个粉色的便当道：大半夜还吃冷东西，把胃搞坏了，我怎么办？\n男孩不好意思的挠挠头，接过便当打开一看，里面有章鱼肠子，厚蛋烧，还有亲手捏的饭团。男孩边吃边对女孩嘟囔着：桃子，我跟你说哦，今天啊，我帮一个女人找到了她失散多年的孩子。母子相逢的场面别提多感人了。而且啊，那个女人似乎很有钱的样子，给了我好多委托费呢！只差一点了桃子，只差一点我就能带你去美国治腿啦！\n女孩笑着看着面前的男孩，轻轻地说：阿泽，你慢点吃，吃完再说话，小心噎到了。\n男孩三口两口把饭团吃掉后绕进收银台里面，拿了件外套替坐在轮椅上的女孩披上，说：桃子，河边的樱花树都开了，我推你出去看看吧？\n女孩笑着点头，男孩帮她锁好了便利店的门，推着女孩走在河滨小道上。路旁的樱花树全都盛开了，月光柔柔的洒了下来，整个条街道都笼罩在温柔的花海中。两人沿着小路观赏着盛开的夜樱，一阵晚风吹过，吹落了树上的樱花。花瓣落在了两人的头上，身上，腿上。\n女孩低下头认真的在腿上挑了一朵完整的樱花小心翼翼的放在手心里，转身笑着对男孩说：阿泽，你看啊。我这样，不是也能触摸到樱花吗？\n\n\n\n2009年9月2号 京都 京都大学 校门口\n早晨8点，一个身穿格子连衣裙，扎着黑色马尾的女孩飞一般的冲进学校，用最快的速度办理好了入学手续。接着，她就站在校门口，似乎在等着什么人。\n她站在那痴痴地等着，从清晨等到日落。等到车水马龙的街道逐渐归为寂静，等到天空布满了乌云，等到乌云降下小雨，等到大雨将女孩淋了个湿透。她一直等啊等，等到她明白，她等的人，真的不会出现了。\n女孩寂寞又失落的耸了耸肩，叹了口气用双臂抱了抱自己，接着转身走进了校园里。\n\n同一天，下午两点\n京都的某一律师事务所中，一个头发花白，佝偻驼背的老头坐在一张办公桌前，仔细的阅读着一份财产赠送合约。合约内容是将毕生全部财产分为两份，一份赠送给一位叫做凉宫桃子的女孩。另一份赠送给一个名叫木之本奈奈的京都大一新生。他在这份合约的结尾处签下了桐生一郎的名字后似乎卸下了什么重担一般长长的出了口气。接着转身走出了事务所。\n他在门口抬头看了看天，似乎，要下雨了。他犹豫了很久，还是在事务所门口拿了一把黑色的雨伞，走向了京都大学的方向。\n他走啊走啊，脚步坚定且缓慢。最终他来到了京都大学，校门口，对面，一个黑暗的小巷中。\n天上淅淅沥沥的下起了小雨。他缓缓的撑起手中黑色的雨伞，将自己完全隐藏在黑暗之中。他看着校门口的女孩，她穿了得体漂亮的裙子，梳着骄傲的马尾。她真的考上京都大学了。\n乌云又在她的头上密布，雨水打湿了她的头发。男人多希望能冲过去用手中的雨伞替她驱散乌云，遮挡雨水。可是男人几次抬起了脚，最终却停在了原地。他知道，他不能去。女孩的人生才刚刚开始啊！她以后会遇到更多，更好的人，她的身边也会有一个真正对她好，替她驱散乌云的人。但那个人，不应该是他。\n男人看着大雨将女孩淋了个湿透，他看着女孩失落的转身回了学校。他随手将手中的雨伞丢在了地上，任凭大雨拍打在自己的脸上，身上，似乎想用雨水，掩盖那些从眼角滑落的水滴。接着他转过身，佝偻着腰，渐渐走进了黑暗中。\n\n\n2010年 3月4日 京都 稻荷神山\n新闻报道：本台独家报道，昨日有行人在稻荷神山中发现了一名男子的尸体，据警方调查，死者名叫小岛秀川，是京都鲸鱼科研与保护委员会荣誉会长，死者近日还在准备参选京都环境厅副厅长一职。据目击者称，死者在失踪前曾出现在稻禾神社，似乎是在祈愿。因死者与京都警察厅的高层关系甚密，警方出动了大部分警力势必要捉拿凶手。\n\n2010年3月5日 京都  警察厅\n新闻直播：本台直播，昨日著名的小岛秀川谋杀案受到了多方关注。本台收到独家消息称有人今日来到警察厅自首了！嫌疑人是一名六十多岁的男性。名叫桐生一郎，是前山口组的副组长。此人自首后完整的供述了自己的杀人动机和手法，据称是因为私人恩怨，他将死者骗至深山之中，先与死者发生斗殴，他随手捡起一块石头将死者敲晕后用手帕将死者捂死，最后还用随身携带的匕首捅了许多刀泄愤。他所供述内容与死者的死状完全吻合。警方迅速将其逮捕。现在让我们为大家带来独家采访。\n记着：桐生一郎先生，请问您为什么要杀了死者呢？\n桐生一郎：为了一些私仇。\n记者：听闻您此前的帮派行动与本次谋杀案数罪并罚，将会被判处终身监禁，您是否还有什么话要对别人说吗？您可以通过摄像机传达。\n桐生一郎：不要难过，这本就是我该承担的责任。我犯的错，就由我来终结。你们，一定要好好活下去啊。\n\n\n\n最终结局\n2013年，毕业季。京都大学美术系一位名叫木之本奈奈的毕业生和她的同学都不太一样？在动画市场极其火爆的情况下她的同学大多是从事了动画相关专业，可她却选择从事了一个冷门的夕阳产业【桌游】。毕业没多久的她成为了一名桌游设计师并发售了自己的第一款独立创作的桌游【妖怪牌】。（把妖怪牌的盒子拿出来给大家看）这款桌游因为简单有趣的规则和活灵活现的美术设计很快遍风靡了整个京都。开料亭的夫妻也在打，侦探事务所的小情侣也在打，就连稻禾神社的巫女都在打。\n稻禾神社近日推出了一款新的周边小礼品【爪爪饼干】。那是用稻禾神社的招牌小狐狸的小爪子所定制的饼干。每个去许愿的人都可以获得小小一包，那饼干脆脆的，甜甜的，吃下去会觉得心中泛起一股暖意，就像阳光懒懒的洒在身上一般温暖。\n后来你们也去过稻荷神社祈愿。每次你们双手合十时总能感觉身后有个目光在很紧张的盯着你们！似乎能听到你们心中的愿望一般，可是你们许的愿望无非就是希望家人身体健康，希望自己不会迷失方向，希望能努力过得更加幸福。每到这时身后的那个紧张的目光就会放松下来。可当你们回头看去，只能看到一抹红色的身影消失在你们的视线中。偶尔你们也会在稻禾神社中被一个可爱的小巫女拦住问：请问，你找到狐狸旅馆了吗？你的愿望，都实现了吗？\n感谢各位，今天的狐狸旅馆，到此结束。谢谢大家。\n\n结束语：\n最后的最后，我们都不知道阿玉的小小白究竟能不能治好，大雄的父母有没有变好，桃子的母亲有没有醒来，黑泽有没有破获大案守护正义，桐生一郎有没有从监狱中走出来，奈奈有没有交到好朋友，小暖有没有与家人们相遇。这些我们都不知道，因为这就是现实，现实永远无法像故事那样拥有一个完美的结局。但是我相信在座的各位，你们的愿望在狐狸旅馆已经实现了一次，现实中，也一定会实现，因为实现愿望并不是靠着神明大人，而是各位心中最宝贵的力量。大家能勇敢的面对曾经想要逃避的现实，勇敢的向前迈出脚步，就已经是最大的胜利了。生活不是一帆风顺的，总会遇到一些难关，但是不要怕，向前走吧。\n狐狸旅馆永远都在各位的身后，默默地守护着大家。\n狐狸旅馆，就是一个当大家累了，被生活压得喘不过气想要歇歇，想要偶尔逃避一下的时候随时都能来的地方。就像每一家剧本馆一样，在这里你能够体验不同的人生，或欢笑或温馨或流泪。但是生活中还是有让我们必须前行的原因和动力。大家还是要回去，勇敢的幸福的，生活呀。希望狐狸旅馆能够带给大家温暖，谢谢你们。\n\n彩蛋：\n蜘蛛老人和通往现实的通道还有最后的永远同在出自——千与千寻\n歌单中送别小暖的歌曲出自——未闻花名 而我们刚好和未闻花名反过来啦\n歌单中的风之甬道出自——龙猫~\n读本开场以及第一幕打牌时的BGM出自——夏目友人帐~讲述一个少年与妖怪的温暖故事\n打牌时的音乐阵内家出自——花牌情缘 这也是妖怪牌的灵感哦\n第二幕第一首歌出自——深夜食堂、第二首出自星海城的——秒速五厘米\n妖怪牌的玩法参考【抽王八（捉鳖）】和【德国小强】~\n还有的彩蛋大家可以自己发掘哦~~~~\n\n\n\n\n",
  "第二十二条校规":"整件事情均围绕着转校生【皇甫青】而展开，【皇甫青】是双性人生理上同时拥有男性与女性的特征，因为这个原因【皇甫青】在童年时根本没有朋友，由于性别的模糊导致其根本不知道自己到底算是男性还是女性，以此其产生了分别为男性和女性的人格，男性人格为【皇甫青】，女性人格为“蒋温灵”，为了避免遭到身边人的歧视，【皇甫青】的父母频繁为其安排转学，所以除了自己父母补没有人知道【皇甫青】身为双性人的事实。\n【皇甫贵】之后就读于“真相高中”，在高二时进入了高二3班，并且和【李萱萱】、【谢雨晴】以及【叶冷星】成为了朋友，高二3班的班主任李老师是【李萱营】的父亲，他表面上为人正直严肃，实际上是一个心理扭曲的变态，他通过收集学生的隐私来威胁操控学生，他威胁的对象不仅是女生，还有长相优异的男生，其中【白穆】也是他的受害者。\n【皇甫青】来到高二3班时便引起了李老师的注意，毕竟单论外貌，【皇甫青】是绝对的美少年，之后李老师开始跟踪收集【皇甫青】的信息，直到他在男厕所的隔间偷窥到【皇甫青】双性人的秘密后便开始威胁【皇甫青】逼他就范，还特意将消息泄露给了【谢雨晴】让她去传播因此导致班级里的人都对【皇肃青】报以恶意和歧视。\n李老师的异常举动引起了【要萱整】的注意，【要登萱】是个拥有重度变父情结的女生，曾经故意制造车祸将差点成为自己继母的人给杀死，她不允许任何人分享父亲李老师对她的爱。当季老师与【皇肃青】在天台会面时她亲耳听到了一切，但是她并没有责怪父亲，反而是迁超于【皇甫青】，趁着李老师离开天台之际将【皇肃青】从天台推了下去在被推下去的瞬间【皇甫青】抓住了【学登登】的左手接她的四叶草戒指给拽了下来，恭后【皇肃青】便从天台掉下死去。\n通过“蒋温员”笔记可以看出与李老师在天台见面时的【皇肃青】其实是由“蒋温灵”的人格主导的，所以体验到死亡的也正是“温灵”，她的经恨在死亡的制那上升到了极致化为了诅咒，诅咒将整个高二3班笼罩在内，同时将12月2日这一天化为了诅咒空间，而【皇肃肯】的男性人格则由于当时并来主导身体所以并没有产生怨，男性人格被\"蒋温灵”的人格强制排出，化为了如是念体一般的存在，虽然已经死了，但由于“蒋温灵”的诅兄而保持着未死亡时的形态，且记忆被诅咒完金忘记了“蒋温灵”人格的事情，只能通过依稀的记忆将“蒋其改，\n温灵”当作是童年好友。【皇甫膏】的母亲并未发现【皇肃青】已死、只是为他体内的“蒋温灵”人格消失而感到高兴，所以也并没有再将他曾经人格分裂的事情告诉【皇肃青】，而为了防止【皇肃青】想起关于“蒋温灵”人格的事精所以经常会暗中观察监视【皇甫青】。\n另一方面“蒋温员”化为的诅咒开始杀害高二3班的学生，诅将学生拉入12月2日自己死亡的那一天杀害，每一个学生都必须在诅咒空间内死古三次才得以解脱真正死去，在此之前他们都承受着难以想象的恐惧当他们被杀害后他们的名字和记忆都会消失在所有人的记忆里，而【皇甫青】作为诅咒本身，他在死亡的瞬间也同时消失在了所有同学和老师的记忆里，所以在【皇常费】转校进入真相高中时所有人都不记得自己写他曾是同学。\n【皇甫青】会进入真相高中也是因为诅咒的关系，“温灵”一方面杀害高二3班的学生，一方面也希望自己得到解脱，而解脱的方法就在自己的笔记中，以请笔仙的名义用自己的诅咒杀死自己，真相高中里最强大的恶灵正是“蒋温员”自己，所以众人能召吸到的笔仙也只有“\n温灵”，对诅咒的本体施加诅咒的话就可以破解真相高中的诅咒，呼唤【皇甫青】前注真相高中也正是因为“温灵”心中的一丝希望被救赎的心理。\n【皇甫青】进入高二3班后并不会得到任何优待，他一样是诅咒抹杀的目标，所有人在被拉入12月2日组咒空间之后都会经历“三次轮回”即拥有三次生命，只有三次均死古后才会真正的死亡，这也是为什么众人会遇到与自己长得一模一样的人的原因。\n当众人进入诅咒空间后，由于“温灵”的诅咒导致所有人内心的心魔都被具现化成为厉鬼在诅咒空间杀戮，曾经在此死亡的高二3班学生以及值班老师与保安等同样化为了鬼魂，只是他们并不会伤害众人，反而会帮助大家，诅咒实体化的产纳就是躲藏在天台蓄水池中的巨大白农恶灵，白衣恶员作为诅咒空间最根源性的恶灵盘踞在天台营水池中，由于它的存在所有心魔历鬼均不会在众人逃上天台后继续追击，因为天台才是真相高中最恐怖的地方，而所有人聚集在天台后白衣聂灵的本体就会出现，此时就是诅咒最强烈之时，在这个时候以请笔仙的方式诅咒\"蒋温员”的话诅咒便会破解，而一旦众人选择逃离天台则被视为破解失败，之后的“蒋温员”会化为真正无解的最恐怖恶灵残忍的将所有人杀害，当“第二十二条校规-音频2”开始在学校中广指时就代表著恶员即将开始毫不留情的屠杀众人。\n关于天台，天台是“蒋温灵”被杀害的地方，所以她诅咒化成的白衣恶灵都盘踞在天台篇水池，由于“蒋温灵”的一丝被救赎心理存在所以每一轮的众人在上天台之前基本不会遇到类死之局，所有心度厉鬼只是自由的在行动并不存在一定要赶尽杀绝的情况，而众人聚集在天台后白衣愚奥苏醒，所有心魔厉鬼都归白衣需灵支配，由于众人逃离天台等于算作破解诅咒失败，白衣恶灵控制心魔厉鬼对所有人进行无差别杀战，所以才会造成众人逃下天台后反而被厉鬼团灭的情况。\n而本次事件最难的地方就是在于如何诅咒“蒋温灵”，请笔仙的方式*须写下被诅咒者的名字，而“温奥”这个名字只是【皇肃青】女性人格的名字，实际上只是一个毫无意义的代号而已，如果众人在最后写下了“蒋温员”的名字则诅咒失败，一个不存在的人是不可能会被诅咒的，而众人均会因为诅咒失败而被恶灵养死!12月2日无论是哪个人格在主导着身体，死亡的那个人毫无疑问都是【皇甫青】本人，所以如果要破解诅咒，只有写下【皇甫青】的名字才行。\n"
}
