{
  "第一幕": {
    "雪女的房间": [
      "房间的大门是被冰封的。你破门而入，整个房间都是被冰封的。房顶，窗户，桌子你似乎送入了一个冰雪世界半空中飘散着许多小雪花，这些小雪花似乎有灵性一半随着你来回走，有一两个还黏在了你的肩膀上。房间的桌子上放了好几个可爱的小雪人,只有手掌大小，抽屉里放着一个冰雕的小人,惟妙惟肖的像极了雪姬，抽屉里放着一个浅蓝色的御守，但怎么都打不开，你捏了捏，里面似乎是空的。你可从选择带走一片雪花，带走一个小雪人，或者两部带走！",
      "当你想拿出你带走的小雪人和小雪花给大家看的时候，发现他们全都化了......你仔细回想了一下，小雪花融化似乎就是一把牌的时间，小雪人久一点，似乎两把牌的时间才完全融化。"
    ],
    "滑头鬼的房间": [
      "这是一间十分干净整洁的房间，似乎没有居住过的痕迹，案桌上摆放着一把又窄又长的日本刀，刀身上刻着两个字：鬼丸，刀柄刻有蜘蛛老人四个字，刀旁边放着一个深蓝色的御守，但怎么都打不开，你捏了捏，里面似乎是空的。床头柜上放着一张纸条，你要打开看看吗？",
      "纸条上写着：老大，原谅我，这次无论任务是否成功，我都要隐退了。对不起老大，我不能再辅佐您了。\n——风太郎敬上"
    ],
    "打牌的大厅和后花园": [
      "你们刚刚打牌的大厅，大厅正中间摆着一个暖桌，桌上放着一套妖怪牌。牌桌上的妖怪牌是全新的，似乎今天第一次使用。从稻荷神大人的右手边开始围着每个人的座位转一圈。右边第一个位置上有几片黑色的羽毛，第三个位置上有几根红色的毛，第四个位置上有几根白色的毛还有一些粉末状的灰尘，第五个位置有一些灰白色的毛，第六个位置上放着一个小凳子，第七个位置给人感觉有些冰冷。",
      "稻荷神大人的尸体就倒在一旁。他全身上下无外伤，无中毒痕迹。他表情痛苦，右手紧紧的捂着心脏，眼晴死死地町着右手边的方向。稻荷神大人的外套，右边肩膀后面有一小块水渍",
      "后花风景秀丽，有一个波光粼粼的池塘，湖边碧草茵茵，微风吹过。远一些的地方还有形状咨异的假山，但你发现假山旁有一略显突兀的石堆，你用全力搬开石维后。在石堆里面居然有一狼妖。仔细查着后发现原来是一具尸体，狼妖的尸体有拖拽过的痕迹，全身上下只有胸口处有一个很窄的贯穿伤，似乎是利刃所致，伤口深度大约3寸左右."
    ],
    "风一郎的房间": [
      "整个房间更像个私人厨房，内摆满了各种各样的厨具，料理工具。还有各式食材。桌子上放置着很多把形状各异的菜刀，其中有一把细长的窄刀不知是用来做什么的，锈迹斑斑，衣柜里放着一个盒子，打开后里面是一本《料理大全》，前面基本都是很基础简单的家庭料理，越往后难度就越高，最后面的部分已经是怀石料理的制作流程和手法，初级料理的部分都被翻烂了，而更高级的部分几乎没有被翻动过，盒子旁边放着一个淡绿色的御守，但怎么都打不开，你捏了捏，里面似乎是空的，在盒子里还有两张烟火大会的游园票，不过是已经检验过票的状态。"
    ],
    "小暖和优子的房间": [
      "这是一间温暖又宽敞的房间，房间中间被一道屏风隔成了两个区域，屏风右边的家具比正常家具要迷你很多，家具很少，只有小床小衣柜和小小的床头柜小床上有一件小小的粉红色兔子和服，正是优子最喜欢的那件，和服的绣工很好，但左边袖口上方有一些磨损。你检查了其他衣柜中的小和服，发现或多或少都有，而且都在左边袖口。床头柜中放着一个淡粉色的御守，但怎么都打下开，你捏了捏，里面似乎是空的。床下面有一个小盒子，打开后里面是樱花的干花，还有鹅卵石，枫叶等，虽然都是一些很常见的东西，但都被很宝贝的收了起来左边的家具比正常家具要迷你一些，家具很少，只有小床小衣柜和小小的床头，床头柜上有一个未上锁的箱子。打开后发现整个箱子里全部是一袋袋的爪爪饼干小衣柏里有一套妖怪牌．但是是全新的，并未拆封。牌的旁边育一个红色的御守，但怎么都打干开、你捏了捏，里面似乎是空的。枕头下面有一个信封，你要打开看看嘛?"
    ],
    "小暖的话": [
      "小萌在稻荷神社等着姐姐！小萌会努力修行的，姐姐也要加油哦~"
    ],
    "大天狗的房间": [
      "房间内有一些凌乱，墙上挂满了许多照片和案件笔记，每个案子下面还有结语。\n墙上的案件：\n案件一：【富士山雪女失踪案】\n旁边用红笔写着：他不应该这么做！\n案件二：【白狐村族长儿子被杀案】\n旁边用红笔写着：似乎与【新苑组】中那个镰鼬暗杀组织脱不了干系。\n案件三：【八宝琉璃坊蜘蛛老人谋杀案】\n旁边用红笔批注着：我到底该怎么做？\n桌子上放着一个灰色的御守，但怎么都打不开，你捏了捏，里面似乎是空的，衣柜里有一个三十厘米左右的小包，斜跨的款式，绣着樱花团，里面还加了绒布，但是包的正面却有两个圆圆的小洞。"
    ],
    "阿玉的信": [
      "致妈咪\n妈咪，我是小小白\n我今天有乖乖吃奶奶做的胡萝卜糕，虽然小小白最讨厌胡萝卜了，但是奶奶说只要小小白乖乖听话妈妈就会回来了，所以小小白要乖乖的听爷爷奶奶的话，好好吃饭，好好睡觉，好好长大。\n妈妈，小小白有乖乖，妈妈，你能早点回来吗...小小白好想你"
    ],
    "阿玉的房间": [
      "这是一间传统的日式和堂，干净整洁，还有淡淡的香味。房间的壁橱似乎没有关好，你走过去关壁橱，发现壁橱里的被子并不整齐，被子上皱皱的，似乎有什么人躺过，梳妆台的抽屉里放着一副陈旧的妖怪牌，角都翘了起来，似乎是平时大家打牌时用的那副牌，衣柜里有一个小方盒子，不知道之前用来装什么，有些许粉末，盒子旁边放着一个白色的御守，但是怎么都打不开，你捏了捏，里面似乎是空的，床头柜里放着很多来往信件，基本都是同一个京郊的狐狸村寄来的，收信地址是八宝琉璃坊，你要拆一封看看吗？"
    ]
  },
  "第二幕": {
    "苍井惠（九尾狐）": [
      "一份医院的特殊时间探视申请表\n申请人：苍井惠\n探视病患：苍井白 6岁\n科室：血液科",
      "一份病危通知\n病患：仓井白\n病症：急性淋巴细胞白血病\n诊断结果：联合化疗效果不理想，急需造血干细胞移植",
      "一个金属胸牌\n上面写着：夜樱馆——阿惠"
    ],
    "凉宫桃子（小人偶）": [
      "一份医院的探视证明：\n探视人：凉宫桃子\n病患：凉宫玲子\n科室：神经内科\n病症：深度昏迷",
      "一本相册，打开后内容触目惊心，全部都是捕鲸的场景和鲸鱼的死状",
      "一份交通事故的赔偿书，金额：六十万日元"
    ],
    "死者房间": [
      "房间有打斗的痕迹",
      "桌上有一个钱包，打开后你们发现了很多名片，其中你注意到三张署名为死者的名片分别为：\n1.鱼类食品加工厂厂长小岛秀川\n2.鲸鱼捕捞与加工公司社长小岛秀川\n3.鲸鱼科研与保护委员会荣誉会长小岛秀川"
    ],
    "小暖（小狐狸）": [
      "一个盒子，打开后是一袋爪爪形状的小饼干。",
      "桌上放着一套妖怪牌。",
      "衣柜里挂着一套巫女服"
    ],
    "木之本奈奈（雪女）": [
      "一个贵族高中的校徽",
      "一个信封，打开后里面是600日元和一封简短的信，上面写着：奈奈，你要照顾好自己，妈妈，也需要人照顾啊。",
      "一份法庭的出庭证明，是一场交通事故的民事纠纷。",
      "一本画册，打开后都是手绘的美少女战士，最后一页却写满了对不起",
      "一个粉色的夏普翻盖手机，里面有很多陌生号码的通话记录，还有很多短信，内容基本为简单的时间、地点，而地点大多数都是不同的酒店房间。"
    ],
    "大厅和厨房": [
      "房间的地上扔着一个黑色的御守，但怎么都打不开，你捏了捏，里面似乎是空的。",
      "死者：脑后有被钝器击打的痕迹，一侧面部略微肿起，前胸至腹部有多处刀伤，舌头外吐，脸色发红。衣服稍显凌乱，似乎有被拖拽的痕迹，胸前有大量血迹，死者所趴的桌子和地板上有少许血迹。",
      "冰箱打开后发现了一个简易注射器，里面有一些黄色的海绵状的组织。",
      "厨房的料理台上有一套料理工具，但少了一把菜刀。"
    ],
    "桐生一郎（滑头鬼）": [
      "一个袖章，上面绣着：山口。",
      "一块丝帕，上面绣着两个大字：道义。",
      "一堆汇款记录，每月都在固定向一个小渔村汇一笔八万日元左右的款",
      "一张照片，是一个女人带着一个小女孩，照片背面写着：小樱桃",
      "一封信，被揉得很皱，上面写着：一郎，这些年你为我出生入死，打下这片江山，我能有现在的地位有你一半的功劳，我知道自己时日无多，这组织的二把手还由你来做，我那不争气的儿子，就靠你辅佐了，拜托你了，一郎。"
    ],
    "黑泽瞳（大天狗）": [
      "一张照片，上面是穿着高中制服的黑泽瞳，他身后还站着一个比他稍显年长的男青年和一对中年夫妻。男青年和男中年都身着京都警察厅的制服。",
      "很多京都护城河边阳光便利店的购物小票，商品是一个红豆面包，两瓶啤酒。",
      "一个本子，打开后发现是委托登记，里面大多数委托都是寻找小猫小狗或调查婚外情，出轨等内容，委托金都很低。",
      "一张名片 上面写着：黑泽瞳侦探事务所\n私人侦探：黑泽瞳。",
      "一个硫酸沙丁胺醇喷雾剂"
    ],
    "北野大熊（镰鼬）": [
      "一个郊区疗养院的进出申请表探望对象：北野夫妇",
      "一张店铺转让代理合同\n金额为：六千万日元\n转让方签名：北野大熊\n代理方签名：小岛秀川\n签订时间有些模糊看不太清楚"
    ]
  },
  "小暖": "狸猫：你叫小暖是吧？你学过给稻荷神大人穿衣服啊？\n小暖：是的，大人。我曾经努力修行过很久的侍衣神使。\n狸猫：好吧，那你好好为稻荷神大人整理好遗容，别搞错了\n你终于见到了你和妹妹憧憬了许久的稻荷神大人，可是如今在你面前的确实没有一丝生气的大人。你忍着悲伤正想替大人穿衣，却突然发现大人的衣服穿得很奇怪，很多地方都穿错了，左右襟压错了，内衣中衣穿翻了，蝴蝶结也打错了。\n小暖：大人，似乎不太对，稻荷神大人的衣服，似乎穿错了...\n狸猫大人：怎么可能呢？！我们今天早上出门的时候还是服侍了稻荷神大人三百年的侍衣神使人家给整整齐齐穿好才下来的！大人的衣服怎么可能穿错了呢！肯定是你学艺不精吧！\n小暖听后不敢反驳，点点头继续整理衣服，可是心里却冒出了一个大胆的念头，这个大人...不会是...假的吧?说着小暖小心翼翼的捏了捏稻荷神大人的脸和肚子，看看是不是假的，却发现都是货真价实的肉，也没有什么法术幻型或者伪装.....\n狸猫：你整理完了没？整理完了就赶紧回去吧。"
}