{
    "Uncle Bai": [
      "Practice notes (2016/10/1-10/15): Documented my research and missing my mom, tried calling her but she didn't answer.",
      "Mother Muzhen Bai's phone records from October, marked on the 13th with a note: Beijing, a mysterious man at a phone booth.",
      "Two tickets for the Beijing-Changsha flight on February 16, two tickets for the museum on February 17.",
      "A photocopy of Muzhen Bai's missing person report.",
      "There’s a stack of missing person notices in the bag, and posts about finding my mother on my social media.",
      "January 2017 cultural relics newspaper: 'A private museum in Changsha displays several treasures of Genghis Khan in a short time....'",
      "Surveillance footage taken on my phone, the man in the footage is Director Zhen.",
      "A photo album of Genghis Khan; books about the Yuan Dynasty: 'The History of Yuan: The Biography of Genghis Khan', 'History of the Mongol Empire', etc.",
      "A wooden box containing a document titled 'My Museum Is Awesome' about Genghis Khan's descendants.",
      "A backpack with a lot of iron wires, sharp needles, etc.",
      "Numerous photos of exhibits on my phone and a close-up photo of Zhen's office door lock."
    ],
    "Curio He": [
      "A photo with Mongolian herdsmen, He has a bandage on his face and many skin repair medicines.",
      "Two emails from May 2014.\nMay 2014\nLittle He:\nLittle He, this is the location of Genghis Khan's tomb, I have sent the relevant materials in the attachment.\nMay 2014\nLittle He:\nLittle He, you will lead the archaeological team in the future, good luck!",
      "Medical record content: May 2014 - January 2016\nFractures, external injuries, and good recovery from health changes. — MG Hospital Mongolian Branch\nJanuary - October 2016\nSkin repair surgery, vocal cord repair surgery, etc. — Zhen Beautiful Plastic Surgery Hospital",
      "A carefully preserved chain, with a copper key pendant.",
      "Text messages with Director Zhen:\nZhen Bro, I have something good to show you, why aren't you at the museum? February 17, 2017, 15:10\nI’m on a business trip, I probably won't be back until around 18:00! February 17, 2017, 15:12\n19:10\nZhen Bro, why are you still not back? February 17, 2017, 19:10",
      "Several newspapers: Zhen's Museum rises overnight, exhibition of relics from the Mongolian Yuan period.",
      "An ancient box, the lock is broken inside. Inside are my father's bookmarks, research notes on ancient books, and a stone tablet. The note states: According to the book, the general Borchuk under Genghis Khan repeatedly risked his life for him. He was once stabbed in the heart by an enemy soldier, and thanks to his armor, he survived, but the armor left an unrepairable scar. The armor has accompanied Borchuk for many years and has developed a spirit.",
      "A diary: January 31, 2017\nWhy did things from Genghis Khan's tomb appear in Changsha? What is going on?\nFebruary 13, 2017\nZhen won't say anything, I must find out the truth!",
      "Iron powder sprinkled on the stone tablet of the ancient box reveals the text. [Tomb Raider, blood ends in death]",
      "Inside the compartment of the ancient box, there are images of Genghis Khan and Borchuk, with Borchuk's image resembling Manager Sa.",
      "Carried: Museum ticket and a dagger.",
      "A photo with Sa and a man (looking like Hu Ge), dated 2006.",
      "Message from Zhen: March 2012 'A thief broke into the house, your dad.... is gone.'"
    ],
    "Mystery Ou": [
      "A photo of the guide with Director Zhen on the grasslands.",
      "Text messages on the phone: Sister Ou, I'm sorry, I didn't know you had your eye on this tomb, I'll send you the relics inside right away.",
      "A piece of clay with a key imprint.",
      "Entrustment letter: Commission to steal Genghis Khan's relics, a large cross drawn in red pen.",
      "Old plane ticket from 2011: Mongolia - Beijing.",
      "Inside a drawer: a map of the excavation of Genghis Khan's tomb.",
      "Moving company order: February 15, transporting items for Zhen's museum: precious antiques.",
      "Newspaper: A museum in Changsha exhibits a large number of treasures from Genghis Khan's tomb.",
      "An ancient scroll. Written in red: 'Those who offend the Khan's mausoleum shall die bloodily.'",
      "Plane ticket: Xi'an - Changsha.",
      "A hand-drawn museum route map.",
      "Mystery Ou carries a knife.",
      "Mystery Ou carries a key.",
      "Ticket for the visit to 'My Museum Is Awesome' on February 17.",
      "Photo: A lovely girl and a man, both smiling very happily.",
      "Mystery Ou's ID card: Name, Mystery Ou; Gender, Female; Ethnicity, Mongolian; Date of Birth, January 1, 1992; Address, 666 Pine Town, Mango City, Mongolia."
    ],
    "Manager Sa": [
      "Various history books, many studying the era of Genghis Khan.",
      "A knife in the space.",
      "A heavy iron sandbag that has been opened.",
      "Work certificate - Since January 2017, serving as a volunteer guide for 'My Museum Is Awesome.'",
      "Research literature on various secret techniques — Taoist sealing techniques.",
      "Text message from Sa to Zhen: Director, this colorful glazed large bottle from the Genghis Khan period is fake, the Mongolian people didn't have this technology.",
      "Handwriting from work records - Since October 15, 2016, Sa's handwriting has changed, becoming ugly.",
      "Sa's bachelor's to doctoral degree certificate (2016 PhD graduation).",
      "A photo of Sa on the beach, dated July 2016.",
      "Powder from Mongolian sleeping medicine on the cuffs.",
      "Sa has an old scar on the chest and a fresh wound on the right fist.",
      "Museum visitor ticket - October 15, 2016.",
      "Phone photos of internal documents from the World Heritage Bureau - Borchuk's armor has appeared in the public and is collected by 'My Museum Is Awesome.'",
      "Genealogy - The Sa family genealogy. Borchuk is Sa's ancestor."
    ],
    "Dead Person's Room": [
      "A photo of the armor that accompanied Borchuk in battles for many years, with strange patterns on it.",
      "Transport order - Time: 2017, Location: Mongolia → Changsha, Content: Armor that has accompanied Borchuk in battles for many years, bearing the Mongolian totem bow.",
      "The lock on the door of the space has slight scratches; when the detective kicked the door open, it was still locked.",
      "In the long wooden cabinet in front of the sofa, there are traces of ancient relics being moved, placed on both sides of the cabinet.",
      "Photo of the deceased Zhen and a man who looks like Hu Ge.",
      "Crime scene layout and personnel positions.",
      "Revival secret technique - The first page states the method to revive Borchuk: Use pure blood of Genghis Khan's descendants to soak the armor that has accompanied General Borchuk in battles for many years to revive Borchuk.",
      "Director Zhen's bathroom sliding door is open, Zhen is kneeling next to the bathtub in his space, with a deep wound on his wrist, the bathtub contains a lot of blood, and there is a blood-stained dagger in the tub.",
      "At the entrance of the space, Security Wei collapsed, and there is an ashtray.",
      "Revival secret technique - The second page states a rumor: The reviver, if attaching their soul to a living person, will slowly erode the body, making the body and soul more similar.",
      "In the drawer, there are some medications for high blood pressure, most capsules contain red powder, a few capsules contain green powder, and the box for the medication on February 17 is already empty.",
      "On the ground, there is a button; comparing it to the suspect's clothing, it is found to belong to Curio He.",
      "A map - marking the location of Genghis Khan's tomb.",
      "In the drawer, an alarm receipt - Has educated Ou, who caused social disorder from Mongolia, and sent it to the Mongolian Embassy in China for processing."
    ],
    "Security Wei": [
    "Security Wei's phone album - contains a photo of Mystery Ou, dated February 14.",
    "Text message: Third Uncle, why does the security guard next door have a monthly salary of 3888 yuan while I only have 88 yuan? Shouldn't you give me a raise?",
    "Diary - Tomb Raider, blood ends in death!",
    "Text message - Zhen: I'll be back at 6:30 PM, hope you are ready for what I want. You just came out for a little while and already started chewing, be careful I can send you back anytime. 2017/02/17 10:05.",
    "A book - 'The Man on Horseback', documenting the story of General Borchuk and Genghis Khan, Borchuk was a founding hero assisting Genghis Khan.",
    "Security Wei has keys to everyone’s space, hanging in the security room.",
    "Text message: Salary transfer records, 88 yuan in December, 188 yuan in January.",
    "Many books about Genghis Khan.",
    "Visitor log - 10:00 Uncle Bai, 15:00 Curio He, Mystery Ou, 15:10 Uncle Bai.",
    "A strange tattoo on the lower back.",
    "Message: Zhen: I'm back, where are you? If you don't tell me the exact location of the main tomb, I'll seal you back to sleep for another thousand years 2/17 18:30.",
    "Security Wei has a scar on his chest.",
    "Reading pen, phone, children's pinyin learning materials, Chinese dictionary, pinyin poster, with the letters b, p, m.",
    "Notebook - I love the daytime! At night I can only sleep, can't do anything!"
    ]
}