{
    "Uncle Bai": {
        "Story": "I am a true Beijinger, and everyone calls me 'Uncle Bai.' My father has been doing business abroad for years, and my mother and I have been living in China. From a young age, my parents taught me to maintain a heroic spirit and noble qualities because we are descendants of the great Genghis Khan! In 2015, I worked hard and got into Peking University’s Ancient Chinese History program. In early October 2016, a large-scale DNA study targeting descendants of Genghis Khan was conducted. The research showed that 17 million people carry the Khan's genes, and the organizers wanted to compare DNA to see whose lineage is the most authentic. My mom submitted our information and surprisingly stood out among the 17 million! She was recognized as one of the closest descendants, and soon major media outlets were reporting on it. In mid-October, our research group went on a field trip. The workload was heavy, so I called my mom, but her phone went unanswered for several days. Feeling uneasy, I asked Mr. Wang next door to check on her. He told me nobody was home and he hadn’t seen my mom for days. I returned to Beijing on October 15th to find a pile of newspapers at my door, and the house was dusty—clearly no one had been there for a while! I immediately reported it to the police. A month went by with no leads, and the case turned into a missing persons investigation. As the investigation stalled, I waited for news while posting about my mom's disappearance on social media, hoping witnesses could provide leads, but I had no luck. On October 16th, I copied the case report at the police station and printed my mom's phone records for October. The last call was on October 13th from an unknown number. Investigation revealed it was from a public phone in Beijing. I provided this to the police, who reviewed surveillance near the phone booth, but sadly, they found nothing suspicious. I decided to take a leave of absence from school to investigate myself. After several months of searching with no news, I comforted myself with the thought that as long as there’s no body found, my mom is still alive! On February 16, 2017, while organizing things at home, I came across a newspaper from January featuring a report on 'a private museum in Changsha exhibiting Genghis Khan's treasures...' The director's photo caught my eye—it was the same man from the surveillance footage! He must be connected to my mom’s disappearance! That night, I bought a ticket and hurried to Changsha, staying at a hotel near 'My Museum'.",
        "Script": "On the day of the incident (February 17, 2017)\n10:00 I arrived at the museum and asked the security guard at the entrance, 'Is the director here?' To my surprise, the guard rudely yelled, 'Get lost!' What an absurd response! No wonder he could only be a guard. I wandered around the museum, which was full of treasures, and took many pictures. While walking, I reached the director’s office, but the door was locked. Was he not there? I thought I might find clues inside. I took a close-up photo of the lock and bought some lock-picking tools from a hardware store.\n14:20 I returned to the director’s office and, when no one was around, inserted a wire into the keyhole. After fiddling for a while, I finally opened it! I was so clever! I sneaked in, only to find it was not just an office but also the director's living quarters. I opened a drawer and found a wooden box containing information about Genghis Khan's descendants, along with my mom’s details and newspapers. Just as I was processing this, I heard footsteps outside. I quickly stuffed the box into my bag and slipped out.\n14:30 I left the museum, realizing I might have forgotten to close the door. I carefully examined the materials in the box. What?! It mentions needing my mom's blood to carry out some secret technique?! What did Zhen San do to my mom?!\n15:10 Not giving up, I decided to return to the museum to find the director, so I bought another ticket.\n17:00 By closing time, the director still hadn’t returned, and the guard was clearing people out. Today was really unlucky! I had to sneak in at night!\n19:14 I arrived at the museum and noticed the big silly guard was gone, so I quietly entered. The director's office door was wide open, and to my shock, there were many people inside? And lying on the floor was that big silly guard?",
        "Relationship": "Victim:\nZhen San (male, 40), a nondescript private museum director in Changsha, 'My Museum'.\nOther Suspects:\nSuspect: Curio He (male) - unknown, I've never seen him.\nSuspect: Security Wei (male) - a security guard at the museum, has a strange temper, just a silly hat.\nSuspect: Manager Sa (male) - unknown, I've never seen him.\nSuspect: Mystery Ou (female) - unknown, I've never seen her.",
        "Performance": "I am Uncle Bai, a student from Beijing. Yesterday, I saw a newspaper article about 'My Museum' exhibiting many Mongolian treasures. I was interested and came here. I spent the morning in the museum and saw Security Wei clearing people out at closing time, so I obediently left. I don’t know the deceased, I’ve only seen him in the newspaper, but I’ve never met him!",
        "Purpose": "1. Find out the truth, 2. Avoid being labeled as the murderer.",
        "Ability": ""
    },
    "Neighbour Gui": {
        "Story": "I am Neighbour Gui, living next to 'My Museum.' My father is an outstanding detective, and influenced by him, I aspired to be a police officer from a young age. In September last year (2016), I was accepted into the police academy and became a cadet. In February 2017, during the winter break, my cat suddenly ran out one night on February 17th. I chased it all the way to 'My Museum.' While searching for my cat inside the museum, I accidentally triggered the alarm. The museum guide, Manager Sa, heard the sound and came out to help me find the cat. At that moment, we noticed a woman (later identified as Mystery Ou) sneaking around near the office of Director Zhen. Upon seeing us, Mystery Ou looked nervous and tried to leave. My detective instincts told me something was off! I knocked on Director Zhen's door, but no one answered. I turned the doorknob and found it was locked, so I kicked the door open and discovered Director Zhen lying dead next to the bathtub in the office's inner bathroom, with a lot of blood around. Security Wei was unconscious in the office. After a while, two suspicious individuals (Bai and He) came to the door of Director Zhen's office, and I called out to them...",
        "Script": "Case Report:\nThe tomb of Genghis Khan, sealed for 800 years, has never had its exact location known. It is said that anyone who desecrates the Khan's tomb will surely die. Yet, the Khan's relics have suddenly appeared in a private museum in Changsha. On the evening of February 17, 2017, at 7:30 PM, the museum's alarm suddenly rang out. Manager Sa caught the neighbour who triggered the alarm; she was there looking for her cat. At that moment, they discovered Mystery Ou loitering suspiciously at the door of Director Zhen's office, which was locked tight. After the neighbour kicked the door open, they found security guard Wei unconscious on the floor, with a strong smell of blood in the room. The neighbour rushed to the inner bathroom and found Director Zhen dead next to the bathtub! Through investigation and searches of the museum, the detective narrowed down the suspects to He, Bai, Wei, Sa, and Mystery Ou. Who among them is the true murderer of the director?",
        "Relationship": "Victim: Director Zhen\nSuspect: Curio He, male, a guest at the museum.\nSuspect: Mystery Ou, female, a guest at the museum.\nSuspect: Manager Sa, male, a museum guide.\nSuspect: Uncle Bai, male, a museum guest.\nSuspect: Security Wei, male, a security guard at the museum.",
        "Performance": "As the detective in this case, please read the case report and organize the suspects to introduce themselves and provide their alibis.",
        "Purpose": "Find out the truth.",
        "Ability": ""
    },
    "Curio He": {
        "Story": "My surname is Zhen, and my name is Zhen He. The Zhen family is known for archaeology; my father is an archaeological expert, and we believe that any unearthed artifacts should be submitted to the state. My father, Zhen Da, is the direct descendant of the family, and Director Zhen, my third uncle, is Zhen San (my second uncle is said to have died young). My mother passed away early, and my father and I relied on each other. In my father's room, there are many strange treasures, including a box on the highest shelf of the bookcase that he never let me touch. In 2006, I was accepted into Peking University's history department, and I looked like Hu Ge, so everyone called me 'Little Hu Ge.' Here, I made many friends, including my best roommate, Xiao Sa. In September 2010, I began my master's in archaeology. In early 2012, during my second year, I was in the mountains on an archaeological internship without signal. In June, I returned and saw a message from my uncle! What?! My father had an accident three months ago?! I bought a ticket home immediately. My uncle said a thief broke into our home and stole valuable items, including the box from the top shelf of the bookcase. After my father's passing, my uncle supported my studies, and I worked hard to fulfill my father's wishes and find more artifacts to submit to the state. Later, my uncle renovated the ancient treasures and opened a museum called 'My Museum' to showcase our family's eclectic collection. In 2013, after earning my master's degree, I joined the archaeological association. In May 2014, my uncle informed me that he found the location of Genghis Khan's tomb in Mongolia and sent me the related materials. I applied to form an archaeological team, which was quickly approved, and led a team of six to the tomb. Following my uncle's materials, we successfully found the tomb, which contained many valuable artifacts. Just as we were preparing to leave, an accident occurred—rocks fell from above, killing some of my companions. I fell into a hole that led to a hidden passage. Injured and seeking survival, I managed to escape into a cold pool. When I regained consciousness, I was rescued by a herdsman in the grasslands, but I was severely injured. I wanted to return home to protect the artifacts for the state. After nearly a year and a half of treatment, I recovered, but my appearance and voice had changed. In January 2017, I returned to Changsha, only to find my uncle's museum displaying artifacts from Genghis Khan's tomb. Confused, I suspected my uncle of having ulterior motives and planned to investigate undercover as Curio He to uncover the truth about my father's death.",
        "Script": "On the day of the incident (February 17, 2017), at 15:00, I arrived at the museum to speak with my uncle, but he was absent. I sent him a message asking why he wasn't there. After realizing he wasn't in the museum, I decided to check his room for clues. I pushed the door, and to my surprise, it was unlocked. I found a pried-open box next to his bed, revealing a lock that matched the key from my father's necklace. This must be the box that went missing when my father died! I took the box home and spent the afternoon studying its contents, which included a strange photo and my father's notes. I began to suspect that my father's death was related to my uncle. I remembered the rocks falling in the tomb and the artifacts appearing in the museum afterward. Determined to avenge my companions and father, I rushed to the museum armed with a dagger. At 19:05, I entered the museum, but my uncle's office was locked. I waited for him to return, suspecting he was involved in the tragedy. Finally, I confronted him when I discovered there were others in the office and heard that my uncle was dead.",
        "Relationship": "Victim:\nDirector Zhen (Zhen San): 40 years old, male, my third uncle, owner of 'My Museum'.\nOther Suspects:\nSuspect: Mystery Ou (female), an exotic beauty, but I don't know her.\nSuspect: Uncle Bai (male), looking fair and clean, unknown to me.\nSuspect: Manager Sa (male), a museum guide, seems familiar but I can't place him.\nSuspect: Security Wei (male), a large, silly-looking security guard.",
        "Performance": "My name is Curio He, 26 years old, an antique dealer. I have a friendly business relationship with Zhen. Today at 15:00, I visited the museum, but Zhen was absent. After messaging him, I returned home after browsing around the museum.",
        "Purpose": "1. Uncover the truth, 2. Avoid being identified as the murderer.",
        "Ability": ""
    },
    "Mystery Ou": {
        "Story": "I am Mystery Ou, a 25-year-old shepherdess from the grasslands. I came to this museum for revenge!\nI have lived on the grasslands my whole life as a nomad, relying on herding for generations.\nIn the valley where I live, there are herds of cattle and sheep, and the grass is lush. The herders here are simple and enthusiastic, and the songs of the grasslands resonate under the blue sky, blossoming like flowers of joy in the heart.\n【ID Card: My ID is Mystery Ou, No. 666, Pineapple Town, Mango City, Mongolia】\nWhen I was very young, my mother left us due to illness, leaving only my father and me. Therefore, my father has always treated me very well. He never imposed the family mission on me, only telling me to follow my heart and do whatever I want.\n【Photo: A happy photo of my father and me】\nAs I grew older, I particularly wanted to see the outside world. I told my father about my wish to go to school elsewhere. He agreed immediately and even bought me a plane ticket.\n【Plane Ticket 2011: Mongolia — Beijing, my ticket for school】\nSince my family has guarded tombs for generations, I am very familiar with feng shui and tomb mechanisms, so I started doing some treasure hunting business. Although I am a woman, I naturally possess the spirit of a female general, quickly making a name for myself in the field. People in the tomb raiding community respect me. However, I have never touched the tombs my family guards, nor have I ever touched artifacts from the time of Genghis Khan.\n【Commission Letter: A commission to steal Genghis Khan artifacts, marked with a big cross in red pen】\n【Text Message: Sister Ji, I'm sorry, I didn't know you were already in this tomb. I'll deliver the artifacts to you right away】\nIn early 2017, I returned home to visit my father, only to find him bedridden. Upon inquiry, I learned that the Genghis Khan tomb my family guarded had been robbed. Although it was only a secondary tomb, my father felt he could not face our ancestors and fell ill. Dragging his sick body, he wanted to go out and search for the lost treasures. I looked at my sick father, feeling both guilty and angry. I felt guilty for not inheriting the family mission of guarding the tombs, and I was furious that tomb robbers dared to steal from our ancestors! I decided to find the tomb robbers and teach them a lesson.\nTo understand my family's connection to the Khan, I must start from the year 1202.\nIt was decided that the foundation of the Great Khan must be protected to prevent thieves from inheriting the Khan's position. The third son of the Khan, Kublai, agreed to my ancestor's request and issued an order, appointing my ancestor as the Khan's deputy, tasked with guarding the Khan's tomb for generations.\n【Ancient Scroll: Those who violate the Khan's tomb will die a bloody death】\nI asked the local herders if they had seen any suspicious people recently. One household told me that a Chinese man with the surname Zhen had recently come and hired him as a tour guide, spending lavishly, and showed me a photo of the two of them together.\n【Photo of the tour guide and Director Zhen on the grasslands】\nI searched everywhere for Zhen but found no clues. One day, I saw in a newspaper that a museum in Changsha was exhibiting many treasures of Genghis Khan, which instantly sparked nationwide discussion. I had visited many museums before, and most of the Khan's treasures were fake, but holding onto a glimmer of hope, I rushed to Changsha to check out this museum.\nOn February 14, I arrived in Changsha and immediately began investigating the museum. As soon as I entered, I was stopped by a strange security guard, but perhaps because of my stunning beauty, a few flattering words got me through. Once inside, I discovered that the museum was indeed filled with stolen treasures. I then found the director's office, and it was indeed the man from the herder's photo.\n【Newspaper: A museum in Changsha exhibits a large number of Genghis Khan treasures】\n【Plane Ticket: Xi'an to Changsha, arrival date February 13】\nDirector Zhen was studying a map when I entered his office, and I immediately recognized it as an excavation map of Genghis Khan's tomb, marking both already excavated tombs and others yet to be excavated.\nTaking away treasures is the greatest insult to the Khan and absolutely intolerable! Infuriated, I drew a knife and pressed it against his neck, revealing my identity and demanding he return the treasures without hesitation.\nHe was frightened by my actions and hurriedly agreed to return the treasures, even persuading me that killing was not worth it. We arranged for a moving company to come the next day to transport the treasures, and he promised to comply. I didn't want to cause more trouble, so I decided to let him live. Before leaving, I took his excavation map, warning him that I would not let him off the hook if he ever laid hands on the treasures again, and he nodded repeatedly.\n【Drawer Contents: Excavation map of Genghis Khan's tomb】\nOn February 15, the next day, I called the moving company as planned to transport the treasures. However, unexpectedly, Director Zhen immediately reported to the police, falsely accusing me of being a thief and a bandit. The police, seeing his legal evidence for transporting the treasures, were deceived and forcibly took me away to the Mongolian embassy museum in China. This shameless Zhen, I must give him a good lesson.\n【Moving Company Order: February 15, museum to transport items: ancient antiques.】\nI never expected that despite my numerous kind warnings, this despicable man remained unrepentant. I will no longer show him mercy; rather than let him continue to disgrace the Khan's treasures and shame my people, it's better to send him to meet his end and personally apologize to the Khan!",
        "Script": "On the day of the incident (February 17, 2017)\n15:00 I arrived at the museum, bought a ticket, concealed the knife I brought, and searched for Director Zhen, only to find he was not there. I began studying the structure and layout of the museum, trying to figure out the layout of Director Zhen's office.\n【Personal Items: February 17 museum ticket】【Hand-drawn museum map】【Knife】\n17:00 The museum closed, but my plan had not yet been executed, so I continued to hide stealthily in the museum. At 17:10, while observing and planning, I was suddenly stopped by Security Wei, who took me to the security room for questioning, telling me not to linger in the museum. I pretended to agree but caught sight of a set of keys hanging on the wall of the security room and then pretended to leave the museum. At 17:30, I went to a nearby shop to buy modeling clay. At 18:50, I quietly returned to the museum and used the purchased clay to take a key imprint.\n【Key imprint in modeling clay】\n18:55 I left the museum to have the key copied.\n19:30 I found an old man to carve a key, then snuck back into the museum. With the key in hand, I was about to open the door when I was suddenly stopped by Neighbour Gui and Manager Sa.\n【A key】",
        "Relationship": "Victim:\nDirector Zhen (male, 40 years old)\nOther Suspects:\nSuspect: Curio He, male, not paying attention\nSuspect: Manager Sa, male, museum tour guide\nSuspect: Security Wei, male, museum security\nSuspect: Uncle Bai, male, unknown",
        "Performance": "I am Mystery Ou, a visitor to the museum. The victim, Director Zhen, is the head of this museum, and I am not very familiar with him. I have never seen him today, so how could I possibly kill him?",
        "Purpose": "1. Find the truth, 2. Not be identified as the murderer",
        "Ability": ""
    },
    "Manager Sa": {
        "Story": "I am Manager Sa, the tour guide of the 'Incredible Museum'. I am a walking encyclopedia of history.\nI am a descendant of Borjigin, a general under Genghis Khan. From a young age, I was passionate about history, especially that related to Genghis Khan and Borjigin.\n【Genealogy: I am a descendant of General Borjigin】\nIn 2006, I was admitted to Peking University’s History Department. In September 2010, I began pursuing a master's and doctorate in archaeology at Peking University, hoping to find more historical materials related to my ancestors. While there, I followed my advisor to various tombs but found nothing of interest.\n【Photo: Manager Sa in archaeological sites】\nIn June 2016, I graduated with a doctorate and entered the National Cultural Heritage Administration, now working in the 'Cultural Relics Protection and Archaeology Division'. Here, I can better understand history.\n【Degree Certificate: PhD certificate (2016)】\nIn October 2016, I saw an internal document from the Division stating that armor belonging to General Borjigin had appeared in a private museum called 'Incredible Museum'. This must be my ancestor's armor! I rushed to visit the museum immediately.\n【Photo: Internal document stating Borjigin's armor appeared in 'Incredible Museum'】\nAll these memories often flash through my mind, belonging to Manager Sa.\nActually, I am Borjigin, a founding hero of Mongolia. I followed Genghis Khan to conquer and unify Mongolia, being one of the top heroes of his reign. During our western expedition, Genghis Khan passed away, and I voluntarily died to protect him eternally. I was sealed in armor and entered eternal darkness.\nOn October 15, 2016, I opened my eyes to see a familiar yet strange face in the glass. I had come back to life! When I woke, I was standing outside the 'Incredible Museum', but it was closed that day.\nStrangely, even though I only knew Mongolian, I could understand the meanings of the strange words before me. Faced with this unfamiliar world, I felt guided by some unseen force.\n【Museum ticket: October 15, 2016】\nI speculated that someone had used secret arts to awaken me. However, my body had decayed, causing my soul to awaken in the body of my descendant, Manager Sa. The memories of Manager Sa often flash through my mind, so I quickly adapted to this world.\n【Writing Samples: Manager Sa's handwriting became terrible starting November 2016】\nToday's world is fascinating, filled with skyscrapers and bustling traffic, but the advanced technology makes me realize how small my previous world was. Yet, as I learn more about this world, I feel increasingly lonely. I am a Mongolian man galloping across the grasslands, a general drinking strong liquor and laughing in the desert; I do not belong to this era!\nThrough Manager Sa's work and materials, I learned much about history, especially during Genghis Khan's time, and I increasingly believe that like Genghis Khan, I should remain asleep in the past. If I fall into slumber again, Manager Sa's soul will awaken anew. I decided to find my armor and re-seal myself.\nI consulted numerous Daoist texts seeking a method to fall asleep again.\n【Various historical books, many studying Genghis Khan's period】\n【Daoist sealing techniques research documents】\nMy armor has accompanied me through life and death, protecting me from danger. An enemy once stabbed me with a spear, leaving an indelible scar on my armor.\nAfter I possessed Manager Sa's body, he also developed a scar on his chest.\n【Scar on Manager Sa's chest】\n【Photo of Manager Sa at the beach without scars】\nThrough a photo on my phone, I learned that Borjigin's armor was in the 'Incredible Museum', where I had awoken. There must be a problem inside 'Incredible Museum'. On January 10, 2017, I applied to work there as Manager Sa. With my professional historical knowledge and understanding of Genghis Khan's era, I became a volunteer tour guide without any salary.\nSometimes I help the museum director, Zhen Lan, authenticate artifacts. Director Zhen seems very interested in Genghis Khan, often bringing me items claimed to be from his era, but most of them are fakes.\n【Work ID: Volunteer tour guide since January 2017】\n【Text Message: I told Zhen that the painted vase from Genghis Khan's period is fake; Mongolians did not have that technology】\nThe museum also has a strange security guard who has a good relationship with Director Zhen, often receiving gifts from him. They frequently hold meetings without me.\nI couldn’t find Borjigin's armor in the 'Incredible Museum', and when I privately inquired about it with Zhen and Security Wei, Zhen claimed it was a rumor and that he never collected armor, but Wei seemed evasive, as if he knew something.\nIn early February 2017, Director Zhen unknowingly brought in a batch of artifacts, many from the Mongolian period, which I immediately recognized as burial items meant for Genghis Khan! The secondary tomb is very close to where Genghis Khan is truly buried. Oh no, Director Zhen actually raided the Khan's tomb and disturbed his rest!!!\nSince ancient times, it has been said that grave robbers face dire consequences; I will use Zhen's blood as an offering to honor my Khan.",
        "Script": "On the day of the incident (February 17, 2017)\n10:00 AM, the museum opened. Zhen San left early for a business trip to Wuhan. I didn't want to see the artifacts Zhen had stolen from the Khan's tomb, so I stayed in my room practicing martial arts, injuring my right hand in the process.\nSince awakening, I have been training physically. I was once a general who could shoot an eagle with a bow, but now I can't even break a sandbag.\n【Room: Weights and injured right fist】\nAround 2:40 PM, I noticed Zhen's office was unlocked. Knowing he has high blood pressure and takes medication at 7 PM every night, I took some Mongolian sleeping pills from the museum's exhibition and emptied them into a basin, then filled them with green gel. I planned to wait for Zhen to come back, take the pills, and then bleed him.\nAt 3 PM, I left Zhen's office.\nAround 6:30 PM, I saw Zhen returning and going straight to his office, closing the door.\nAt 7 PM, it was time for Zhen to take his medicine.\nAt 7:10 PM, estimating that Zhen had taken the sleeping pills, I grabbed a knife and went to his office to prepare to bleed him.\nAt 7:15 PM, I arrived at Zhen's office door and twisted the doorknob, but it wouldn't open. Afraid of making too much noise and alerting Security Wei, I returned to my room.\n【Room: Knife present】\nAt 7:30 PM, an alarm suddenly sounded in the museum. I came out to the main hall and saw the strange Neighbour Gui running around, with Security Wei missing. I had to stop her. Neighbour Gui claimed she was looking for a cat, and just then we saw a suspicious figure at Zhen's office door, so we shouted at her. The person was startled, turned around, and I realized it was Mystery Ou, a female guest who had visited the museum in the past few days.\nSeeing us, Mystery Ou hurriedly tried to leave. Neighbour Gui discovered that Zhen's office door was locked and kicked it open.\nWhen the door opened, a strong smell of blood filled the air. Security Wei lay unconscious on the ground, and Director Zhen was dead in the bathroom...",
        "Relationship": "Victim:\nDirector Zhen (Zhen San), male, 40 years old, director of 'Incredible Museum'. Although it's an obscure private museum, the items inside are remarkable.\nOther Suspects:\nSuspect: Curio He, male, a frequent guest and familiar with the director.\nSuspect: Security Wei, male, the only security guard in the museum.\nSuspect: Mystery Ou, female, a guest who visited in the past few days.\nSuspect: Uncle Bai, male, unknown.",
        "Performance": "I am Manager Sa, a 27-year-old capable young official in the cultural relics bureau, serving as a tour guide in this museum, a walking encyclopedia of history. I stay in the museum's employee dormitory.\nThe museum opened at 10 AM today, and since Director Zhen was on a business trip, I felt down and stayed in my room all day. Around 6:30 PM, I saw Director Zhen return. After 7 PM, I intended to find him to discuss something but found his office locked, so I returned to my room first.\nAt 7:30 PM, the museum alarm rang, and I saw Neighbour Gui.",
        "Purpose": "1. Find the truth, 2. Avoid being identified as the murderer",
        "Ability": ""
    },
    "Security Wei": {
        "Story": "I am a security guard at a museum in Changsha called 'Awesome My Museum.' Besides me, there is Director Zhen and a guide named Manager Sa who joined on January 10, 2017. As for how I became a security guard, it all started four months ago...\n[Visitor registration today 10:00 from Xiao Jie: 15:00 1 Curio He, Mystery Ou: 15:10 Uncle Bai]\n[Security Wei has all the room keys, hanging in the security room.\nFour months ago (10/15/2016), a man woke me up. I slowly opened my eyes, my whole body aching, as if I had slept for many years. The stranger told me I was Borzhig, one of the founding heroes of the Mongol Empire who assisted Genghis Khan 800 years ago, and he used a spell to wake me up.\n[A book — 'The Man on the Horse' records the story of General Borzhig and Genghis Khan; Borzhig was a founding hero assisting Genghis Khan.]\nNo wonder everything felt so strange after I woke up. The man's accent was hard to understand. I looked in the mirror and saw a deep scar on my chest, thinking: maybe the world has changed, and I really am from 800 years ago... but I don’t remember anything.\n[Security Wei has a deep scar on his chest.]\nLater I found out the man was named Zhen Saner, known as 'Third Uncle,' the director of the museum. He let me stay here as a guard. Protecting others made me feel valuable, a feeling I was familiar with. But he warned me that if I didn't obey, he would seal me back. I didn’t know what he wanted me to obey, but I really didn't want to sleep again!\n[A notebook — I love the daytime! At night, I can only sleep and do nothing!]\nThird Uncle seemed to sense my strong interest in this world and bought me many books and electronics to help me adapt to 21st-century life. After work every day, I learned to write, study pinyin, and surf the internet. Now, I can basically understand all the words and hear what others say.\n[A pen, phone, children's pinyin learning materials, Chinese dictionary, pinyin poster.]\nI even bought a book 'Biography of Genghis Khan' to study. After reading it, I remembered many things, like what food Borzhig liked, what kind of girls he preferred, and which brother he was closest to...\n['Biography of Genghis Khan']\nTwo months ago (12/20), Third Uncle called me to his office, forcing me to reveal the location of Genghis Khan's treasure, or he would seal me back. I realized I was just his tomb raiding tool! Under his pressure, I finally recalled a location and drew a map for him, but I wasn't sure where it was. Later, he was out for a while and returned at the beginning of 2017 to open an exhibition on Genghis Khan. Ah, I shouldn't have drawn that map for him! I didn't expect my memories to be so accurate! Not only was Third Uncle coveting the treasure, but even Manager Sa, who joined this year, kept asking me about it.\nLiving in the museum for so long, I saw Third Uncle for what he really was — extremely stingy. I heard from the nearby guard Wang that his salary was 3888, but Third Uncle only gave me 88 yuan a month, taking advantage of my ancient ignorance! When I confronted him, he finally raised it by 100 yuan.\n[Text message: Salary transfer record, 88 yuan transferred in December and earlier, 188 yuan in January.]\n[Text message: Third Uncle, why does the guard Wang next door earn 3888 yuan a month while I only get 88 yuan? Shouldn’t you give me a raise?]\nThree days ago (2/14), a woman came to the museum (later I found out it was Mystery Ou). I thought she was coming in aggressively and wanted to question her, but her voice was so nice that I let her in and secretly took a photo.\n[Security Wei's phone album — there is a photo of Mystery Ou, dated 2/14.]\nOn the evening of February 16, Third Uncle told me he thought the previous location couldn't be the main tomb, as there were too few accompanying artifacts. He wanted me to reveal the location of the main tomb. I told him many times that I didn’t remember, but he didn’t believe me and threatened to seal me if I didn’t tell him the next day.\nDon’t say I’ve lived for 800 years and become confused; even if I remembered, I wouldn’t tell this tomb raider any more information! I knew Third Uncle was going on a business trip the next day, so I decided to eliminate him when he returned. I read in a book that 'tomb raiders die with their blood,' a sacrifice of blood to warn heaven and earth. He steals from my people and threatens me; it's a dead end!\n[Diary: Tomb raiders die with their blood.]",
        "Script": "On the day of the incident (February 17, 2017)\n10:00 The museum had just opened, and I received a text from Third Uncle saying he would be out today, and if I didn't prepare the map by 6:30 next year, he would seal me. A moment later, a strange student came and asked if the curator was in. I said, 'Get lost, get lost...'\n[Text message Zhen: I will be back at 6 next year. I hope you are already prepared with what I want. You’ve only been out for a while, and you’re starting to get cocky. Be careful I can send you back at any time. 2017/02/17 10:05]\n17:00 The museum closed. At 10:00, I saw that troublesome beautiful woman again, sneaky, and used her being in the museum as an excuse to take her back to the security room. I poured her a glass of water and began to question her. But after five minutes in the security room, she left.\n18:00 I took my phone, keys, and a dagger from the exhibition hall to Third Uncle’s room and found the door open, with signs of forced entry. I didn’t know who did it. I fixed the lock to avoid raising Third Uncle's suspicions when he returned, then locked the door behind me. In front of his sofa was a long wooden cabinet. I lifted the curtain and opened it, discovering some antiques inside that could hide a person. I hid inside and unknowingly fell asleep.\n[The antiques in the long wooden cabinet were moved to the sides of the cabinet.]\n[Information Zhen: I'm back, where are you? If you don’t tell me the specific location of the main tomb, I will seal you back and let you sleep for another thousand years. 2017/02/17 18:30]\n18:45, I woke up and seeing no movement outside, crawled out of the cabinet, only to find Third Uncle passed out on the sofa. What a good opportunity! I locked the door behind me, dragged Third Uncle to the bathroom, made him kneel by the bathtub, placed his left hand in the tub, and used the dagger to cut his wrist, letting his blood flow into the tub. Then, I pulled out the bathtub's drain plug, allowing him to bleed out, and placed the dagger in his right hand to make it look like a suicide. Finally, I washed my hands clean at the sink.\n19:00 Seeing his blood had flowed enough, I prepared to leave. But at 19:05, someone twisted the doorknob, scaring me to hide for ten minutes; at 19:15, just as I was about to leave, someone twisted the doorknob again! I decided to wait and observe; once they left, I would go out.\nClose to 19:30, I heard commotion outside, as if someone was about to come in. I quickly thought of knocking myself out with an ashtray. I didn’t get knocked out but pretended to be unconscious on the ground.\n[At the entrance of Director Zhen’s room, there is an ashtray on the ground.]",
        "Relationship": "Victim:\nDirector Zhen (Male, 40 years old) [Deceased] The director of the museum, the one who lifted my seal, greedy.\nOther Suspects:\nSuspect: Curio He, Male, a regular at the museum.\nSuspect: Manager Sa, Male, the newly arrived guide at the beginning of 2017.\nSuspect: Mystery Ou, Female, a beautiful woman visiting the museum.\nSuspect: Uncle Bai, Male, a regular at the museum.",
        "Performance": "I am Security Wei, the guard of this museum. After closing today, I patrolled around and found the door to Zhen’s room was not closed, and the lock had been broken, so I fixed it. Later, I wanted to check if anything was missing, but once I entered, I was knocked out and woke up to find you all here.",
        "Purpose": "1. Find out the truth, 2. Avoid being labeled as the murderer.",
        "Ability": ""
    }
}
  
