{
    "Mu Bai": [
      "This notebook is fragmented and missing many parts. Many pages have been torn out, and numerous parts that seem to be names have been scratched out, as if scraped countless times by sharp nails, rendering them unreadable. Below is the content of the notebook, with 'XX' indicating unclear areas:\nOctober 1, Sunny\nToday is National Day, a great holiday, and I've decided to start writing a diary to document my life at Truth High School. Tomorrow, XX has invited me and XX to go out together, which makes me feel a bit uneasy. I've been in Class 3, Grade 2 for a month now, and when it comes to friends, it's just the two of them and XX. Although I feel a bit sorry for the two of them, I actually want to hang out with XX more, maybe we would have more topics in common.\nOctober 2, Sunny\nToday is the second day of National Day, and XX invited me and XX to go shopping together. We also took a group photo, and XX joked that it could be our 'girlfriends' photo,' which made me feel a bit uncomfortable.\nOctober 4, Cloudy\nYesterday at the library, I read a book called 'Seven Nights,' a horror story about reincarnation. The concept was fresh, but that’s about it. I’m not particularly interested in horror novels, so I stopped after reading the beginning. Next time, I’ll find a more interesting book.\nOctober 5, Rainy\nToday, I received the two photos we took. I don’t think they turned out very well, but since they are memories of friendship, it doesn’t matter if they look good or not.\nOctober 6, Cloudy\nToday, I watched a horror movie called 'Pen Fairy.' The content was poorly made, relying on loud sound effects to scare the audience, and the ending revealed that the main character was hallucinating. Chinese horror movies are indeed not worth any expectations. I probably won’t watch any Chinese horror movies again.\nOctober 7, Cloudy\nThe school is arranging physical exams next week. Hmm, it seems I should pretend to be sick and take a few days off.\nDecember 1, Sunny\nDamn it, who spread this thing around the entire class? I have to find out!",
      "You (Mu Bai) approach closer and suddenly notice that there seems to be a red character at the edge of the bloodstain on the ground: 'Bai.' It seems the writer has met with misfortune."
    ],
    "Fuqing Huang": [
      "You (Fuqing Huang) take out a memo from your pocket, carefully discerning the words that have been smeared by various lines. Eventually, you make out the outline of one character, which is the first word of this sentence: 'Jiang!'",
      "You (Fuqing Huang) press the play button on the voice recorder. The recorder emits a chaotic noise, and due to the overwhelming static and low volume, you can barely hear anything. Among the sounds, you hear several people screaming, both male and female. At the end of the recording, you clearly hear a woman's terrified voice exclaiming: 'I know it! There's one more! One more!!!' followed by the sound of bones breaking, and then the recording ends."
    ],
    "Xuanxuan Li": [
      "Next to the computer desk is a framed photo, in which you (Xuanxuan Li) and [Yuqing Xie] are in the picture. The photo was taken during National Day, with you on the right and [Yuqing Xie] on the left. Strangely, there is a large empty space between you and [Yuqing Xie].",
      "The first time I saw it, I felt it was very special, like a treasure that drew my gaze. I began to collect information about it by any means possible, following its trail like a stalker. I carefully preserved everything it had used. Its existence brought me more joy than any toy I’ve ever had, until one day I accidentally discovered its secret. Even now, I can still feel the thrill and ecstasy of that moment, the supreme pleasure. I became obsessed with it and wanted to possess it, to make it mine. But it rejected me. It dared to reject me! Damn it, it clearly doesn’t understand me. I always get what I want. So, I revealed its secret to XX, knowing that mouth would spread it to everyone. That way, it would have no choice but to comply. We agreed to meet on the rooftop that evening, but I miscalculated. It actually wanted to drag me down with it! Damn it, it went crazy and wanted to expose my secret too. That would only lead to mutual destruction, which would benefit neither of us. I had no choice but to stall it, preventing any rash actions for the moment. I would figure out how to shut it up later. But then something completely unexpected happened—it jumped from the rooftop!!! It actually committed suicide over this! I’m going mad. I can’t forget that scene, even now. As soon as I left the building, it fell right in front of me! What’s even more terrifying is that its body disappeared, vanishing right before my eyes! How could that happen? Even stranger, no one in the class seems to remember its existence anymore. What is going on? No one remembers it, not even me. I’m slowly starting to forget its face… its voice… its name… No! I must remember it. I cannot forget. This memory is my treasure. I absolutely cannot forget! I must remember its face, its name… Wait… What did it look like again? No, no, think! What… what was its name again?",
      "You (Xuanxuan Li) notice that the pale hand seems to be holding a torn piece of paper. Suppressing your fear, you take out the fragment. On it, there are three words: 'Does not exist.'"
    ],
    "Siqi Lv": [
      "You (Siqi Lv) approach Teacher Li’s desk and casually rummage through it. Opening the first drawer, you find only some miscellaneous items. At the bottom, however, you notice an envelope. Curiously, you take it out. The envelope has 'To--Yuqing Xie' neatly written on it. Opening the envelope, you find a letter, filling the entire page with words expressing admiration for [Yuqing Xie]. The signature is [Mu Bai], and the date is December 8, 2018.",
      "You (Siqi Lv) look down and find two notes in the desk. You carefully unfold them:\nNote 1: 'Tomboy, so disgusting.'\nNote 2: 'Class 3, Grade 2 doesn’t welcome you.'"
    ],
    "Yuqing Xie": [
        "When you (Yuqing Xie) open the compartment of your backpack, the novel you usually like to read is not inside. Instead, there is an unsigned diary. This diary isn’t yours, so who could have put it in the compartment where you usually keep your novel? With some curiosity, you open the diary.\nDecember 6th\nI am Yuqing Xie, and this is my diary, recording the events happening around me. If you, too, are Yuqing Xie and are reading this diary, then my guess is correct—I may be trapped in a very terrifying event. I sincerely hope this diary doesn’t have another page. If it does, things might be heading in a bad direction.\nDecember 9th\nI am Yuqing Xie. Today, something terrifying happened: I saw this diary and the December 6th entry. The handwriting is exactly the same as mine, and it was placed in the secret compartment of my backpack that only I know about. But I have no memory of any of this. It’s like my memory has been tampered with.\nDecember 10th\nI am Yuqing Xie. Alright, it seems my memory loss is real. I don’t remember writing those two diary entries, but what does this mean? Did I forget something important? I really need to ask the me from December 6th if I discovered something that made me write that diary entry.\nDecember 18th\nI am Yuqing Xie! I finally know what I forgot! What I forgot is… the number of students in Class 3, Grade 2! I’m so scared, really scared right now. There are 34 students in the class, but originally, there were 40! I asked everyone in the class, but no one remembers XX and XX, even though we talked with them just yesterday! And I have a terrible feeling that I’ll soon forget their names too. Yes, I’m no exception; it’s just that I’m ‘forgetting’ a little slower than the others, which is why I noticed all of this! The classroom feels dead, like a graveyard, and I feel like a living person with only one breath left before being buried in the grave.\nDecember 27th\nI am Yuqing Xie, and I’m about to break down. There are now 30 people in the class; 4 more have disappeared. I read the diary entry I wrote on the 18th, and the names I wrote there are gone. It seems that not only are people disappearing, but all memories and evidence of their existence, including their names, are being erased too. It’s like they never existed in this world! I’m terrified beyond words now, afraid that soon it will be my turn. Yes, I can feel it—it’s only a matter of time. My hand is trembling uncontrollably as I write this. Maybe I should start thinking about how to avoid coming to school.\nJanuary 4th\nI am Yuqing Xie. I can feel it—it’s almost my turn. Today, there are only 25 people left in the class. 15 people have disappeared just like that. I must save myself. This diary is my only hope. I bought two voice recorders, one I keep in a small pocket in my clothes, and the other I left in the classroom. These should help me understand what’s happening to me and what’s going on in the classroom.\nJanuary 13th\nI am Yuqing Xie. What should I do? My voice recorder is missing! Where did it go? Although one recorder is gone, there’s still the one in the classroom. You’ll never believe what I heard on it. I heard so many terrifying sounds—screams, wails, shrieks, and horrible cries. I also heard someone whispering in my ear: 'Die, just die already, hurry up and die...' I’m on the verge of going insane.\nFebruary 19th\nI am Yuqing Xie. I didn’t expect to see this diary again right after winter break ended. If I could, I really wouldn’t want to know all this. Well, I’m back in the classroom now. Let me see how many people are left. Now there are… 20 people left...",
        "You (Yuqing Xie) just stepped into a bathroom stall and locked the door when you overhear two girls talking: 'Did you know? Xuanxuan Li and Teacher Li are actually not normal.' 'What do you mean not normal? Aren’t they father and daughter?' 'It’s not that simple. They are father and daughter, but their relationship is not an ordinary father-daughter relationship.' 'Eww, are you serious? That’s disgusting.' 'I heard it from someone else. Supposedly, someone in the neighboring class saw Xuanxuan Li sneakily kiss Teacher Li during a nap break. Would any normal father-daughter relationship do that? Gross.'"
    ],
    "Qingfeng Yao": [
        "While waiting, you (Qingfeng Yao) notice a small hole in the partition of the stall, through which you can see the fifth stall.",
        "Curiously, you (Qingfeng Yao) open the audio file on your phone: 'Hello! I need to report a murder! I saw it!' 'Please state your name and current location.' 'Truth High School! At Truth High School! My name is [Qingfeng Yao], and I’m in the dormitory right now! My three roommates and I all saw it—someone was pushed off the rooftop of the building opposite!' 'Alright, please stay in your room, lock the doors and windows, and wait for our officers to arrive.'",
        "You (Qingfeng Yao) are the heir of a family of feng shui masters. Your grandfather is a well-known feng shui expert who has built a vast fortune in the city through his skill in geomancy. When you were young, you took pride in this and often boasted about it to your classmates, which earned you scolding from teachers and ridicule from peers, though you didn’t care. As you grew older, you came to revere your grandfather’s knowledge more deeply. The more you learned, the more unfathomable you found your grandfather to be. He once told you that real ghosts are rare in this world, and most can’t harm the living, except in the case of a curse. A curse is born from someone’s intense resentment at the moment of death, and it can target a person, a place, or a time. The forms a curse can take are diverse, and once cursed, people’s inner obsessions or dark sides can manifest as terrifying vengeful spirits out for blood. These spirits are reflections of the person’s inner demons, and only by confronting and defeating these demons can they be vanquished. The power of the 'Spirit Jade' can purify vengeful spirits formed from inner demons, but only by exposing one's inner darkness to the light."
    ],
    "Lenxing Ye": [
        "As you are about to put your book away, a photograph falls out from between the pages. It’s a picture of you, but something feels off—the position where you are standing in the photo seems slightly to the left.",
        "You pick up the notebook beside your bed. The blue cover reads 'Wenling Jiang.' You open the notebook, but many pages are missing, and the parts that seem to contain names are scratched out as if by fingernails, making them impossible to read. Below is the content of the notebook, with 'XX' indicating unreadable parts:\nOctober 1, Sunny\nToday is National Day. Tomorrow, I have plans with XX and XX, and I’m really happy about it. They are my best friends—no, no, I should say they are my closest friends. Although I also get along well with A, playing with boys still feels a bit strange to me.\nOctober 2, Sunny\nSo happy. Today was really fun. We even took a 'best friends' photo together. The two of them bought matching four-leaf clover rings as friendship rings, but since there was only one pair left, I didn’t buy one. I felt a bit disappointed, but overall, today was great.\nOctober 3, Cloudy\nToday, I had plans with XX. He wanted to go to the National Library to find a rare book and dragged me along. Fine, I had nothing better to do anyway. But I was curious why he didn’t invite XX or XX. He answered that he doesn’t like chattering girls when he’s reading. It seems like those two got rejected. While I was playing on my phone, XX saw the photo of me, XX, and XX, and insisted we take a picture together too. I had no choice but to agree. This guy is pettier than a girl.\nOctober 4, Cloudy\nYesterday, at the library, I read a book called 'Seven Nights.' The protagonist is trapped in an abandoned town where supernatural events occur every night, and each night, the protagonist is killed by these paranormal events. But at dawn, they come back to life, seemingly stuck in a seven-night curse. To survive, they must break the curse before the seventh night. It’s like they have seven lives. Interesting, but I didn’t get to finish it. If I were writing it, I’d give the protagonist only three lives instead of seven—three deaths in terror before they are finally freed.\nOctober 5, Rainy\nThe two photos from the other day have been printed, and I’ve given one each to XX, XX, and XX. I treasure these photos—they represent my friendships at Truth High School.\nOctober 6, Cloudy\nToday, I watched a domestic horror movie called 'Pen Fairy.' In the movie, people could ask questions of the Pen Fairy, or curse others by writing their names. At least seven people were needed for the ritual. The strangest part was that the Pen Fairy could even curse ghosts, as long as their name was written down. This was probably a case of fighting poison with poison.\nOctober 12, Cloudy\nStrange, really strange. I always feel like there’s an eye watching me. Whose eye is it?\nOctober 13, Sunny\nThat feeling is getting stronger. Someone is watching me. I can’t see them, but I can feel the malice in their gaze.\nNovember 21, Cloudy\nI finally saw that eye, the eye peering through the hole! But how could this be?!!!\nNovember 25, Cloudy\nEveryone is starting to avoid me, their gazes filled with malice. Why? Even those two are looking at me with hatred and contempt. Why? Although XX hasn’t deliberately distanced himself from me, I can feel that his gaze has changed too.\nDecember 2, Fog\nI won’t give in to blackmail! I won’t compromise! Tonight, I’m going to the rooftop as agreed. But I won’t be going alone—I’ve asked XX to come with me. He’s the only one who still considers me a friend. He’ll be hiding nearby, and if that person tries anything, he’ll be able to stop them!"
    ],
    "Someone": [
        "Someone's memory: 'What do you two want to eat today?' 'I want sweet and sour ribs.' 'That’s too sweet. Mom, I want salted egg yolk chicken wings.' 'Alright, I’ll make both.' 'It’s not right to talk about her behind her back like that. Imagine how hurt she’d be if she knew.' 'Haha, stop worrying about others. I know you’re just a pitiful person too.' 'Want to go to the library together?' 'Me? Wouldn’t it be strange if I went with you? Everyone else is going in pairs.' 'Do you want to be my mom or something? Stop trying to steal Dad’s love from me! You disgust me!' 'What are you talking about? Aren’t we friends?' 'Shut up. We’re not friends. If I ever see you alone with Dad again, I’ll kill you!' 'As a teacher, don’t you feel ashamed of yourself?' 'That’s none of your business. Have you made up your mind? Are you going to agree or not?' 'No way. I’ll report you to the school administration tomorrow. People like you don’t deserve to be teachers!'"
    ]
}
  