{
    "Annie": [
      "A globally limited edition lipstick and a top-quality hand cream, both of which are quite expensive.",
      "A large amount of cash, far exceeding typical daily needs."
    ],
    "Windowsill": [
      "The window in the room is unlocked, and this window is somewhat distanced from the windows on both sides. There are two scratches on the metal frame, as if it has been stepped on.",
      "The roof above the windowsill is sloped, and the outer wall is a slightly uneven brick wall. You think it wouldn't be easy to climb."
    ],
    "Nightstand": [
      "A bottle of spilled pills.",
      "This tall wine glass is old Black's favorite style. There's also an empty ashtray next to it. The glass has a faint bitter almond scent, but the wine is not poisonous.",
      "The shape of the pills seems different from what Steve used to take; could it be a new specification?"
    ],
    "First Mate's Diary": [
      "September 8, 1930, rainy. I should have returned sooner; I knew, I knew it would end like this!\nNo, my brother, forgive me...\nWhat surprised me even more was that she left with the child. Although it was expected that she would refuse my support for them, she didn't need to just walk away. The one I love, my child, where should I look for you...",
      "July 6, 1940, cloudy. Although many years have passed, I finally succeeded.\nKaifer! You have received your due punishment! Now, only my sins remain unpaid...\nIf I could have one more chance, to go back to the beginning, I would definitely make a different choice; after all, compared to my brother's life, what is my reputation worth!",
      "March 27, 1960, sunny. I am not a competent father; the more I see him now, the more I feel this.\nIt's clear he has endured much pain, and I have given him nothing but my presence.\nHis current achievements are what he deserves, but if possible, I still hope he can take a different path..."
    ],
    "Sea Chart": [
      "This is an old sea chart framed; judging by the paper's color, it seems to have some age. A small island is marked in red ink on the chart.",
      "The sea chart seems to have been moved; after removing the frame, there is a safe behind it. The safe's door is open, revealing a series of reports on the financial situation of the Lauren shipyard at that time, with stock prices plummeting.",
      "A paternity test report states that the likelihood of Steve Black and Tot Blount being father and son is 99.99%."
    ],
    "Jack": [
      "A pocket watch, the hands have stopped, but it seems to have been frequently handled; the copper casing is shiny from being touched.",
      "A photograph of two people together. On the back, it reads, 'Dear Black, our friendship lasts forever!' Signed 'Your Captain,' dated August 13, 1929."
    ],
    "Jessipa": [
      "A shopping list filled with outdoor climbing gear and survival tools.",
      "A box of cold medicine, with 2 pills remaining, looks similar to the scattered medications in Steve's bedroom."
    ],
    "Sam": [
      "A passport belonging to Sam.",
      "Two tickets for a flight tomorrow morning, with the names Sam and Annie on the boarding passes."
    ],
    "Body": [
      "The deceased is slumped against the bed, staring wide-eyed at a sea chart on the wall, with a dislocated jaw and an expression of great pain. The left thumb is bent, while the other four fingers are straight.",
      "There seem to be signs of struggle before death, with slight bruising on the wrists.",
      "There is a broken needle embedded in the skin of the deceased's neck."
    ],
    "Little Black": [
      "A business card from a private detective agency.",
      "A dozen financial statements, many annotated in red pencil, with amounts seeming questionable. All the handlers are Jessipa.",
      "A used syringe."
    ],
    "John": [
      "A life insurance policy with a coverage amount of 20 million USD, with Jack as the beneficiary. The insurance contract clearly states that if the policyholder is missing for more than three years, the beneficiary can also claim the insurance money.",
      "A receipt showing 'One Margarita - Cowboy Bar'; you know Cowboy is a very famous gay bar in the area."
    ]
  }
  