{
    "Stage 1": {
        "Annie": {
            "Story": "You are Annie, 25 years old. Your parents were both employees at Lauren Shipyard. The three-person household, while not particularly wealthy, lived a simple and happy life. However, the company's performance unexpectedly declined, ultimately leading to its closure one day, leaving your parents unemployed. Your mother fell ill from this sudden blow, leaving your father struggling to support the family's expenses. As your mother's condition worsened, your father's income was no longer sufficient to cover the household costs. After exhausting the family's savings, he had to sell blood to make ends meet. After a while, your father finally died from illness after selling blood. The burden of life suddenly fell on your young shoulders; you had to drop out of school to work and borrow a high-interest loan to pay for your mother's treatment. This nightmare began. Soon, the pressure of repayments became unbearable, and facing the increasingly aggressive debt collectors, you thought of the last resort—selling your body. However, this plan was unexpectedly interrupted. One day, the local gang leader, Jack, approached you, claiming he could help you pay off all your debts and even pay for your mother's medical treatment, but the price was that you had to marry him as his nominal wife. This was extremely tempting for you, who was at a dead end. Without thinking, you agreed to this request. Thus, you freed yourself from heavy debts, your mother was admitted to the best hospital, and you became a prominent 'gang lady.' You thought life would go on like this, but it seemed that life never gave up its malice toward you. As a homosexual, Jack had little affection for you; he often beat you and was not as good to you as you had imagined. If you could endure all this, your mother's sudden death felt like a thunderbolt. Due to a doctor's negligence and abandonment of duty, your mother ultimately died in the hospital. Although Jack helped you hold the hospital accountable, they compensated him with a large sum, and he only offered you a few comforting words before abandoning the matter. You became melancholic, often visiting various night venues, drinking and having fun, trying to forget the pains of life. In a bar, you met the playboy, Sam. At first, you got along well; Sam's charm left you dizzy, and you seemed to captivate him as well. You quickly began an affair. Just when you thought you had finally found some solace, you unexpectedly discovered that Sam was the doctor who had caused your mother's death. Your love quickly turned to hate, and all the sweetness transformed into endless anger as you plotted revenge against Sam. Meanwhile, through accompanying Jack to various social events, you met Little Black. You discovered that your parents' former employer, Lauren, was currently serving as the butler for Little Black's father, Old Black. You couldn't help but sigh at the unfairness of fate, but you accidentally overheard a conversation between Lauren and her daughter, Jessipa, learning that Old Black was the culprit who caused the downfall of Lauren Shipyard, displacing your family! You laughed; fate had finally given you a superb opportunity. Old Black was currently undergoing psychological treatment, and his personal psychologist was Sam! A plan that killed two birds with one stone quickly formed in your mind. You claimed to be deeply in love with Sam, begging him to take you away, and he eagerly agreed. However, as your last wish, you hoped Sam could help you kill Old Black. It was clear that Sam had significant psychological struggles over this matter, but in the end, he agreed...",
            "Script": "Tonight, you followed Jack to Little Black's mansion for dinner, pretending to be an oblivious 'decorative' wife, as usual. Coincidentally, Sam was there today for Old Black's regular check-up.",
            "Relationship": "Little Black is your husband's business partner; his company relies on the gang's illegal activities. You don't have much interaction with him, but it seems he doesn't have a good relationship with his father. Sam is Old Black's personal psychologist, your lover, and the murderer of your mother. He was once a playboy, but he seems to have changed a lot for you. He agreed to kill for you, and tonight might be his masterpiece. Jack is your husband, but he is actually a homosexual, so your marriage is merely formal. Although he often abuses you, making you dislike him, he paid off your debts, so your feelings toward him are mixed. John is Little Black's bodyguard; you have only seen him a few times. Jessipa seems to be Kaifer Lauren's daughter, but you don't know much else.",
            "Performance": "You must publicly: 1. Know Kaifer Lauren and that your parents once worked at his company. Life became very difficult after the company closed. 2. Claim your mother died due to a doctor's negligence. 3. Reveal that your relationship with Jack is not good; he occasionally abuses you.",
            "Purpose": "1. Ensure no one discovers your connection to Old Black's death. 2. Successfully make more than two people suspect Sam of murder.",
            "Ability": "Your belongings: 1. A luxury brand lipstick and a hand cream, both limited edition. (Do you need to explain why a lady's bag contains lipstick and hand cream?) 2. A large amount of cash. (You have deeply understood the pain of being broke since childhood, so you always carry a large sum of cash; it's your source of security.)"
        },
        "Jack": { 
            "Story": "You are Jack, 30 years old. Since you have memory, you have always lived with your mother. Your father's only belongings are a pocket watch and an old photograph. Your mother told you that your father was a captain of a merchant ship and died in an accident at sea. Your mother often sighed over the photo of your father and his first mate, but oddly, even when you occasionally asked about them, she never told you your father's or his crew's names. After several inquiries, you learned to remain silent about it. The life of an orphaned child and a single mother was undeniably difficult; you grew up under the discrimination of those around you, and people mocked you as the 'fatherless child.' Your mother could only comfort your wounded heart with words. You became worldly and understood that in this world, only those with power can speak; you longed for money, power, and a beautiful material life, and worked hard for it in silence. The burden of the family aged your mother quickly, and she passed away when you were still young. With no support and no higher education, it was hard for you to find a good job in society. After some time, you almost inevitably joined the local gang, living a life on the edge. Honestly, you were inconspicuous at first, but your shrewd social skills, bold personality, and the mysterious financial support you received intermittently quickly helped you build extensive connections within the gang and rise through the ranks. Finally, after years of effort and groundwork, following the death of the previous gang leader, you became the rightful heir. As the gang leader, you no longer had to carry out those dirty and dangerous tasks yourself, and the mysterious financial support also vanished, as if it were a divine intervention to help you through the darkest times. All your energy was devoted to negotiating with various upper-class people and managing the gang. You became well-dressed and lived a prosperous life—because you were the 'Underground King' of the city, you seemed to have obtained the life you dreamed of as a child. However, you have a troubling secret: you gradually discovered that you are gay. If your subordinates found out, your position would likely be at risk; after all, which gang would accept a gay leader? You began to look for a formal wife to cover your true orientation. Your gang engaged in high-interest loans, and among the debtors, you quickly identified Annie, a young and beautiful woman whose father had died and whose mother was gravely ill, leaving her with insurmountable debt. You timely appeared before her, promising to clear all her debts and arrange for her mother to enter the best hospital, with the price being that she would become your wife. Annie seemed to have no reason to refuse this arrangement. After the marriage, you provided her with a good material life while also being upfront with her that your marriage was merely a formality, asking her not to interfere with your private life. Of course, you would not concern yourself with hers either. However, she remained the gang's wife in name, and if she dared to reveal your secret or had an affair that got out, you would not let her off easily. Thus, you both lived almost completely separate lives, aside from occasionally bringing her to formal events or venting your frustrations on her. When her mother died due to a doctor's negligence in the hospital, you merely accepted a large sum in compensation from the hospital and told Annie not to pursue the matter any further. Despite the formal marriage, you could only satisfy your sexual preferences in private. You often visited a local gay gathering place—a bar called Cowboy. One time, you met a 'familiar' face at the bar, John, a bodyguard for your business partner, the well-known local businessman Little Black. You had some business dealings with Little Black and had seen John around him; you struck up a conversation and quickly discovered mutual feelings, developing into secret lovers. Consequently, you often visited Little Black's estate, ostensibly to investigate whether his father had any illegitimate children, a common concern among wealthy families, while your true aim was to see John. These ordinary visits unexpectedly yielded results; on one occasion, you stumbled upon a photograph of him with your father in Little Black's father's room. After careful inquiry, you learned that Old Black had once been a crew member on your father's ship. You quickly arranged for John to secretly gather related information, uncovering that Old Black had long felt regret and guilt for betraying and causing the death of his good friend, with his steward Lauren, who was the ship's first mate at that time, playing a significant role in the incident. As the clues accumulated, you became convinced that your father's death was not simply an accident at sea but a deliberate act of murder by his crew. Meanwhile, John informed you that he planned to resign as Little Black's bodyguard, so you quickly devised a revenge plan for John to help you take vengeance on the killers of your father, with Old Black being the first target...",
            "Script": "Tonight, you have come to Little Black's mansion again, but in reality, it is to carry out your murder plan.",
            "Relationship": "Little Black is Old Black's son, now inheriting his father's company. You have business dealings with him, having used unscrupulous means to resolve many of his troubles, and his relationship with Old Black seems to be not very good. Annie is your nominal wife; you have little emotional connection with her and no significant interaction in life. In fact, you think she is indifferent to everything, just a foolish ornament. John is your lover, a retired mercenary and Little Black's personal bodyguard. You truly love each other and plan to help him disappear after this affair. Jessipa seems to be the accountant for Little Black's company; John once told you she appears to have some financial issues. Sam is Old Black's psychologist and also the culprit responsible for your mother-in-law's death due to negligence, but that incident is now in the past for you, and you currently have no connection with him.",
            "Performance": "You must publicly state: 1. You believe that those who do bad things will ultimately face retribution, and you are no exception. 2. Your calmness comes from your experience in the gang; such events are common there. 3. If you are suspected, you must disclose that Little Black commissioned you to investigate whether his father has any illegitimate children.",
            "Purpose": "1. Do not let others discover your connection to Old Black's death. 2. Do not let others discover your relationship with John.",
            "Ability": "Your personal belongings: 1. A pocket watch, the hands have stopped but seem to be frequently handled, with a polished copper casing. (Your father's relic.) 2. A photo of two people. On the back, it says, 'Dear Old Black, may our friendship last forever.' Signed by Huck. (This killer who caused your father's death actually kept this photo symbolizing their friendship; he does not deserve it, and you intend to reclaim it.)" 
        },
        "Jessipa": {
            "Story": "You are Jessipa, 27 years old, the daughter of Chief Sailor Lauren. After a terrible shipwreck, your father returned to shore with the first mate and ship's doctor, each using their wealth to start new lives. Your father was once the owner of Lauren Shipyard, and you enjoyed a princess-like life as a child, but soon his business collapsed for various reasons. The first mate, Uncle Black, who you called 'Uncle' since childhood, kindly took your father in and hired him as his butler at a high salary, allowing you to continue your education. The decline of your family made you work hard in school, and your talent in finance helped you graduate with excellent grades from the economics college. During this time, your father trained you in survival skills to cope with his traumatic memories of the shipwreck. You learned not only basic sailor knots but also CPR and IV administration, excelling in physical activities. After graduation, Uncle Black's company was gradually taken over by Little Black, and you became the financial manager. Despite a troubled childhood, your life thereafter seemed blessed by fate. However, one day, this illusion crumbled. Your father angrily revealed that Uncle Black's dirty dealings had caused the collapse of his company. He also shared truths about the shipwreck: your father, Captain Hack Blount, Uncle Black, and the ship's doctor survived on a deserted island, using island materials to build a raft, but it could only carry three people. Uncle Black cruelly knocked out the captain, leaving him behind on the island while the other three escaped. You love your father and are outraged by Uncle Black's betrayal. Thus, a revenge plan began to form between you. During survival training, you became close to your instructor, veteran John, who sought to earn more money. You offered him a profitable side job—pretending to be a bodyguard for Little Black while secretly monitoring him. Meanwhile, you started siphoning money from Little Black's company, believing it rightfully belonged to you. You also followed your father's advice and accepted Little Black's advances, secretly dating him despite his awkwardness with women. Your father hopes you will gradually undermine the financial empire Uncle Black built to avenge past grievances, even to the point of ending Uncle Black's life if the opportunity arises. However, during your plans, you slowly fell in love with Little Black and are now pregnant with his child. Revenge must happen, but what will become of you and your love afterward...? ",
            "Script": "Tonight, you pretend to visit your father, but in fact, you are carrying out your long-planned murder scheme.",
            "Relationship": "Little Black is your boss and childhood friend. You think he is a decent person, although he has connections with the underworld for the company's benefit. He seems to suspect your theft but hasn't stopped you, perhaps due to your affair. He has a troubled past but has since turned over a new leaf. Sam is the ship's doctor and your childhood acquaintance, now Uncle Black's personal psychiatrist. Jack is Little Black's friend from the underworld, whom you dislike, but he's not as unpleasant as you imagined. Annie is Jack's wife, whom you don't know well. John is Little Black's bodyguard, a quiet and reliable veteran; you initially hired him to spy but no longer need him, so you ended his contract and had him resign.",
            "Performance": "You must publicly disclose: 1. Your father's company, Lauren Shipyard, once collapsed. 2. You received training in first aid; John was your instructor. 3. You recommended John as Little Black's bodyguard. 4. The relationship among the three men from your father's generation. 5. If you are suspected, you must reveal that Little Black has killed before, which his father knows.",
            "Purpose": "1. Do not let others discover your method of murder. 2. Do not let others uncover your embezzlement.",
            "Ability": "Your personal items: 1. A shopping list for outdoor climbing gear and survival tools. (Your outdoor survival club has an event next week, and you are preparing to buy the necessary items.) 2. A box of cold medicine with two pills left, similar to the scattered medications in Uncle Black's bedroom. (You have been suffering from a mild cold recently, so you carry cold medicine.)"
        },
        "Sam": {
            "Story": "You are Sam, 29 years old. Your father was a ship's doctor who survived a shipwreck alongside Captain Hack Blount and First Mate Uncle Black. After the incident, your father never went to sea again, opening a clinic that grew into the best private hospital in town. Influenced by his work, you followed in his footsteps, quickly becoming a prominent surgeon despite rumors that your father's position helped you. However, your private life was chaotic due to your father's indulgent upbringing. One fateful night, after sneaking out to meet a woman, you neglected a patient's dosage, resulting in their death. Your father paid to silence the scandal, forcing you to switch to psychology, eventually becoming Uncle Black's private psychologist. One night, while at a bar, you met Annie, the wife of local mob boss Jack, and fell deeply in love. Learning of her abusive marriage, you sought to rescue her. Annie's tragic childhood and her revelation that Uncle Black caused her family's downfall prompted her to ask you to kill him for revenge. Fueled by love, you planned their escape, securing tickets and a date for the act, believing everything was foolproof...",
            "Script": "Tonight, you come to perform a routine check-up on Uncle Black, who suffers from heart disease and depression.",
            "Relationship": "Little Black, Uncle Black's son, inherited his company and has a tumultuous relationship with his father. You were once childhood friends, and you have been investigating Uncle Black for any illegitimate children at Little Black's request, but found nothing. Annie is your lover and mastermind; you love her deeply and believe she loves you back. Jack, her husband and the local mob boss, abuses her, inciting your hatred. Jessipa, the company's financial manager, is a childhood acquaintance and successful woman; you know Little Black likes her. Cohen Parker is a bodyguard for Silent Black, whom you have only met a few times.",
            "Performance": "You must disclose: 1. You were once a surgeon but switched to psychology due to an incident. 2. Your father's relationship with Jessipa and Little Black's fathers. 3. You are aware of the poor relationship between the Black father and son.",
            "Purpose": "1. Do not let others discover your connection to Uncle Black's death. 2. Do not let others find out about your relationship with Annie.",
            "Ability": "Your personal items: 1. Passport. 2. Two tickets for a flight leaving at dawn with names Sam and Annie. (After tonight, you'll take Annie and leave for good.)"
        },
        "Little Black": {
            "Story": "You are Little Black, 30 years old, the sole heir of this estate and the only son of the deceased. Your father was a first mate on a merchant ship who, after surviving a shipwreck, built a successful business onshore. This afforded you a good education and, upon inheriting his company, you expanded it further. However, your youth was marked by impulsiveness and violence, leading to a tragic incident where you killed someone in a bar fight. Though your father helped you cover it up, it taught you a lesson, prompting you to abandon your reckless friends and take over the family business. You grew close to Jessipa, your father's housekeeper's daughter and your company’s accountant, but your relationship remained a secret due to parental opposition. Despite your success in business, your relationship with your father remained strained, especially after he discovered discrepancies in the company’s finances, which you suspected were caused by Jessipa. Fearing that your father might have an illegitimate child, you sought help from Jack, a local mob boss and your ally, to investigate.",
            "Script": "Tonight, you have invited Jack and his wife to your estate for a private dinner.",
            "Relationship": "Jessipa is your company's accountant and your childhood friend. Despite her embezzlement, you protect her. Sam’s father was the ship’s doctor, and now Sam is your father's psychologist, investigating your father's personal matters. Jack is a supportive friend in the criminal underworld. Annie, Jack's wife, seems to have a troubled marriage. John, your bodyguard, is reliable but recently expressed a desire to resign, leaving you puzzled.",
            "Performance": "You must disclose: 1. Sam's past as a playboy. 2. Your troubled youth and your father's influence in steering you straight. 3. Your father's past regrets. 4. The cup in your father's room isn't his, as Jessipa broke it recently.",
            "Purpose": "1. Find out who killed your father, including their methods and motives. 2. Keep Jessipa’s embezzlement a secret.",
            "Ability": "Your personal items: 1. A business card from a private investigator, as your inquiries about the illegitimate child have led nowhere. 2. A set of financial reports marked with red pencil annotations indicating issues, all related to Jessipa. 3. A used syringe whose origin is unknown, as it wasn’t with your belongings this afternoon, raising suspicions."
        },
        "John": {
            "Story": "You are John, 35 years old, a retired mercenary. The thrill of your previous life no longer satisfies you, leading you to return home and become a survival skills instructor. However, the pay is not enough, and you long for a better life. When your former student Jessipa approaches you to be her boss Little Black's personal bodyguard and spy, you eagerly accept. This dual role allows you to earn a significant income while staying discreet. Jessipa tasks you with investigating the connection between a defunct shipyard, Lauren Shipyard, and Little Black's father. Initially puzzled, you discover that Little Black's father established a shell company to undermine Lauren Shipyard, leading to its closure. Realizing Jessipa's ulterior motive—revenge against her father, the former steward—you decide to keep this information to yourself for now. You harbor another secret: you are gay and often visit Cowboy, a local gay bar, for discreet encounters. There, you unexpectedly reunite with Jack, a mob associate of Little Black, and the two of you quickly become lovers. Your life seems to be improving until Jack reveals that Little Black's father killed his own father, and he wants you to kill Little Black in revenge. At the same time, Jessipa informs you she no longer needs you and wants you to resign. You purchase a large life insurance policy with Jack as the sole beneficiary, planning to disappear after the job, allowing Jack to collect the money and start anew.",
            "Script": "Tonight is your last day as Little Black's bodyguard, the day you and Jack agreed to carry out the murder plan.",
            "Relationship": "Little Black is your nominal boss who trusts you deeply and often relies on you for tasks involving the mob. Sam is Little Black's father's personal psychologist, and you know that Little Black wants him to probe into his father's potential illegitimate child. Jack is your lover, a local mob boss, and your love for him drives your actions. Annie is Jack's nominal wife, whom you find distasteful, knowing Jack doesn't love her. Jessipa is your true employer, offering you a salary similar to Little Black’s while you spy on him for her secretive intentions.",
            "Performance": "You must disclose: 1. Jessipa excelled in her studies with you, including survival and combat skills. 2. You have resigned; today is your last day on the job. 3. If suspected, you must reveal that Jessipa instructed you to monitor Little Black.",
            "Purpose": "1. Do not let anyone discover your connection to Old Black's death. 2. Do not let anyone discover Jack's involvement in Old Black's death. 3. Do not let anyone discover your relationship with Jack.",
            "Ability": "Your personal items: 1. A life insurance policy worth $20 million, with Jack as the beneficiary. The contract states that if the policyholder goes missing for three years, the beneficiary can claim the money. (You plan to make yourself 'disappear' after the job, benefiting both you and Jack.) 2. A receipt for 'one margarita - Cowboy bar' from a recent visit, casually kept in your pocket."
        }
    },
    "Stage 2":{
        "Annie": {
            "Story": "",
            "Script": "During the dinner, as everyone takes their seats, you notice Sam's tense expression, which feels unnatural. You sense that something is about to happen, and soon enough, the news of Old Black's death arrives. You momentarily freeze, but then a surge of joy floods your heart—one great revenge has been fulfilled, and now only one purpose remains...",
            "Relationship": "Little Black is your husband's business partner, and his company relies on the mob's illegal activities. You don't interact much with him, but their relationship seems strained. Sam is Old Black's personal psychologist and your lover, who also happens to be the one responsible for your mother's death. He used to be a playboy but has changed significantly for you, promising to commit murder on your behalf; tonight's events may very well be his doing. Jack is your husband, but he is secretly gay, which makes your marriage merely a formality. Despite often abusing you, you have mixed feelings towards him since he paid off your debts. John is Little Black's bodyguard, whom you have only met a few times. Jessipa seems to be the daughter of Keverl Lauren, but you don't know much beyond that.",
            "Performance": "You must disclose: 1. You know Keverl Lauren, and your parents once worked for his company, which fell into hard times after its closure. 2. Your mother died due to a doctor's negligence. 3. Your relationship with Jack is not good; he occasionally physically abuses you.",
            "Purpose": "1. Do not let anyone discover your connection to Old Black's death. 2. Successfully make two or more people suspect Sam of murder.",
            "Ability": "Your personal items: 1. A luxury brand lipstick and hand cream, both global limited editions. (Do you really need to explain why a woman's bag contains lipstick and hand cream?) 2. A large amount of cash. (Having experienced the pain of being broke since childhood, you carry cash for a sense of security.)"
        },
        "Jack": {
            "Story": "",
            "Script": "You instructed John to sneak in through Old Black's bedroom window, incapacitate him, and tie him to the bed, injecting him with an overdose of adrenaline to induce a fatal heart attack. After John completed this, you entered the room, savoring Old Black's struggle while relishing the taste of revenge as you recounted your own identity and experiences. However, you noticed Old Black gesturing towards a painting on the wall. Curious, you removed the painting to find a safe behind it. Following his signals, you opened it to discover many photos of your father and the crew, along with some financial documents you couldn’t decipher. Turning back to question Old Black about this revelation, you found he had already died. Believing he didn't deserve your father's photos, you took all of them, quickly replaced the painting, and left the room. During dinner, the news of Old Black's death spread, and you calmly blended in with the panicking crowd; after all, who would suspect your involvement?",
            "Relationship": "Little Black is Old Black's son, who has inherited his father's company. You have business dealings with him, using unscrupulous methods to handle various troubles, and their relationship seems strained. Annie is your nominal wife; you share no real feelings or life together, finding her to be an uncaring and foolish ornament. John is your lover, a former mercenary and Little Black's bodyguard, and you are genuinely in love, planning to help him disappear after this event. Jessipa appears to be the financial officer for Little Black's company, and John once mentioned she has some financial issues. Sam is Old Black's psychologist and the one responsible for Annie's mother's death due to negligence, but that matter is in the past, and you have no current ties to him.",
            "Performance": "You must disclose: 1. You believe that anyone who commits evil deeds will face retribution, including yourself. 2. Your calmness stems from your experiences in the mob, where such events are common. 3. If you are suspected, you must reveal that Little Black commissioned you to investigate his father's illegitimate child.",
            "Purpose": "1. Do not let anyone discover your connection to Old Black's death. 2. Do not let anyone discover your relationship with John.",
            "Ability": "Your personal items: 1. A pocket watch that has stopped ticking, but seems to have been handled often, with its copper exterior polished bright (a memento from your father). 2. A photo of the two of you, with the inscription on the back: 'Dear Old Black, may our friendship last forever.' Signed by Huck (the one who killed your father; he shouldn’t keep such a symbol of their friendship, and you intend to reclaim that photo)."
        },
        "Jessipa": {
            "Story": "",
            "Script": "Your father once told you that Old Black is a heavy smoker, consuming large amounts of cigarettes daily. So, during your recent visit, you intentionally broke his favorite cup and insisted on buying him a new one. Today, you brought the deadly gift—a poisoned goblet coated with cyanide. You didn't want Old Black to die in front of you, so you applied the poison to the cup's handle. This way, after he drinks, the poison will transfer to the filter tip of his cigarettes, leading to his demise. Tonight, Little Black invited you to his dinner; to avoid suspicion, you reluctantly accepted. As you placed the cup in Old Black's room and filled it with fine wine, a flutter of anxiety crept in. Yet, you tried to suppress your worries, feeling that the time for your reward was finally here...",
            "Relationship": "Little Black is your boss and childhood friend, whom you think is a decent person, despite his ties to the underworld for the company's sake. He seems to have noticed your embezzlement but hasn't stopped you, possibly due to your personal connection, and you have fallen for him. He has a dark past, having killed someone in his youth, which caused arguments with his father, but he has since reformed. Sam is your childhood acquaintance, following in his father's footsteps as Old Black's private psychologist. Jack, a friend of Little Black's in the underworld, is someone you keep at arm's length, but you don't find him as unpleasant as you expected. Annie is Jack's wife, whom you don’t know well. John, Little Black's bodyguard and a reliable ex-soldier, was once your informant, but now you no longer need him and have ended your employment with him, prompting his resignation.",
            "Performance": "You must disclose: 1. Your father's company, Lauren Shipyard, once went bankrupt. 2. You have received first aid training, with John as your mentor. 3. You recommended John to be Little Black's bodyguard. 4. The relationships among the three fathers. 5. If you are suspected, you must reveal that Little Black has killed someone, a fact his father is aware of.",
            "Purpose": "1. Do not let anyone discover your method of murder. 2. Do not let anyone uncover your embezzlement issues.",
            "Ability": "Your personal items: 1. A shopping list detailing outdoor climbing gear and survival tools (you are preparing for an outdoor survival club event next week and need these items). 2. A box of cold medicine, with two pills remaining, resembling the scattered medications in Old Black's bedroom (you've been mildly sick recently, hence the cold medicine)."
        },
        "Sam": {
            "Story": "",
            "Script": "As usual, you prepared some antidepressants for him and replaced his heart medication with ineffective vitamins. This way, when he has a heart attack, he will die without proper treatment, making it seem like you had nothing to do with it. You were invited to Little Black's dinner party for his father, Old Black, where Annie accompanied Jack. Suddenly, news of Old Black's death arrived, which surprised you because, based on your knowledge of his health, he shouldn't have succumbed so quickly. You panicked and thought of ways to cope, while Annie's excited smile hinted at something unusual...",
            "Relationship": "Little Black is Old Black's son and has inherited his father's company. You often saw him in childhood, and although he was a small-time thug in his youth, you had a mutual understanding. However, Old Black had high expectations and their relationship was strained. He asked you to investigate if his father had any illegitimate children, but you have found nothing. Annie is your lover and mastermind; you love her deeply and believe she loves you back. Jack, Annie's husband and the local mafia boss, often abuses her, which fuels your hatred for him. He has business dealings with Little Black. Jessipa is the company's accountant; her father was a sailor on Old Black's ship and is now the butler. You have known her since childhood, and she is a highly accomplished woman, which you know Little Black has always admired. Cohen Parker is Siren Black's bodyguard, whom you have only met a few times.",
            "Performance": "You must disclose: 1. You used to be a surgeon before becoming a psychiatrist due to an accident. 2. The relationship between your father and Jessipa's and Little Black's fathers. 3. You know that the Black father and son had a poor relationship and often argued.",
            "Purpose": "1. Do not let anyone discover your connection to Old Black's death. 2. Do not let anyone uncover your relationship with Annie.",
            "Ability": "Your personal items: 1. A passport. 2. Two tickets for a flight departing early tomorrow morning, with boarding passes under the names Sam and Annie. (After tonight's events, you will leave with Yeda on the early flight, disappearing from this place.)"
        },
        "Little Black": {
            "Story": "",
            "Script": "Since you and Jack needed to discuss some 'sensitive matters' before dinner (your dealings with the gang and investigating the illegitimate child), you minimized the number of servants in the mansion. That day, your accountant Jessipa came to visit her father, the old butler of the estate, while your father's personal doctor, Sam, also arrived for his regular check-up. Having grown up with both of them, you invited them to dinner. You thought it would be just another ordinary evening, but your father suddenly died in his room. Remembering the questionable financial reports you received that day in your briefcase, you rushed to check it. Everything in the bag was intact, but there was an unexpected used syringe. The whole afternoon, apart from talking to Jack, you rested in your room. Your father's death has nothing to do with you, but your strained relationship with him is not a secret. Although you stand to gain significantly from his death, you must be careful not to be mistaken for the murderer.",
            "Relationship": "Jessipa is your company's accountant, and her father, Caifer Lauren, is the old butler of your family—formerly your father's chief sailor. You grew up together, but your feelings for each other have remained hidden due to your fathers' opposition. Despite her embezzlement from your company, you have been covering for her. Sam's father was the ship's doctor, so you have known him since childhood. Following his father's path, he became a physician and is now your father's private psychiatrist due to your father's depression. You asked him to investigate some information about illegitimate children. Jack, whom you met through gang dealings, is a like-minded friend, which has helped you navigate corporate troubles with less hassle. Annie is Jack's wife; you don't know her well, but their relationship seems strained. John is your bodyguard, a retired veteran you hired on Jessipa's recommendation. He is reliable and disciplined, but his sudden resignation has left you puzzled.",
            "Performance": "You must disclose: 1. Sam used to be a playboy. 2. You had a bad character in your youth, and it was your father who set you straight. 3. Your father often told you about a 'regrettable thing he did when he was young.' 4. The cup currently in your father's room is not his own; Jessipa broke his cup a few days ago.",
            "Purpose": "1. Find the murderer of your father and uncover their methods and motives. 2. Do not let anyone discover Jessipa's embezzlement.",
            "Ability": "Your personal items: 1. A business card from a private detective agency. (You want to hire a private investigator for the illegitimate child issue, as there have been no updates.) 2. A stack of financial reports with many red pencil annotations indicating suspicious amounts, all handled by Jessipa. (You just received the new quarterly financial reports, and there are still issues with Jessipa's accounts. Under pressure from your father, you want to talk to her tonight.) 3. A used syringe. (You have no idea where this syringe came from; you didn't have your briefcase with you this afternoon, so you don't know if someone tampered with it.)"
        },
        "John": {
            "Story": "",
            "Script": "In the afternoon, after Dr. Sam finished his routine check-up on Old Black, you slipped in through the window from the roof into Old Black's room. Swiftly, you subdued him and dislocated his jaw, then injected him with an overdose of adrenaline prepared by Jack, knowing he had heart disease. As you broke a flower pot on the balcony while entering, you hastily cleaned up and threw the remnants over the balcony before climbing back to the roof and leaving in a hurry. Later, you placed the used syringe in Little Black's briefcase, intending to frame him. When the news of Old Black's death broke during dinner, you feigned calmness, silently praying that this would be your last time taking someone's life...",
            "Relationship": "Little Black is your nominal boss, and he treats you well. He trusts you immensely and often assigns you tasks involving the gang. You know he has private dealings with Jack's gang. Sam is Old Black's personal psychiatrist, and you're aware that Little Black has tasked him with investigating Old Black's illegitimate child while trying to shift Old Black's attitude towards him through psychological suggestion. Jack is your lover, the head of the local gang, and you are deeply in love, which drives you to seek revenge on his behalf. Annie is Jack's nominal wife; you know he doesn't love her. Although she is a pitiable figure, you can't help but dislike her. Jessipa is your true employer; she pays you nearly the same as Little Black, and you monitor Little Black's movements for her. What is her hidden agenda?",
            "Performance": "You must disclose: 1. Jessipa excelled in her studies under you, including survival and combat skills. 2. You have resigned, and today is your last day on the job. 3. If you are suspected, you must reveal that Jessipa instructed you to monitor and investigate Little Black.",
            "Purpose": "1. Do not let anyone discover your connection to Old Black's death. 2. Do not let anyone uncover Jack's connection to Old Black's death. 3. Do not let anyone discover your relationship with Jack.",
            "Ability": "Your personal items: 1. An accidental death insurance policy worth $20 million, with Jack as the beneficiary. The policy clearly states that if the insured disappears for more than three years, the beneficiary can still claim the insurance money. (Once this task is completed, you plan to 'disappear' from the world, which would be beneficial for both you and Jack. If you can obtain a sum of money from this, that would be even better.) 2. A receipt for a drink at Margaret's—'Cowboy Bar.' (Cowboy is a famous local gay bar. This is a receipt from your recent visit, which you casually slipped into your pocket.)"
        }
    }
}
  