{
	"李天船的酒店套房": [
		"李天船的酒店套房很符合他的身份，那是整个酒店最大，风景最好的套房。你一边感叹世事难料一边走了进去。套房的正中央放了一张豪华大床，床上的被褥都很整齐，看起来应该没有人睡过。\n你拉开窗帘让光线照进来，开始调查。窗边的小茶几上放着两杯红酒，应该是昨天李天船和王纱两人在那边品酒聊天吧，还挺有情调的。你走到衣柜旁边打开柜门，调查里面的东西。几件男士的衣服叠放在架子上——你一眼就认出来那是李天船的，衣架上挂着几件女士的洋装。衣柜的一角放着两个旅行箱，黑色的那个你知道是李天船的，那么粉红色的那个应该就是王纱的了。看来昨晚王纱走的很匆忙或很突然，连行李都来不及带上。\n你走到床边调查床头柜的抽屉。第一个抽屉里有一本酒店的宣传杂志，其它抽屉里什么都没有。床头柜上面放了一部电话，听简的线纠缠在一起，看来它被使用的频率很高。你很好奇李天船或者王纱之前都用这部电话打给了谁，也许你能拿到酒店套房的通话记录，从那里找到答案。\n一本酒店的留言簿放在电话旁边，面上的一张纸被撕掉了，下面都是空白的。你仔细地在附近找了找，但没能找到撕下来的那张纸，看来是有人拿走了。你很沮丧的坐到床上，拿起留言簿无意识的把玩。突然，留言簿上酒店附送的铅笔掉了出来。捡铅笔的时候一道灵感击中了你的脑袋，貌似很多侦探题材的电影里有过这样的桥段:用一支铅笔涂满写字那张纸下面的一张纸，凭借显露出来的压痕，就能得知上面一张纸上写了什么内容。你兴奋地用铅笔涂满了整张纸，上面的压痕清晰可见。你没见过这个笔迹，因此这肯定不是李天船写的。上面只有几个字:"
	],
	"酒店夜班保安": [
		"你在酒店的门口找到了负责昨晚夜班的保安。他是个中年大叔，留着络腮胡子，脸色很差，身上的制服有些凌乱，看来他从昨晚到现在都还没休息，真是可怜。\n“你好，能问你几个问题吗?”\n他叹了口气说道:“我刚被警察审问完，大明星竟然在我们酒店里死了，还他妈是在老子值班的时候死的!真是倒霉催的，别烦我，我现在只想静静。”\n“理解理解。刚刚警察也‘狠狠的’盘问了我一番，那滋味的确不好受。”你附和道。“死的是我老板，我们关系很好的。我想弄清楚他是怎么被杀的，拜托你帮帮忙好吗，就几个问题，很快的。”\n“好吧好吧。”他无奈的又叹了口气，点燃一支香烟，狠狠吸了一口之后说道:“问吧，快点。”\n“昨晚你有没有看到什么人。”你问道。\n“有啊，死掉的那个大明星嘛，他昨晚下来了，去了宴会厅。”\n“他有没有跟你说话?”\n“没有。他走的很快，好像有什么急事。”\n“你还有没有看到其他人?”\n“有啊，大明星下来之前有个小伙子出去。嗯……我想想啊，还有，大约两点半左右，和大明星一起来的那个女人也往外走，我还帮她叫了一辆的士。对了，我还看到一个高大的男人。他进来的时候我刚上工不久，应该是12点多。但我没看到他出来。”\n“那就是说那个男人还在酒店里?”\n“不一定呀。也可能他走了但我没看到。值夜班总要‘忙里偷闲’一下吧。”他冲你笑了笑。\n“忙里偷闲?”\n“你懂的啊。夜班通常都没什么事，再说了酒店晚上基本上没人进出，所以我一般会到前台后面的值班室里打个盹。有什么事会有人来叫我的。”\n“你这也太不负责任了吧，后半夜竟然在睡觉?”\n他挥了挥夹着烟的手。“拜托，我们酒店可是有装摄像头的，有人出来或进去都会被拍下来，安全性一流。对了，昨天有人往大明星的房间里打骚扰电话，你听说了吗?”\n“没听说过，怎么回事?”\n“跟大明星一起来的那个女的昨晚向我们反映，说是有人不停的往他们房间里打电话。接听起来马上就挂断，赤裸裸的骚扰。”\n“你们知道是谁干的吗?”\n他随手把抽完的烟头一丢。“我们昨晚一直很忙，还没来得及查。”"
	],
	"黄迪": ["酒店内的费雪酒吧已经打样了，但酒保还在吧台里面收拾东西。你上前询问了一番，得知黄迪是这里的常客，昨天午夜时分他还来酒吧喝了两杯。根据酒保给的地址，你在黄迪家里找到了他。\n他看起来还没睡醒，显然很介意有人打扰到他睡觉，脸色很臭。你向他表达了歉意，并解释了自己的身份和来意。\n“什么?!李天船被杀了?”他一副很吃惊的样子。“啧啧，还真是天理循环，报应不爽啊。”\n“你这话什么意思?”\n“嘿，你为李天船工作，不知道他的为人吗?那家伙不知道干了多少缺德事呢。”他转身走进房间，招手让你进去。\n“你被他害过?”你边走边问到。\n他招呼你坐到沙发上，拿了罐啤酒，在你对面坐下。“那倒没有，但我知道些他干的肮脏勾当。”\n“怎么回事?”\n“啊啊,这可不能说。说了可是会牵连到我的。”\n“黄先生，现在李天船被人杀害了，这可是关系到一条人命的大事啊!你这么隐藏着重要的线索不说会影响警方破案的。还是说你是故意隐瞒，因为你就是凶手!?”\n“开什么玩笑!”黄迪从沙发上跳了起来，一副很愤怒的样子。“好吧，好吧，告诉你就是了，但你一定要保密啊!”\n“你放心，我一向是守口如瓶的。”\n他重新坐下，喝了口啤酒。“是这样的，之前李天船找上我，让我帮他设计一个人，就是那个明星——山峰。而他会给我一笔很丰厚的酬劳。总之事情我做到了，我通过朋友认识了山峰，并且成功的让他吸上了大麻。嘿嘿，我手上的‘东西’可是很优质的，他一下子就上瘾了，根本停不下来。”\n“你们竟然吸毒!”你吃了一惊，不禁提高了声音。\n“嘘，小声点!有什么好大惊小怪的，亏你还在娱乐圈里混。总之就是这样，前段时间我和山峰一起在他家里吸大麻，我通知了李天船，他安排人突然闯进来，拍到了他想要的照片。”\n“额，等等……李天船要那些照片干什么，莫非他想威胁山峰! ?”“看来是的。那个山峰不是最近宣布要退出选角了吗，还闹了个大新闻。”“还有个问题，你昨天到费雪酒店去干什么?”你继续问道。\n“啊，那个啊。我看了山峰的新闻后觉得我的劳动不应该只得到这么点报酬，所以我就管李天船要喽。但谁知道那个混蛋竟然一口回绝了，之后连我的电话都不接。昨天我查到他住在费雪酒店，往他房间里打电话，想要给他下个‘最终通牒’，但电话是个女人接的，说是叫王纱。我想到她是李天船的新欢，于是我临时起意，决定给李天船一个‘小教训’，让他知道我的厉害。”他解释道。\n“你做了什么?”\n“我告诉她有些关于李天船的重要事情需要当面聊。她同意了，于是我约她在酒店的酒吧里见面。之后我马上赶去了酒店，当面把李天船干的那些肮脏勾当都告诉了她，并告诉她李天船就是这么个表里不一，只在乎利益的人，对她肯定是玩玩的心态。她听后脸色铁青，一言不发地走了，估计是去找李天船的麻烦了，哈哈。”他一脸猥琐的笑了。\n“之后你去了哪里?”\n“我?我去了朋友那里开 party。啊，对了，山峰也在，我们一直 high 到今天早上才各自回家。”\n“山峰不知道你陷害了他吗?还跟你混在一起。”你感到很疑惑。\n“他应该不知道我也参与了，他以为都是李天船的阴谋。再说了，他现在哪儿离得开我啊，少了我他根本弄不到那么高质量的‘货’!”"
	],
	"李天船酒店套房的电话记录": [
		"费雪酒店\n客房电话使用详细记录房号508\n分机号码0508\n账单编号38020120141022508账单人李天船\n以下是一个表格：|日期|时间|号码|持续时间|状态|\n|——|——|——|——|——|\n|2014.10.22|15:33|0511|0M0S|呼入|\n|2014.10.22|15:47|0511|0M3S|呼入|\n|2014.10.22|16:07|2276XX88李天船家|5M44S|呼出|\n|2014.10.22|16:15|0511|0M2S|呼入|\n|2014.10.22|16:28|0511|0M0S|呼入|\n|2014.10.22|16:40|0511|0M5S|呼入|\n|2014.10.22|16:41|0000酒店前台|4M23S|呼出|\n|2014.10.22|17:06|0511|0M0S|呼入|\n|2014.10.22|17:12|0507|8M13S|呼入|\n|2014.10.22|17:16|0509|3M7S|呼出|\n|2014.10.22|17:25|0511|0M0S|呼入|\n|2014.10.22|23:34|13922XXXX31黄迪|6M51S|呼入|\n|2014.10.23|00:12|0000酒店前台|2M35S|呼出|"
	],
	"山峰": [
		"你来到山峰家里，他一开门就问到:“你是为了李天船的事来找我的吧?”“你已经知道了!?”\n“别小看我的消息网。”他笑着说道，看起来心情不错。“进来吧。”他把你带到书房坐下。“说吧，你想问我什么?”\n“你到底是为了什么原因退出这次选角的?”你问出心头最大的疑问。\n“你不知道吗?”他显得很惊讶，随后若有所思的点了点头。“也对，这种事越少人知道越好。”\n“什么意思?”他把你说糊涂了。\n“告诉你也无妨，反正李天船都死」。”他特8七一制‘hioh’的照片。选角的。他不知从哪得到了消息，那天找人拍到了我和朋友一起‘high’的照片。\n他就威胁我，如果我不主动弃权的话，他就要把照片提供给媒体。”\n‘high’?莫非是……”\n“没错，就是吸毒。干我们这一行的压力太大了，而且还要随时保持100%的状态，吸点那玩儿意能帮我快速摆脱疲劳和压力。当时我正和朋友在家里吸大麻,突然就有狗仔队闯了进来,拍到了我们的照片。李天船那混蛋消息还蛮灵通的……”他叹了口气，望向窗外。\n你低头沉思，消化他刚刚的那一番话，实在入度。默当中。\n“请问你今天凌晨1:00 到5:30之间都在哪里?”你回过神来，维续问道。“怎么，你怀疑是我杀了李天船?”他扭过头来，回问到。\n“你有很强烈的杀人动机，不是吗?”\n“好吧，我承认我确实很想杀了他。这次主演江导超大制作新戏的机会千载难逢，未来的收益更是无法估量。我失去了这次机会，真的非常可惜……”他深深叹了口气，续道:“但我绝对没有杀他，我有不在场证明。昨晚我们一班朋友一起开party，我12点左右就到了，一直玩到今天早上7点多跟他们一起吃过早餐才回的家。很多人可以帮我作证。”"
	],
	"酒店客户列表": [
		"费雪酒店2014年10月23日中午12:00前结账\n客户入住列表（部分）\n以下是一个表格：|房号|客户姓名|备注|\n|——|——|——|\n|501|Mr.&Mrs.Smith||\n|502|冯旭平||\n|503|——||\n|504|严建国、乐欣夫妇|带小孩|\n|505|——||\n|506|李察德|没有入住|\n|507|韩伟文||\n|508|李天船、王纱||\n|509|沈曼离||\n|510|——||\n|511|梁燕、齐思||"
	],
	"深入调查李天船": [
		"你联络了朋友介绍的私家侦探，请他帮你调查李天船的私人生活。他的效率超出了你的想象，很快就有了结果，约你在一间咖啡厅见面。\n你早到了一点，点了杯咖啡坐在约定的位置等他。不一会儿，一个其貌不扬的中年男人坐到了你的对面。\n“侦探先生?”你不确定的问道。他的样子太普通了，可以说是完全没有特点,把他丢到人堆里你绝对找不出来，与你心目中侦探的形象相去甚远。\n“是的，这是你要的东西。”他递过来一个牛皮袋。\n你打开牛皮袋，开始浏览里面的资料。\n“李天船18岁出道,21岁主演第一部电影开始走红，从此成为国内一线男星。他私生活很复杂，换了不知道多少任女朋友，平均每年两三个，有时还同时周旋在几个女人之间------”\n“这些我都知道,有没有其它更深入的?”你打断他，问道。“当然有，不要质疑我的专业性。你知道他有个私生女吗?”“什么!?私生女?”\n“是的，那女孩应该有5个月大了。”他凑过来把你手中的资料翻到其中一页，那是一份复印的医院出生证明。“呐,齐晓天,5个月大。”\n“你确定是李天船的女儿吗?”\n“百分之百肯定。”\n“女孩的妈妈叫……”你看了眼出生证明上“母亲”一栏的名字。“齐思。有没有调查到她的信息?”\n“还没查到，还需要点时间。”\n你继续翻看资料里的调查内容。“还查到些什么?”\n“哦，对了。李天船除了正常的片酰和代言收入之外还有很多额外收入。”“额外收入?是他的私人投资吗?”你抬头看了他一眼。\n“是的。但他投资的项目我怀疑有点问题,可能不是正当行业。比如这间他开的利源财管投资公司，表面上是一间财务管理和投资咨询的公司，但在财务报表之外却有巨大的现金流量，这点非常可疑。”\n“是有些问题，麻烦你继续调查。”你把看完的资料递给他。“酬劳等全部调查结果出来了再转给你。”\n“没问题,再联系。”"
	],
	"李察德": [
		"据你所知，李察德与他哥哥李天船一起住在城郊的别墅里。别墅是李天船的产业之一。你按了门铃，是他们家的保姆来开的门。你表明来意后，保姆告诉你李察德在二楼他自己的房间里。\n来到二楼,还在走廊上你就能闻到李察德房间里传出来的烟味。你皱着眉头敲了敲门。\n“进来。”房间里传来李察德的声音,略带沙哑。\n你推门走进房间，里面烟雾弥漫，窗户是关着的，李察德正坐在窗边抽烟,他面前的烟灰缸里已经挤满了烟头，看来李天船遇害的消息让他很伤心。\n“李察德,请节哀顺变。相信警方很快就能找出杀害你哥哥的凶手，为他报仇的。”你坐到他对面，打开窗户散一下房间里的烟味。\n他看了你一眼,没有回应,低头猛吸了一口烟，继续吞云吐雾。“你还好吗?”你关心的问道。\n“好。非常好!我‘亲爱”的哥哥被人杀了，你说呢，哈哈。”他冷笑着说道。你一时间不知道该说些什么，于是你开始打量屋子里的摆设。一张摆在柜子上相框里的照片吸引了你的注意。你走过去拿起来仔细看了看，照的是李察德，他一身囚衣,照片应该是他去年坐牢的时候照的。\n“怎么样?拍的很精髓吧?整个—‘监狱风云”的感觉。我很喜欢这张照片，我把它留着,作为一个警示。”李察德在你身后说道。\n你把照片放回原位，回到他对面坐下，问到:“你哥哥那件事确实做的过分了，你恨他吗?”\n“恨?为什么要恨他?那件事的确是我做错了，他只不过是做了一个守法公民该做的事。”他悠悠的答道。你很难分辨他这备回答的真实性。\n“那你昨天怎么没有到酒店一起庆祝?李天船也给你订了房间的。”\n“庆祝他被成功定为男主角吗?那有什么好庆祝的，已经确定的胜利没有庆祝的价值。从小到大，只要是他决定的事情，基本上没有他做不到的。再说了，我跟他不是一类人,我不喜欢跟一堆人挤在一起相互歌功颂德。”\n“看样子你不太想看到他这么成功啊?”\n他明显榜了一下。“怎么可能!我当然希望他越来越成功了，他对我这唯一的弟弟还是很照顾的。最近他还投资了我和强尼的基金会，支持我们的慈善事业。”\n“你昨晚是跟强尼在一起吗?”\n“是的，他过来了一趟。我昨晚邀请他来一起欣赏我收藏的一些黑胶唱片。我们听了唱片，喝了点东西，聊了一会儿天。后来我们吵了一架，他生气了,就走了。“”\n“他什么时候走的?你们为什么吵架?”\n“我想想啊,他大约是凌晨2:30走的，我不大确定，我当时情绪也不好。我们吵架没什么特别的原因，就是情侣之间的争吵，你懂的。现在想想真没那个必要，唉-…--”他叹了口气,低头抽烟。\n“你知不知道谁跟李天船有仇,深到可能会杀他的那种?”\n“哈哈。”他笑了，喷出一口烟。“我没别的意思啊，我们都知道他这么出名，一路走来不知道得罪了多少人。人怕出名猪怕壮，跟他有仇想杀他的人估计能排队排到太平洋去吧。”\n“那王纱呢?李天船最新的女朋友。有没有可能是情杀?”\n“这我可就不知道了。最近我哥经常把王纱带到家里来,我也跟她聊过几次。感觉上她是个好女孩，挺懂事的，不大可能杀人。但谁知道呢?你也知道我哥是出了名的花心大少，女人妒忌起来可是什么事都干的出来的。”他边摇头边说道。\n“你知不知道王纱现在在哪?”你问道。\n“不知道。你去她家找过吗?亲密的人突然死了，一般人都会回家静一下吧。”\n“嗯,有道理。你有没有想到其它什么重要的线索?”他想了一下,问道:“你找过山峰吗?”\n“你怀疑是他干的吗?”“\n“我不确定。有一天晚上，嗯，我想想，应该是他宣布退出选角的同一天，他跑来这里，威胁说要杀了我哥哥。当时他非常生气，说话也很大声，我在很远的地方都能感受到他的怒火。”"
	],
	"周雄": [
		"你在周雄的办公室里见到了他。他很高大，鼓鼓的肌肉撑起了身上的衣服,坐在他的大办公椅上显得很霸气。对于你的到来他看起来一点都不意外，莫非他知道些什么?\n“周先生，请问你昨晚去过什么地方?”你开门见山的问道。“你为什么这么问?”他一副饶有兴趣的样子笑着回问道。\n“明人不说暗话，昨晚你去了费雪酒店，摄像头都拍下来了。你是去见了李天船对吗?”\n“你还真直接啊……”他靠到椅背上，用手支着脑袋思考了一下，接着说道;“是的，我是去见了李天船，我们有些生意上的来往。”\n“你知道李天船被杀了吗?”\n“知道。我感到很遗憾，他是个不错的生意伙伴。”“你们一起做的是什么生意?”\n“这个啊,我们在一些方面上合作,算是上下游企业的关系。”“能说具体些吗?”他的话勾起了你的兴趣。\n他想了想，说道:“具体些告诉你也无妨，我是开赌场的，你知道吧，最赚钱的生意之一。而他负责帮我洗钱,他有个投资公司,叫做‘利源’。”\n“啊……李天船帮你洗钱?”你有点接受不了这个消息。“但李天船不是很讨厌赌博吗，他还做过很多禁赌的宣传。”\n“哈哈，作为一个大明星，人前一套人后一套是基本的素质吧。”他笑着说道。“那你昨晚是去找他谈生意的吗?你们谈了些什么?”\n“昨天是李天船约我过去的，他貌似是刚签了一份大合同，我们在他的套房里一边喝酒庆祝，一边谈事情。他想要投资成为赌场的老板之一，参与到赌场的经营当中。而我不同意，赌场是我一手建立起来的，我不想别人来干涉我的决策。”\n“后来呢?”\n“那个大明星好像从不接受拒绝似的,他坚持要入股,还威胁说不再帮我洗钱,而且要动用他的人脉关系打击赌场的生意。哼，他也不想想我是干什么的，竟敢威胁我!”他咬着牙说道。\n“所以你一气之下就杀了他?对于你来说搞到枪肯定不是难事。”\n“开什么玩笑，我能做到今天的地位就绝对不可能那么冲动，李天船能帮赌场洗钱，是很重要的角色，我可不想他死。我只是‘好好的’跟他分析了一下，如果他想跟我翻脸的话，最后到底是谁更吃亏。结果他气得暴跳如雷，还大声叫嚣着说走着瞧。哈哈，想想他当时的嘴脸我就想笑，明星在生活中也是那么会表演的吗?再说了,我的确是有把枪,但最近借给朋友了,我去酒店的时候身上根本就没有枪。”\n“这样啊…--”你想了想，问道:“能告诉我你到达和离开酒店的时间吗?”“我大约是12点多到的酒店，之后直接去了李天船的套房谈生意。我们大约两点左右谈僵了，我离开了他的套房。之后我决定到酒店里的酒吧坐一下，喝几杯，思考一些事情。我可能在酒吧坐了两个小时吧,我不大记得了,之后我就回赌场了。”"
	],
	"王纱": [
		"你在王纱位于市中心的家里找到了她。她来开门的时候还穿着睡衣，一副刚睡醒的样子。她眼睛是红肿的，黑眼圈很重，看来昨晚哭过，而且没有休息好。看到是你，她口气不善的说道:“是李天船让你来的吧?你回去告诉他，我不会道歉，而且我们已经玩完了,以后别再来找我!”\n“李天船已经死了，你不知道吗?他在酒店里被杀了，今早发现的尸体。”看来她并不知道李天船被杀一事。\n“什么!?天船他被杀了?”她整个人都愣住了。\n她看起来大受打击，你扶着她走进房里，把她安置在沙发上，找到饮水机给她倒了一杯水。“李天船被杀害了我们都很伤心，警方正在调查，相信很快就能找出凶手的。”\n她喝了口水,貌似好了些。“那你来找我是为了什么?”\n“想问你几个问题,希望能协助警方尽快债破这起案件。方便吗?”\n她又喝了口水,定了定神后说道:“嗯,你问吧。”\n“昨天我们都在酒店里庆祝，但今早你已经不在酒店里了，你为什么要提前离开?你是什么时候走的?”\n“我为什么提前离开?因为我跟李天船阚翻了。”她仿佛陷入了沉思。低头望着手里的水杯。过了一会儿，她继续说道:“我看清了李天船的丑恶嘴脸，只想尽快离开有他在的地方，所以我匆匆的走了，当时……嗯……应该是凌晨两点多吧。当我打的回到家的时候快到三点了。具体你可以问下酒店的保安，我走的时候是他帮我叫的出租车。”\n“你们吵架了，怎么回事,酒会上不还好好的吗?是因为黄迪的事情吗?”“你也知道!?”她猛地抬头看着你。“嗯，也对，若要人不知，除非己莫为。黄迪都告诉我了，我本来也不大相信，但事实俱在，我真没想到李天船竟然是那种用阴毒伎俩背后害人的小人。更过分的是他竟然只是在玩弄我的感情!“\n“你跟黄迪见过面了吗?”\n“是的。他昨天晚上往我们酒店房间里打电话找李天船，我刚好接了电话。他跟我说有关于季天船的重要事情要告诉我，于是我们约了在酒店里的酒吧见面。”\n“那时大约是几点?”你打断她问道。\n“晚上11点多吧,当时我们刚结束酒会回到房间不久。后来我快到12点的时候去了酒吧，黄迪已经到了。我们谈了很久，黄迪把他所知道的关于李天船的肮脏事情一五一十的告诉了我，包括他玩弄女人感情的事。我越听越生气。更对李天船感到失望。”她声音越来越小,情绪很低落。\n“后来呢?你去找李天船对质了吗?”\n“是的,后来我打电话问他在哪，他让我在宴会厅等他。见面后我就问他为什么傲那种事，他一开始还不承认，我提到山峰那件事之后他态度就变了，一边哄我一边问我是怎么知道那件事的。他那假惺惺的样子让我一下子就想到了刚刚听说的关于他怎么欺骗女人的事，当时我就对他彻底失望了。”\n“所以你就开枪杀了他?”“\n“什么，开枪杀他!?我才没有，我只是决定给他点教训，而且我根本就没有枪!”\n“那你做了什么?”\n她犹豫了一下，之后像是下定了决心，说道:“好吧，我告诉你，反正我也没做亏心事。我假意跟他和好，并且勾引他，诱骗他自己脱掉衣服坐到椅子上。然后我把全身赤裸的他绑在了椅子上，只给他留了一条‘遮羞布‘。哈哈，他被人发现的时候一定金是头条新闻，大明星全裸出境“﹐多好的标题。之后我就直接回家了。”\n你起身道别，走到门口的时候她的声音从身后传来:“哦，对了，说到枪李天船自己就有一把。不知道他从哪弄来的，放在他的卧室里。现在想想他确实需要一把枪来防身，他得罪了那么多人……-可惜那把枪没能保护他逃过一劫”"
	],
	"李天船的办公室": [
		"你来到了你最熟悉的地方——你们的公司。当你走进李天船办公室的时候你不禁想起了你们一起工作的时光。不可否认，李天船在事业上非常成功，而且最近又签了一个大合约，未来不可限量。事情怎么会变成这样呢?\n你深深吸了一口气，平复了下情绪，走进去并反手关上门，以防有人打扰你的调查。首先映入眼帘的是贴在墙上的一张李天船的巨型海报。作为一个大明星，李天船的形象几乎是完美的，海报上他那经典的微笑不知迷倒了多少女粉丝。\n你坐到他办公桌的后面，开始翻看桌子上的东西。上面放满了粉丝的来信、粉丝送的小礼物、宣传文件、日程表，还有一份他最近接拍的广告片的剧本。放在桌子一角的一个相框吸引了你的注意，上面的照片是李天船和弟弟李察德的合影。照片应该是几年前拍的，上面两个人看起来都很青涩,笑的很开心。看样子他们两兄弟的感情非常好。\n你翻了一下桌子的抽屉，里面都是些杂物，有一张类似账单的东西吸引了你的注意。上面收支的金额非常大，抬头写着利源财管投资公司。时间是2014.7.1-2014.9.30。李天船是在做些投资吗?\n你把账单放回原位，关好桌子的抽屉，起身调查其它地方。旁边的柜子上陈列了他这些年获得的奖杯和一些经典作品。你在柜子下方的储物柜里找到了一个夹层，里面放着一个牛皮袋。李天船把这袋东西放的这么隐蔽，肯定是重要的东西。你重新坐到他办公桌前，在桌子上拆开牛皮袋。里面掉出几张照片，拍的是几个人聚在一起吞云吐雾，其中一个你很熟悉——大明星山峰，之前一直在与李天船竞争江安导演新片《隋唐大运河》的男主角。你再仔细看了看照片，惊讶的发现山峰竟然是在吸大麻!你没想到会在李天船的办公室里找到这么具有爆炸性的东西，看来山峰突然退出男主角竞争一事确实另有蹊跷。\n你继续翻看后面的照片，内容基本都是同一个角度拍的山峰在吸毒，看来拍照的人是连续拍摄的。最后一张照片完全不一样，拍的是个你不认识的年轻漂亮的女人，她怀里抱着个婴儿。婴儿正在吸吮自己的手指，样子可爱极了，那个女人低头看着怀里的婴儿，一脸慈爱的表情，散发着母性的光辉。李天船为什么会收着这么一张照片呢?你把照片翻过来，发现背后写着一段话:“恭喜，是个女孩!她遗传了你的眼睛。吕智”照片是吕智寄给李天船的吗?他有什么用意?"
	],
	"吕智": [
		"你在片场找到了吕智,他一身特警的造型,貌似是在拍一部警匪类型的电视剧。你等到拍摄工作告一段落，导演喊cut休息的时候迅速上前去跟吕智打招呼。看到来的是你，他挑了挑眉毛，问道:“你是为了李天船的事情来找我的吧?”\n你点了点头。\n“到那边聊吧。”他指了指不远处的一个小棚子。“那边没人，说话方便些。”说完,他就转身往那边走了过去，你赶忙跟上。\n“你知道李天船被杀的事了?”一到棚子里，你就迫不及待的发问道。\n“知道啊，我在费雪酒店有熟人，今早他就告诉我了。啧啧，不愧是李天船啊,连死的时候都是一副大明星的派头，佩服。”他笑道。\n“看样子李天船死了你很开心?”\n“别误会，我只是感叹一下。对于他的死我可是感到很遗憾的啊。”他一边把玩着手里的道具枪一边说道。\n你半信半疑的看着他，他灵活的持枪动作让你突然想到了一件事。之前为了拍一部枪战电影，吕智特意去参加了射击俱乐部，后来貌似迷上了这项运动，还在业余比赛上获得过名次。“吕先生，听说你很喜欢射击，还参加了射击俱乐部。你应该拥有枪吧?”\n他停下了手上的动作，直直的看着你。“你在怀疑是我杀了李天船吗?哈，我可以告诉你,我是有枪,就放在我俱乐部的柜子里,但我绝对没有用它杀害李天船!”\n“为什么?你和李天船不是素来不合的吗?而且李天船死了，这次江导新片——《隋唐大运河》的男主角岂不就是你的囊中之物了。”\n“怎么，你不知道吗?”他一副很惊讶的样子。“无论如何我都不可能出演那部新片的。我和江安有很深的过节，他发誓死也不会与我合作，而这次《大运河》的导演已经确定非他不可了…-”他叹了口气,一脸的遗憾。\n“有这样的事?”你将信将疑。“但你确实很讨厌李天船，这点是大家有目共睹的。”\n“这点我不否认，我是很讨厌那个虚伪的家伙，但我绝不会杀他，我希望他能好好活着。”\n“什么意思?“\n“因为--…”他顿住话头。皱了皱眉，而后仿佛下定了决心。“告诉你也无妨,反正李天船都死了，这事迟早会被挖出来的。你知道李天船有个私生女吗?”\n“什么!?”你大吃一惊，事情的发展越来越出乎你的意料了。\n“是的，前一段时间的事，一个小模特帮他生的女儿。那小女孩现在应该5、6个月大了吧，名叫齐晓天。你想想看，大明星李天船爆出了私生女的丑闻会怎么样?”他得意洋洋的说道。\n“你用这事威胁他!?”\n“没错。我就是在勒索他。这些年他没少打击过我，我当然要把握机会好好从他身上捞一笔!但没想到那家伙运气这么好，还没榨他多少钱就死掉了。”他一脸惋惜的说道。\n“你知道女孩的妈妈叫什么名字吗?就是那个小模特。”\n“那个模特啊,姓齐,那个私生女是跟妈妈姓的。名字好像叫做……额……恩?甜?思?啊，齐思，名字叫齐思!”"
	],
	"强尼": [
		"你在市郊的一间孤儿院里我到了正在做义工的强尼。他穿着印有博爱基金会字样的背心，正在陪一群小朋友们傲游戏。\n得知你是来找他的时候他有些惊讶。“我不认识你。”他柔和的嗓音听起来很舒服。\n“是的,我们并不认识，我是为李天船工作的，他的事你知道了吗?”\n“警方早上来过我们基金会了，真可怕，没想到法制社会中还会有人干出那么残忍的事情。”他拍了拍胸口。“对于他的死我感到非常遗憾，他是个好人，给予了我们基金会很大的帮助。”\n“能告诉我你昨天晚上在哪里吗?你是不是跟李察德在一起?”\n“是的，昨天他邀请我到他家去欣赏他收藏的那些黑胶唱片，那是我们共同的爱好。我们边听歌边聊天,我一直待到午夜才走。”\n“那么晚了还走?怎么不在他家里住呢?你们不是，额,‘情侣’关系吗?”虽然早就知道了李察德是同性恋。\n“本来是打算在那里过夜的，昨晚家里只有我们两个人，可以不受打扰的做些自己想做的事情,但发生了意外---…”\n“意外?怎么了?”\n“好吧，我们吵架了。李察德是个很棒的人，我们有很多共同的爱好，他也很喜欢帮助别人。我是真的很爱他,但昨晚他太过分了!”他越说越气愤，音量也越来越大。\n“你们是为了什么争吵的?”\n“我也不知道，本来气氛挺好的，我们一直在聊最近这段时间各自生活当中发生的趣事，后来我又跟他说了些我们基金会近期发生的事情。同事告诉我，负责运作我们基金会资金的那间利源财管投资公司帮我们找到了好几间新的物资供应商，价格较低品质又好。我们可以帮助更多、更多的人了。但他听了貌似并不感到开心，都没回应我，整个人显得有点心不在焉。”\n“他怎么了?”\n“我也不清楚，可能是他对这些商业的东西不感兴趣吧。他的大明星哥哥那么有钱，投资了很多产业，他都没有去帮他哥哥的忙。总之我们越说越僵，到最后我也生气了，跟他大吵了一架,后来我就回家了。”\n“你还记得那个时候大约是几点吗?”\n“我想想……”他摸着下巴思索了一阵。“嗯，应该是凌晨两点多吧，我回到家的时候还跟楼下的保安聊了两句,那时大约是3点。”"
	],
	"齐思": [
		"齐思的公寓就在市区的一个商业中心附近，并不难找。开门的是个容貌姣好的妙龄女郎,她眼睛红彤彤的，像是哭过，用疑惑的眼神看着你。虽然心里已经确定了，但你还是谨慎的问了一声:“请问是齐思小姐吗?”\n“你是什么人?找我做什么?”她愣了一下，随后一脸戒备的回问到。\n“你好，我是李天船的同事，想请教你一些事。”你笑着说道，努力释放出最大的善意，希望能减少她的敌意。\n“不好意思,我什么都不知道,请回吧。”她边说边关门。\n你一把推住门，不让它关上。“齐小姐，我知道你为李天船生了个女儿，我们最好能谈一下。李天船被杀了，我觉得大家应该多点提供线索，帮助警方破案。”\n“你又不是警察。”门被你推着关不上,她一脸不爽的说道。\n“是的，我不是警察，但我希望能尽快破案，找出杀害李天船的凶手。难道你不想吗?”\n“你在怀疑我?”\n“暂时还没有。”\n她犹豫了一会儿，最后做了决定，打开门请你进去。“到屋里坐着聊吧，小声点，不要吵到我女儿睡觉。”\n你轻手轻脚的走进房内，客厅一角摆了一张婴儿床,里面睡了个粉嫩的小女娃。她睡得正欢，嘴角流着口水，还轻轻打着鼾，可爱极了。齐思端着一杯水走了过来,“请坐吧，家里有点乱，不好意思。”\n你接过水，看了一眼堆满婴儿物品的沙发，最终决定坐到旁边的椅子上。“你女儿真可爱,她眉眼那一片长得很像李天船。”你一边坐下一边说道。\n“是啊,小家伙的嘴巴也很像天船,但他再也没有机会知道这些了。”“你恨他吗?”\n“恨?不，我不恨他。我是因为爱他才跟他在一起的，虽然当时发现我意外怀孕的时候他想让我把孩子打掉，但我不恨他，他也有自己的难处。我生下孩子是因为舍不得。孩子是无辜的，她也有生存的权利，作为母亲我无法让她还没有见过这个世界就走掉。”她轻声说道，语气中有着深深的坚定。\n“李天船认为你生下孩子是为了他的钱对吗?”\n“是的，他完全误会了。后来我找他只是单纯的想让他见见女儿，他毕竟是孩子的爸爸啊。但他根本听不进去，他想完全撇清关系，不让私生女的事影响他的演艺生涯。到后来他甚至拒绝见我，连我的电话都不接。但我是不会放弃的，女儿是无辜的,她有权知道自己的爸爸是谁。”\n“你做了什么?”\n“我打听到你们昨晚将会在费雪酒店举办酒会，于是也在费雪酒店订了一间房，想碰碰运气，看能不能找到机会单独跟他谈一谈。”\n“你们谈了吗?”\n“没有。昨天他身边一直有其他人在。我没能找到机会。我不停往他房间里打电话，但要不就是没有人接，要不就是跟他一起去的那个小明星接的。我不想让她知道关于我的事情，这会加深天船对我的误解。”\n“那你怎么办?”\n“我还能怎么办，我只好放弃，等下次的机会了。但现在天船死了，再也没有下次了。”她叹了口气。“我跟陪我一起去的朋友在房间里聊天到十点多就回家了。我放心不下晓天,哦,就是我女儿,请来照顾她的保姆也该下班了。”\n你起身告辞,临走前问了最后一个向题。“你有没有接触过枪?”\n她看了你一眼。“真枪吗?现实中从没见过。而且，就算给我一把真枪我也不敢用的。”"
	],
	"公开线索1": [
		"东州晚报\n10月18日星期六\n农历乙未年九月初六\n《隋唐大运河》男主角即将敲定!?\n本报最新渝息，国内一线男星山峰于今日下午3点召开发布会·公开对外宜布退出本次大制作电影《隋唐大运河》男主角的选角竞争，将不会承演这一角色。\n山峰出席今日下午发布会时显得非常憔悴，没有了平时沉稳的硬汉形象。他仅仅宣布了自己退出的消息后就匆匆离开，拒绝回答更多的问题。他的经纪人称山峰做出这一艰难决定是因为档期不合·他很遗憾不能与江安导演合作。但据了解，山峰在接下来的时间里井没有任何影视作品的拍摄工作。\n万众期特的史诗级巨制电影《大运河》计划于12月开拍。该电影计划投资近2亿美金，请来了国际知名的大导演江安执导。江安导演过去执导的每部电影都叫好又叫座，屡获国际大奖，而与江安合作的男主角更是极有可能获得影蒂的殊荣。扮演《大运河》男主角的演员绝对能将自己的演艺事业推向难以逾越的巅峰，因此竞争也异常激烈。担任男主角人选有李天船、山峰和吕智这三个国内一线的实力派明星。\n之前业内人士一直看好山峰和李天船两人，认为他们最有希望获得江导的青睐，成为男主角。现在山蜂突然宜布退出，李天船将最有希望出演男主角。据悉，《大运河》剧组将于近日敲定男主角人选，现在就要看看最不被看好的吕智能否爆出冷门了。\n李天船投身慈善事业\n近日,大明星李天船投资500万于本地的小型慈善组织-—博爱基金会，一跃成为该基金会的最大投资人。\n他对媒体宣称自己将持续的对慈善事业进行投资，并积极参与到慈善活动当中。\n“是我的弟弟李察德让我了解到慈善事业的重要性。我之前从未深刻认识到国内还有这么多人吃不饱饭，得不到教育，了解这些后我就下定决心，一定要尽自己最大的努力来做慈善。虽然我的力量很小，但我希望自己能为那些需要帮助的人尽一份绵薄之力。”\nA股接力上演停牌潮数额已超1400家\n10月17日，沪深两市以超过3%的幅度大幅低开，收盘时未能实现逆转翻红。当日A股仅有84只个股逆势飘红，且其中大多是“中”字头的大蓝筹金融股，与之形成对比的是，超过1700只个股处于跌停状态。A股几乎每天都在上演千股跌停的悲剧。\n李天新这一行为得到许多人的赞扬，他的粉丝更是纷纷在他的官网和微博上留言，表达对偶像的敬佩与支持。\n博爱基金会的发言人强尼对媒体说道:“我们整个基金会的工作人员都非常感谢李天船先生。他作为一个大明星，能关注到贫困、孤儿等问题，并以身作则的支持慈善事业，这点实属不易。他不仅投入了资金，还介绍了专业的投资公司负责我们基金会的资金运作。这大大解放了我们这些‘外行人’，我们今后可以专注于义工、扶贫等事情上了。”\n东悉尼淘金者·阿尔拉尔希\n本报体育讯：北京时间10月17日19:30分，2014亚冠联赛决赛展开首回合较量，曾在半决赛中淘汰广州冰泉的澳超球队东悉尼淘金者主场迎战沙达雄狮阿尔拉尔希。第81分钟，戈里尔接队友头球摆渡，左脚低射破门。最终，在场面较被动的情况下，东悉尼淘金者主场1-0战胜阿尔拉尔希，在两回合的决赛中占得先机，有望成为史上首支夺得冠军的澳超球队。"
	],
	"公开线索2": [
		"案发之后\n2014年10月23日，星期四早上7:00\n一阵急促的电话铃声把你从睡梦中吵醒。半睡半醒间你接起电话，里面传来一个男人急躁的声音:“这里是酒店前台，麻烦你现在马上下来大厅好吗？出大事了！警察已经来了！”听到“警察”这两个字让你瞬间清醒了不少，揉了揉刺痛的太阳穴，你的大脑终于开始运转：你现在身在费雪酒店的套房里。昨晚你们一起在酒店的宴会厅举办酒会庆祝大明星李天船胜出选角竞争，确定扮演最近筹划开拍的史诗级巨制电影《隋唐大运河》的男主角。昨天下午李天船正式与该电影的片方签订了合约。庆祝酒会上你们都很兴奋，你都记不清你究竟喝了多少酒，至今你的头还是昏昏沉沉的。\n匆匆洗漱了一下，你快速来到酒店大厅。大厅里都是警察，宴会厅门口拉着警戒线。正当你想找位警察同志询问究竟发生了什么事的时候，一位国字脸、表情严肃的警察向你走过来。“我是市局的黄强警督，今天凌晨在酒店里发生了谋杀案，很遗憾的告诉你，李天船先生被人杀害了。本案由我负责。”那人说道，并向你展示了他的警察证。“现在需要你配合我们警方的调查，能回答我几个问题吗?”\n得知李天船被杀的消息，你还处于震惊当中，下意识的点了点头。\n“我们知道你为他工作，今天凌晨1:00和5:30之间你在哪里？”\n你告诉他你在床上睡觉。在他做记录的同时你问他:“到底发生了什么事?”\n“李先生今天凌晨在宴会厅里被人枪杀了。我们需要你帮忙辨认一下尸体。”\n“好的。”\n在黄警官的带领下，你们一起走到宴会厅的门口。一名守卫的警员拉起警戒线，让你们从下面钻过去，进入宴会厅。\n你一眼就看到了李天船。“没错，那就是李天船。”虽然与你平时见到的李天船相差很大，但那确实就是大明星李天船。他被绑在宴会厅的一把椅子上，全身赤裸，只有一条貌似是他昨晚戴的领带遮住他的私处。一旁地板上散乱的放着一堆衣物，就是他昨天在宴会上穿的那些。他胸口有一处很小的红色伤口，凶手应该就是用枪打在了那里。血从伤口处一直延伸到他腿上，连地毯上都沾染了暗红色的血迹。\n“尸体是今天早上大约5:30的时候被酒店的清洁工发现的，身上只有一处枪伤，没有其它外伤痕迹。”黄警官解释道。“我们现在正在审问这段时间里每个待在酒店里的人。”他深深的看了你三眼。“现在，具体说说你和死者的关系吧。”"
	],
	"公开线索3": [
		"酒店监控录像\n2014-10-23 酒店门口\n你来到酒店的监控室，保安主任帮你把监控录像调到了昨天酒店门口摄像头拍摄到的画面。昨天酒会的时候你还和李天船在一起，这说明他是在酒会之后的某个时间遇害的，因此你跳过了昨晚一部分无关的录像。从午夜0点后开始，你看到了以下这些事情：\n0:10一个身材高大健壮的男人出现在画面里，快步走进酒店。\n0:37一个看样子像是醉酒的客人被朋友扶着出来，坐上车走了。\n1:11酒店夜班的保安走到门口抽烟。\n1:16夜班保安把抽完的烟头丢到地上，用脚踩熄，并回去继续值班。\n1:44一个年轻的男人离开了酒店。\n02:32王纱出现在酒店门口，她跟夜班保安聊了几句，之后她独自在酒店门口站着，貌似在等人。\n02:40一辆的士停在了酒店门口，王纱开门坐进了后座，的士马上开走了。\n03:08一个穿黑色衣服的人走进酒店。他（她）戴着帽子，一路低着头，看不清他（她）的脸，甚至连他（她）的性别都分辨不出来。\n03:31之前那个黑衣服的人快步走出了酒店。\n03:55那个身材高大健壮的男人离开了酒店。"
	]
}