{
    "Stage 1": {
        "Yuki-onna's Room": [
            "The door to the room is frozen. You break in, and the entire room is covered in ice. The ceiling, windows, and table make you feel as if you've entered a snowy world, with small snowflakes floating in midair. These snowflakes seem to have a life of their own, moving with you, and a few even stick to your shoulders. There are several small, palm-sized snowmen on the table, and in the drawer, there is an ice sculpture of a tiny figure, lifelike and resembling Yuki-onna. Inside the drawer is a light blue charm, but no matter how you try, you can't open it. When you squeeze it, it feels as if it's empty. You can choose to take a snowflake, a small snowman, or take nothing at all!",
            "When you try to take out the snowflake and snowman you took with you to show others, you find they've all melted... You recall that the snowflake melted in the time it takes to play a card game, while the snowman lasted a bit longer, taking the time of two card games to fully melt."
        ],
        "Nopperabo's Room": [
            "This is an extremely clean and tidy room, with no signs of occupancy. A narrow and long Japanese sword is displayed on the desk, with the characters 'Oni Maru' engraved on the blade. The hilt has the words 'Spider Elder' carved on it. Next to the sword is a deep blue charm, but no matter how you try, you can't open it. When you squeeze it, it feels as if it's empty. On the nightstand, there's a note. Do you want to open it and read?",
            "The note says: Boss, please forgive me. Regardless of the outcome of this mission, I must retire. I'm sorry, Boss, I can no longer assist you. \n——Respectfully, Fuutarou"
        ],
        "Card Hall and Back Garden": [
            "The hall where you just played cards has a warm table in the middle, with a set of yokai cards placed on it. The yokai cards are brand new, as if used for the first time today. Starting from the right-hand side of the Inari God’s seat, you go around the table. In the first seat on the right, there are a few black feathers. In the third seat, there are a few red hairs. In the fourth seat, there are some white hairs and powdery dust. In the fifth seat, there are some gray-white hairs. In the sixth seat, there is a small stool. The seventh seat feels somewhat cold.",
            "The body of the Inari God is lying to the side. There's no visible trauma or signs of poisoning. His expression is pained, his right hand clutching his heart, and his eyes fixed toward his right side. On the back of his right shoulder, there is a small patch of water on his coat.",
            "The back garden is picturesque, with a shimmering pond, lush green grass by the lakeside, and a gentle breeze. Further away, there is an oddly shaped rockery, but you notice a slightly out-of-place pile of stones near it. After moving the stones with all your strength, you find the body of a wolf yokai underneath. Upon close inspection, you see the body has drag marks, and there is a narrow penetrating wound on the chest, likely caused by a sharp blade. The wound is about 3 inches deep."
        ],
        "Fuutarou's Room": [
            "The entire room resembles a personal kitchen, filled with various cooking utensils and tools. There are also all kinds of ingredients. On the table are many knives of different shapes, and one narrow, rusted knife seems unusual. The closet holds a box, and inside it is a book called 'The Complete Guide to Cooking.' The earlier sections cover basic home cooking, while the later parts get increasingly complex, ending with the process and techniques for kaiseki cuisine. The beginner-level recipes are worn out from use, while the advanced ones seem almost untouched. Next to the box is a light green charm, but no matter how you try, you can't open it. When you squeeze it, it feels as if it's empty. Also inside the box are two tickets to a fireworks festival, though they've already been validated."
        ],
        "Xiao Nuan and Yuko's Room": [
            "This is a warm and spacious room. The middle of the room is divided into two areas by a screen. The furniture on the right side of the screen is much smaller than normal, with only a small bed, a small wardrobe, and a tiny nightstand. On the small bed is a tiny pink rabbit kimono, Yuko's favorite. The embroidery on the kimono is exquisite, but the left sleeve above the cuff is worn. You inspect the other small kimonos in the wardrobe and find that most of them are similarly worn on the left sleeve. In the nightstand is a pale pink charm, but no matter how you try, you can't open it. When you squeeze it, it feels as if it's empty. Under the bed is a small box, and inside it are dried cherry blossoms, pebbles, and maple leaves. Although these are common items, they are carefully cherished. The furniture on the left side of the screen is also miniaturized, with few items: a small bed, a small wardrobe, and a small nightstand. In the unlocked box on the nightstand are packets of paw-shaped cookies. In the wardrobe, there is a set of yokai cards, brand new and unopened. Next to the cards is a red charm, but no matter how you try, you can't open it. When you squeeze it, it feels as if it's empty. Under the pillow is an envelope. Do you want to open it and see?"
        ],
        "Xiao Nuan's Words": [
            "Xiao Meng is waiting for Sister at the Inari Shrine! Xiao Meng will work hard in training, and Sister, you should work hard too~"
        ],
        "Sky Dog's Room": [
            "The room is a bit messy, and the walls are covered with many photos and case notes, with conclusions written under each case.\nCases on the wall:\nCase One: [Mount Fuji Yuki-onna Disappearance Case]\nWritten in red beside it: He shouldn't have done that!\nCase Two: [White Fox Village Chief's Son Murder Case]\nWritten in red beside it: Seems connected to the Kama-itachi Assassination Group from the Shin'en Group.\nCase Three: [Hachihou Ruribou Spider Elder Murder Case]\nWritten in red: What should I do?\nOn the desk is a gray charm, but no matter how you try, you can't open it. When you squeeze it, it feels as if it's empty. In the wardrobe is a small 30 cm bag, with a cross-body design embroidered with cherry blossoms. It has velvet lining, but there are two round holes on the front of the bag."
        ],
        "Ayumi's Letter": [
            "To Mommy\nMommy, it's Little White\nToday, I obediently ate the carrot cake that Grandma made, even though Little White hates carrots. But Grandma said that as long as Little White is good, Mommy will come back. So Little White has to be good, listen to Grandpa and Grandma, eat well, sleep well, and grow up well.\nMommy, Little White has been good. Mommy, can you come back soon... Little White misses you so much."
        ],
        "Ayumi's Room": [
            "This is a traditional Japanese tatami room, clean and neat, with a faint scent. The closet door seems slightly ajar. As you walk over to close it, you notice the bedding inside is wrinkled as if someone has slept in it. In the dresser drawer, there is an old set of yokai cards with bent corners, seemingly used during regular card games. In the wardrobe, there's a small square box. You're not sure what it was used for, but there are traces of powder inside. Next to the box is a white charm, but no matter how you try, you can't open it. When you squeeze it, it feels as if it's empty. In the nightstand are many letters, mostly from a fox village in the Kyoto suburbs, addressed to Hachihou Ruribou. Do you want to open one and take a look?"
        ]
    },
    "Stage 2": {
        "Megumi Aoi (Nine-Tailed Fox)": [
            "A special hospital visiting application form\nApplicant: Megumi Aoi\nPatient: Shiro Aoi, 6 years old\nDepartment: Hematology",
            "A critical illness notice\nPatient: Shiro Aoi\nCondition: Acute lymphoblastic leukemia\nDiagnosis: Combined chemotherapy is ineffective, an urgent hematopoietic stem cell transplant is needed",
            "A metal name tag\nIt says: Night Sakura Pavilion — Ahui"
        ],
        "Momoko Suzumiya (Little Doll)": [
            "A hospital visit certificate:\nVisitor: Momoko Suzumiya\nPatient: Reiko Suzumiya\nDepartment: Neurology\nCondition: Deep coma",
            "A photo album filled with shocking images, all depicting scenes of whale hunting and the dead bodies of whales.",
            "A traffic accident compensation document, amounting to 600,000 yen."
        ],
        "Victim's Room": [
            "There are signs of a struggle in the room.",
            "On the table is a wallet, and inside you find many business cards. Three of them, signed by the deceased, catch your eye:\n1. Factory Director of a Fish Processing Plant: Hidekawa Kojima\n2. President of a Whale Catching and Processing Company: Hidekawa Kojima\n3. Honorary Chairman of the Whale Research and Protection Committee: Hidekawa Kojima"
        ],
        "Xiao Nuan (Little Fox)": [
            "A box containing a bag of paw-shaped cookies.",
            "A set of yokai cards placed on the table.",
            "A set of shrine maiden clothing hanging in the wardrobe."
        ],
        "Nana Kinomoto (Yuki-onna)": [
            "A badge from a prestigious high school.",
            "An envelope containing 600 yen and a brief note, which reads: 'Nana, take good care of yourself, your mom needs someone to take care of her too.'",
            "A court summons related to a civil dispute over a traffic accident.",
            "An album filled with hand-drawn pictures of Sailor Moon, but the last page is filled with 'sorry' written over and over.",
            "A pink Sharp flip phone, with many call logs from unfamiliar numbers, and numerous text messages. Most messages are just times and locations, and the locations are mostly various hotel rooms."
        ],
        "Hall and Kitchen": [
            "On the floor is a black charm, but no matter how you try, you can't open it. When you squeeze it, it feels as if it's empty.",
            "The deceased: There is a mark on the back of the head from a blunt object, one side of the face is slightly swollen, and there are multiple stab wounds from the chest to the abdomen. The tongue is sticking out, and the face is red. The clothes are slightly disheveled, as if there are drag marks. There is a large amount of blood on the chest, and there are small traces of blood on the table and floor where the deceased collapsed.",
            "In the refrigerator, you find a simple syringe containing some yellow, spongy tissue.",
            "On the kitchen counter, there is a set of cooking tools, but one knife is missing."
        ],
        "Ichiro Kiryu (Nopperabo)": [
            "An armband with the word 'Yamaguchi' embroidered on it.",
            "A silk handkerchief with two large characters embroidered on it: 'Morality.'",
            "A stack of remittance records, showing a fixed monthly payment of around 80,000 yen sent to a small fishing village.",
            "A photograph of a woman with a little girl, with 'Little Cherry' written on the back.",
            "A crumpled letter that reads: 'Ichiro, these years you've risked your life for me, helping me build this empire. Half of my success is due to you. I know my time is short. You'll remain the second in command of this organization. My disappointing son will depend on your guidance. I'm counting on you, Ichiro.'"
        ],
        "Zetong Hei (Sky Dog)": [
            "A photo showing Zetong Hei in a high school uniform. Behind him stands a slightly older young man and a middle-aged couple. Both the young man and the middle-aged man are wearing the uniform of the Kyoto Police Department.",
            "Many receipts from the Sunshine Convenience Store near the Kyoto moat, showing purchases of a red bean bun and two bottles of beer.",
            "A notebook, which is a log of commissions, most of which are for finding lost cats or dogs or investigating extramarital affairs. The commission fees are all low.",
            "A business card that says: Zetong Hei Detective Agency\nPrivate Investigator: Zetong Hei.",
            "A salbutamol inhaler."
        ],
        "Daixiong Kitano (Kama-itachi)": [
            "A visit application form for a suburban nursing home to visit the Kitano couple.",
            "A shop transfer contract\nAmount: 60 million yen\nTransferor signature: Daixiong Kitano\nAgent signature: Hidekawa Kojima\nThe signing date is blurry and hard to read."
        ]
    },
    "Xiao Nuan": "Tanuki: You're Xiao Nuan, right? You've learned how to dress the Inari God?\nXiao Nuan: Yes, Lord. I trained for a long time as a ceremonial dresser for the Inari God.\nTanuki: Alright, then carefully prepare the Inari God's body, and don't make any mistakes.\nYou finally see the Inari God you've admired with your sister for so long, but now, lying before you is a lifeless body. Holding back your sorrow, you begin to dress the God. But as you do, you suddenly realize something's strange about the way the clothes are worn—many things are wrong, the collar is reversed, the inner garments are mismatched, and the bow is tied incorrectly.\nXiao Nuan: Lord, something seems wrong. The Inari God's clothes seem to be put on incorrectly...\nTanuki: How could that be?! The ceremonial dresser who's served the Inari God for 300 years dressed the God neatly this morning before we left! How could the clothes be wrong? Surely you’re not skilled enough!\nXiao Nuan dares not argue, nodding silently as she continues to arrange the clothes. But in her heart, a bold thought arises: could this God... be a fake? She gently pinches the Inari God's face and stomach, testing if it's real, only to find it's genuine flesh, with no signs of magical disguise or trickery...\nTanuki: Are you done yet? If you're done, hurry back."
  }
  