{
  "第一幕": {
    "安妮": {
      "Story": "你是【安妮】，25岁，你的父母曾经都是【劳伦造船厂】的员工，三口之家虽然算不上特别富裕，但是也过得简单开心。然而公司的业绩却意外地每况愈下，终于在某一天倒闭了，你的父母都成了无业游民。你的母亲因这突如其来的打击而病倒，只剩下你的父亲苦苦支撑着家里的开销。随着母亲病情的恶化，你父亲一个人的收入已经不足以满足家里的开支。在花光了家中的积蓄之后，父亲不得不去卖血以维持生计。就这么又过了一段日子，你的父亲终于因为卖血染病死了。生活的重担一下子就落在了年轻的你身上，你不得不辍学打工，来给母亲治病，并且，不得已借了一笔高利贷。恶梦就这样开始了，很快还款的压力你已经无力承担，面对着日益凶狠的上门催讨，你想到了最后的方法——出卖自己的身体。不过这件事被你意想不到的方式终止了。某一日，当地黑帮的头目——【杰克】找到了你，声称可以帮你偿还所有的债务，甚至可以出钱为你的母亲治病，但是代价是你必须嫁给同性恋的他，作为名义上的妻子。这对当时走投无路的你来说，无遗非常的有诱惑力。你想也不想地就答应了这个请求。于是，你甩脱了繁重的债务，你的母亲送进了当地最好的医院，你成了有头有脸的“黑帮夫人”。你本以为日子就会这样下去了，然而，生活似乎从没有放弃对你的恶意。作为一个同性恋，【杰克】和你之间没有多少感情可言，甚至动不动就打骂你，对你并不如想象的那么好。如果说这一切都还可以忍受，那么母亲的突然死亡对你来说就犹如晴天霹雳。由于医生的疏忽与擅离职守，你的母亲最终还是死在了病床上，【杰克】虽然帮你追究了医院的责任，但是院方赔给了【杰克】一大笔钱，他因此草草安慰你几句，便不再管这件事。你从此变得郁郁寡欢，时常出入各种夜场，饮酒作乐，想借此忘掉生活的苦闷。在酒吧里，你认识了花花公子——【山姆】。一开始，你们相谈甚欢，【山姆】散发出来的魅力让你不禁有些目眩，你似乎也让他不能自拔，你们很快就开始幽会偷情，就当你觉得自己终于找到了一丝精神的慰藉的时候，你意外地发现，【山姆】就是那个当年害死你母亲的医生。你很快由爱生恨，之前甜蜜的种种全都转化成了无尽的怒火，你开始盘算如何对【山姆】展开报复。于此同时，你因为经常陪同杰克出席各种社交场合，结识了【小布莱克】，你发现，你父母的老雇主【劳伦】，目前正在给【小布莱克】的父亲【老布莱克】当管家，你不禁唏嘘命运对人们的不公，但是你也在一次意外中偶然听到了【劳伦】和女儿【杰西帕】之间的谈话，了解到【老布莱克】就是搞垮【劳伦造船厂】，让你一家流离失所的罪魁祸首！你笑了，命运此时终于给了你一个绝佳的机会，老布莱克目前正在接受心理治疗，而他的私人心理医生，正是【山姆】！一个一箭双雕的计划迅速出现在你脑海中，你声称你深爱着【山姆】，央求他带着你远走高飞，【山姆】欣然答应了，但是作为你最后的心愿，你希望【山姆】能帮你杀掉【老布莱克】。看得出来【山姆】在这件事情上产生了很大的心理斗争，但是最终他还是答应了......",
      "Script": "今天晚上，今天你跟着【杰克】来到【小布莱克】的庄园享受晚宴，你依旧装作是一个什么都不了解的“花瓶式”夫人，像往常一样。而恰好，【山姆】今天也来为【老布莱克】做定期的检查。",
      "Relationship": "【小布莱克】是你丈夫的“生意伙伴”，他的公司经营仰仗着黑帮的不法勾当，你和他本人没有太多来往，但是似乎他和他父亲的关系不太好。【山姆】的是【老布莱克】的私人心理医生，是你的情夫，同时也是害死你母亲的凶手，他曾经是一个花花公子，但是为了你似乎改变了很多。他答应为了你去杀人，今晚的一切也许就是他的杰作。【杰克】是你的丈夫，但是他其实是一个同性恋，所以你们只是形式上的夫妻，他虽然经常打骂你，让你讨厌，但是他为你还清了债务，所以你对他的感觉也是恩怨参半。【约翰】是【小布莱克】的贴身保镖，你只是偶尔见过他几面。【杰西帕】似乎是凯佛尔·劳伦的女儿，除此之外你并不了解。",
      "Performance": "你必须公开：1、认识凯佛尔·劳伦，并且父母曾经在凯佛尔·劳伦的公司工作。公司倒闭以后生活就变得很困苦。2、自己的母亲是因为医生的疏忽才死的。3、你其实和杰克的关系并不太好，她偶尔会打骂你。",
      "Purpose": "1、不要让别人发现你和老布莱克的死有关系。2、成功让两个以上的人怀疑山姆杀人。",
      "Ability": "你的随身物品：1. 一支口红和一支护手霜。奢侈品品牌，全球限量款。（女士的包里有口红和护手霜需要解释么？）2. 大量的现金。（从小到大你都深深的知道没有钱是多么痛苦，所以你会随时带着大量的现金，这是你安全感的来源。）"
    },
    "杰克": {
      "Story": "你是【杰克】，30岁，从你有记忆的时候起，你一直是跟着母亲在生活，你父亲所有的遗物，就只有一块怀表，和一张老照片。你的母亲告诉你，你父亲曾是一名商船的船长，因为一次意外而死在了海上。你母亲生前经常拿着那张你父亲和他船上大副的合照叹息，而让你奇怪的是，虽然你会偶尔问起，但是她从来也不告诉你，你父亲，以及他船员们的名字，几次三番之后，你也就学会了对此保持沉默。孤儿寡母的生活不可谓不清苦，从小你就在周围人的歧视下长大，人们都嘲笑你是“没爹的孩子”，你的母亲能做的，也只有用言语稍微安慰你受伤的心灵。你变得老练世故，也明白，在这个世界上，只有拥有力量，成为胜者，才能拥有说话的权力，你渴求着金钱、权力、美好的物质生活，并为此而暗自努力。家庭的重担让你的母亲衰老得很快，在你还年轻的时候，你的母亲就早早地离开了人世。无依无靠又没有受过高等教育的你，很难在这个社会找到一份好工作，辗转了一段时间，你几乎是毫无意外地加入了当地的黑帮，过起了刀口舔血的日子。说实话，你一开始在帮派内很不起眼，但是你老练的交际手腕和敢打敢拼的个性，以及突然不定期获得的神秘资助，让你很快在黑帮内建立起了广泛的人脉，扶摇直上。终于，经过数年的努力和铺垫，在之前的黑帮老大死去之后，你成为了众望所归的继承人。当上黑帮老大的你已经不需要实际去执行那些肮脏而危险的勾当了，与此同时那笔神秘的资助也没了踪影，仿佛那就是上天为了帮助你度过最黑暗的时刻。你的全部精力得以投入在斡旋与各种上流人士，以及帮派的管理上。你变得衣着光鲜，生活富足——因为你是这个城市的“地下之王”，你仿佛已经得到了你儿时梦寐以求的生活。但是你有一个让你非常苦恼的秘密，那就是你渐渐发现，其实你是一个同性恋。这件事如果让你的手下们知道，你的地位很可能会不保，毕竟，哪个黑帮会接受一个同性恋老大呢。你开始为自己物色一个形式上的妻子，来掩盖自己真实的性取向。你的黑帮放出了很多高利贷，你在欠债的人当中寻找着合适的猎物，并很快锁定了【安妮】，年轻貌美，父亲亡故，母亲病重，欠了一屁股无力偿还的高利贷。你适时地出现在她面前，承诺帮她还清所有的债务，并且安排她母亲进入当地最好的医院，代价就是她要成为你的妻子。【安妮】在这件事情上似乎并没有拒绝的理由。婚后你给了她不错的物质生活，同时也和她摊牌，你和她的婚姻就是一个形式，让她不要管你的私生活，当然，你也不会去管她的私生活，不过她明面上还是黑帮夫人，如果她胆敢透露你的秘密，或者她在外偷情让别人知道了，你也不会轻易放过她。从此你们两人在生活上几乎可以说是各不相干了，除了偶尔带她出席一些正式场合，或者不顺心时打骂她来出气以外，你和她没有太多交集，你也不关心她的生活状态。她母亲因为医生的疏忽死在医院里时，你也只是收了医院一大笔的赔偿，就让【安妮】不要再追究这件事了。虽然有了形式上的婚姻，你还是只能私底下满足你在性取向上的癖好。你经常去当地的一处同性恋聚集地——一个名为Cowboy的酒吧。有一次，你在酒吧里遇到了一个“熟人”，你的一个商业合作伙伴，当地著名企业老板【小布莱克】的保镖【约翰】。你和【小布莱克】有一些生意上的往来，因而见过在他身边的【约翰】，你们攀谈起来，很快发现两人互有好感，便发展成了地下情人。你因此经常前往【小布莱克】的庄园做客，表面上是因为【小布莱克】委托你调查他父亲是否有私生子的问题，在你看来有钱人家有这样的问题再常见不过了，而你的真正目的是为了能见到【约翰】。这种平凡的到访带来了意外的收获，某一次你偶然在【小布莱克】父亲【老布莱克】的房间里，发现了他和你父亲的合照。经过一番小心的询问，你了解到，【老布莱克】以前是你父亲船上的船员。你立刻安排【约翰】想办法帮你暗中调查相关的信息，打听到了【老布莱克】一直因为背叛并害死了自己的好兄弟而感到后悔和内疚，而他的管家【劳伦】作为当年船上的水手长，也在这件事中扮演了重要的角色。随着线索逐渐累积，你认定你父亲的死并不是单纯的海难，而是他的船员们的蓄意杀人。与此同时，【约翰】告诉你，他打算辞去【小布莱克】保镖的工作，于是你很快和他构思了一个复仇的计划，准备让【约翰】帮你一个一个地向杀害你父亲的凶手复仇，而【老布莱克】就是第一个......",
      "Script": "今天晚上，今天你又来到【小布莱克】的宅邸做客，实际上则是为了实施你的杀人计划。",
      "Relationship": "【小布莱克】是【老布莱克】的儿子，现在继承了【老布莱克】的公司，你们有生意上的往来，你为他用不光彩的手段摆平了很多麻烦，他和【老布莱克】的关系似乎并不太好。【安妮】是你名义上的妻子，你和她没有太多感情，也没有太多生活上的交集，事实上，你也觉得她平日里对什么都不关心，只是个愚蠢的花瓶。【约翰】是你的情夫，一个退伍的雇佣兵，【小布莱克】的贴身保镖，你们真心相爱，并准备在这件事之后就帮助他销声匿迹。【杰西帕】似乎是【小布莱克】公司的财务，【约翰】曾经告诉你，她好像有一些经济上的问题。【山姆】是【老布莱克】的心理医生，同时也是当年因为疏忽导致【安妮】母亲死亡的罪魁祸首，但是那件事对你来说已经过去了，所以你和他现在并无交集。",
      "Performance": "你必须公开：1、你认为人如果做过坏事，总会遭到报应，你也是这样。2、你的淡定来自于你在黑帮的经历，在黑帮这样的事很常见。3、如果你被怀疑，则必须公开：小布莱克委托你在调查他父亲私生子的事。",
      "Purpose": "1、不要让别人发现你和老布莱克的死有关系。2、不要让别人发现你和约翰有关系。",
      "Ability": "你的随身物品：1. 一块怀表，指针已经停转但是似乎常被把玩，铜外壳被摸得锃亮。（你父亲的遗物。）2. 一张两个人合影的照片。背后有字“亲爱的老布莱克，我们的友谊地久天长。”落款是哈克。（这个害死你父亲的凶手尽然保留着这张象征两人友谊的照片，他不配，你要收回找张照片。）"
    },
    "杰西帕": {
      "Story": "你是【杰西帕】，27岁，你是水手长劳伦的女儿，你的父亲在经历了一次可怕海难后，便和大副、船医一同回到岸上，凭借着各自积累下的财富，操持起了各自的事业。你的父亲曾经是【劳伦造船厂】的大老板，年幼时的你也经历过一段公主般富足的生活，但是很快你父亲的事业就因为各种各样的原因倒闭了。你从小称为“叔叔”的大副【老布莱克】好心收留了你父亲，以极高的薪资聘请你父亲作为他的管家，你也因此能够继续接受良好的教育。家道中落的经历使你在学校表现得十分刻苦，你在财务方面的天赋使你很快以优异的成绩从经济学院毕业了，而在这期间，你的父亲出于对海难往事的糟糕回忆，在求生技能方面对你进行了大量的培养，不仅仅是打水手结之类他自己熟悉的海上技能，你还系统地接受了心肺复苏、静脉注射等急救方面的培养，在身体运动方面，你也一直有着出色的表现。你毕业后，【老布莱克】的公司已经慢慢由【小布莱克】接管，而你也成功地成为了公司的财务经理，可以说，虽然童年经历并不完美，但是你之后的人生还是让周围的人不禁感叹上帝对你的格外恩宠。但是有一天，这种欣欣向荣的假象瞬间崩塌了。你的父亲怒气冲冲的告诉你，他终于发现，当年自己的公司垮台，是因为【老布莱克】在私底下运用了一些肮脏的手段导致的。你父亲还借此机会，告诉了你当年海难的一些真相，当时，你父亲、船长哈克·布朗特、大副【老布莱克】和船医活了下来，流落到一个荒岛，他们利用岛上的材料做了一个木筏来自救，但是木筏只能载下三个人，【老布莱克】就残忍地打晕了船长，将他遗弃在了荒岛上，让剩余三个人乘木筏出海，虽然他们三个最终获得了过往船只的救援，但是船长却永远留在了那个孤岛上。你很爱你的父亲，对于【老布莱克】扭曲了自己的生活，以及屡次三番背叛自己昔日好兄弟的行为也感到十分的愤慨。于是一个复仇的计划在你们父女间慢慢成型。你在接受求生技能训练时，和当时的求生教练、退伍军人【约翰】关系非常好，你知道他渴望能赚到更多的金钱，于是给他提供了一个两头赚钱的差事——明面上给【小布莱克】当保镖，实际是为了你而监视他的行动。同时，你开始有目的地，分批次地从【小布莱克】的公司吸取金钱，因为在你看来，这些本应是属于你的财富。另外你也遵从了你父亲的建议，接受了【小布莱克】的追求而和他私下在一起，尽管在你看来，他是一个比较不擅长和女性交往的人，甚至会在第一次约会时，把地点定在一家叫Cowboy的同性恋酒吧，但是这分私下的关系会为你增加许多筹码，所以你还是应允了。对于你父亲来说，他希望你能逐渐搞垮这个由【老布莱克】建立起来的金钱帝国，以报当年的一箭之仇，甚而，如果有那么一个机会，由你，或者你父亲，亲手了结【老布莱克】的生命。然而，对你来说，你已经在实施计划的过程中慢慢爱上了【小布莱克】，甚至已经怀上了他的孩子，仇不得不报，而报仇之后，你和你的爱情又应该何去何从呢......",
      "Script": "今天晚上，今天你假装是来看你的父亲，实际上是为了实施你们蓄谋已久的杀人计划。",
      "Relationship": "【小布莱克】是你的老板，你和他从小一起长大，你觉得他还算是个不错的人，虽然似乎结交了一些黑道的关系，但是那也是为了公司的利益。他似乎已经发现了你窃取公司财产的事，不过不知道是不是因为和你的私情，他并没有阻挠你，而你也已经爱上了他。他年轻时失手杀过人，他爸为了这事没少和他吵，不过那件事之后他已经改邪归正走上了正途。【山姆】的父亲是你父亲船上的船医，因此你们也在小时候就认识，他跟随他父亲走上了从医的道路，现在是【老布莱克】的私人心理医生。【杰克】是【小布莱克】在黑道的朋友，你并不是很喜欢这一类人，所以对他敬而远之，所幸的是，他并不像你想象的那样低俗、邋遢，所以总的来说，你并不讨厌他。【安妮】是【杰克】的妻子，你对她不甚了解。【约翰】是【小布莱克】的贴身保镖，这是一个退伍的军人，话不多，手脚麻利可靠，你当初为了监视他而安插了这个眼线，不过眼下，你似乎已经不再需要他了，所以你解除了和他的雇佣关系，同时也让他向【小布莱克】提出了辞职。",
      "Performance": "你必须公开：1、父亲的公司——劳伦造船厂曾经倒闭。2、接受过急救方面的训练，约翰是你师父。3、约翰当小布莱克保镖是你推荐的。4、父辈三人的关系。5、如果你被怀疑，则必须公开：小布莱克杀过人，这事儿他爸爸也知道。",
      "Purpose": "1、不要让别人发现你的杀人手法。2、不要让别人发现你贪污公款的问题。",
      "Ability": "你的随身物品：1. 一张购物清单，上面写的全是一些户外登山用具，和一些野外求生工具。（你参加的野外求生俱乐部下周有活动，你列出一些必要物品，准备过两天有时间把东西买齐）2. 一盒感冒药，还留下2片，看着和老布莱克卧室内散落的药品有些像。（这两天你一直被轻微的感冒困扰，所以随身有带感冒药）"
    },
    "山姆": {
      "Story": "你是【山姆】，29岁，你父亲曾是和大副【老布莱克】同一条船上的一名船医，早年经历过一次海难，你父亲对于这次海难的经过说得非常模糊，只说他和船长、大副、水手长幸存下来流落荒岛，终于等到船来接时，却到处找不到船长的影子，因此最后只有他们三个成功获救了。在这番经历之后你父亲便再也不出海了，回到岸上定居，用自己积攒的财富和知识，开了一家诊所，慢慢地，这家诊所就发展成为了镇上最好的私立医院。不知道是因为从小在医院耳濡目染的生活经历，还是你遗传于父亲的天分，最终你也走上了从医的道路。成为医生的你可谓年轻有为，很快成为了医院外科最耀眼的新星，尽管有人质疑你和院长的父子关系给你提供了便利，但是你凭借技术上的实力，让他们通通闭了嘴。人无完人，你在能力上的无懈可击，并不能掩盖你私生活的混乱。由于从小过着富足的生活，你父亲对你采取的又是放任和宠溺的教育政策，你最终成为了夜场内有名的花花公子。你最大的爱好，就是到处寻花问柳，逐美猎艳，而由于你青年才俊的成就，以及院长儿子的地位，也确实有很多女人围绕在你身边。人们仅仅把这件事当成茶余饭后的谈资，这些余兴节目也没有为你生活带来多大的影响。直到你搞砸了自己的前途。某一天，你又约了一个美女幽会，但是因为一些意外情况，你当天晚上被安排在外科病房值班。这令你非常郁闷，但也不是没有机会，你和护士小姐的“私下关系”让你能够偷溜出去而不被发现，因此你早早地安排好病人的药物，然后便去享受自己的生活了。但是因为你当时的疏忽，某一个病人的药剂过量了，并且因为你不在，没能够及时处理，导致了病人的死亡。这件事仿佛一道晴天霹雳，使你的生活如坠云端。一直是个公子哥的你当然不懂得怎么处理这些问题，那个宠爱你的父亲花钱帮你平息了这件事，不过你也没法在外科混下去了，你只好转行学起了心理治疗，并且在你父亲的介绍下，成为了【老布莱克】的私人心理医生。这场经历让你收敛了许多，虽然你还是会时不时地出入夜场，但已全然没有了往日的风采。某一天，你一如往常地来到酒吧排解生活的郁闷，并在这里意外地遇到了【安妮】。你瞬间被她的美貌与气质所吸引，这种一见钟情的感觉全然不同于过去你见到其他美女的感觉。你忍不住上前搭讪，并且使出浑身解数，向这位美女散发着自己的魅力。你们很快成为了情人关系，你了解到，【安妮】是本地黑帮老大【杰克】的老婆，平时他对【安妮】也常常有一些暴力行为，导致她过得并不好。你一直在寻找着机会，解救【安妮】脱离苦海。某一天，【安妮】告诉你，她已经准备好了一切，要和你远走高飞，但是走之前，她有一个最后的心愿。【安妮】的童年生活非常凄惨，她父母的公司倒闭后，接连病死，她因而才会沦落到【杰克】手中，而她现在终于知道，【老布莱克】就是当年她父母公司倒闭的罪魁祸首，她希望你能替她杀掉他，为她报仇。这件事听起来很疯狂，不过在爱情的驱使下你还是决定铤而走险，你买好了你们两人的机票，定好了动手的日期，一切看上去万无一失......",
      "Script": "今天晚上，今天你一如往常来给【老布莱克】做定期检查，他一直受到心脏病和抑郁症的困扰。",
      "Relationship": "【小布莱克】是老布莱克的儿子，现在继承了【老布莱克】的公司，你们童年时也经常见面，年轻时他曾经当过小混混，你们一定程度上意气相投，但是【老布莱克】对他恨铁不成钢，所以他们父子关系并不好。他让你在医疗过程中顺便调查一下他父亲有没有私生子，目前你仍一无所获。【安妮】是你的情人，也是你的幕后主使，你深深地爱着她，并对她毫无保留，而且你也相信，她也深爱着你。【杰克】是【安妮】的丈夫，当地的黑帮老大，时常打骂【安妮】，所以你非常恨他，他和【小布莱克】有一些生意上的往来。【杰西帕】是【小布莱克】公司的财务，她父亲是【老布莱克】船上的水手长，现在的管家，所以你们从小就认识，她是一个在各方面都非常出色的成功女性，你知道【小布莱克】一直很喜欢她。【科恩•帕克】是【赛伦•布莱克】的贴身保镖，你只是偶尔见过他几面。",
      "Performance": "你必须公开：1、你曾经是一个外科医生，因为一些意外转行当了心理医生。2、你父亲和杰西帕、小布莱克两人父亲之间的关系。3、你知道布莱克父子的关系不好，经常吵架。",
      "Purpose": "1、 不要让别人发现你和老布莱克的死有关系。2、 不要让别人发现你和安妮有关系。",
      "Ability": "你的随身物品：1. 护照。2. 两张明天凌晨的机票，登机牌的上的名字是山姆和安妮。（今天晚上此间事了，你就会带着耶达，坐凌晨的飞机离开这里，远走高飞。）"
    },
    "小布莱克": {
      "Story": "你是【小布莱克】，30岁，作为这家庄园的继承人，死者唯一的儿子，不得不说，你看上去算是一个不错的富二代。你的父亲是一艘商船的大副，在一次海难获救之后，便回到岸上定居，用自己积攒下来的财富做起了买卖，很快成为了一方大商贾，有了自己的公司和事业。你因此在儿时获得了不错的教育，同时在成年以后，继承了父亲的公司，并不断地将其继续发展壮大，让你的父亲得以安享晚年。但你也并非一帆风顺。年轻时的你是一个冲动而暴力的青年，这一点与你沉着老练的父亲非常不相像，因此也经常受到父亲的责骂，让你过得并不开心。你私底下和一群混混玩在一起，在街头发泄着自己多余的精力与郁闷的心情，终于有一天，在一场看上去非常普通的斗殴中，你失手捅死了人。你的父亲勃然大怒，尽管如此，他还是想尽办法帮你摆平了这件事。这给了你一个莫大的教训，这之后你也安分起来，摆脱了那些狐朋狗友，走上了父亲给你安排好的精英道路。你很快开始接受父亲的布莱克远洋贸易的大小事务，在这个过程中，你管家的女儿，【杰西帕】成为了你的公司财务，从小和她一起长大的你，一直对她颇有好感，但是你并不擅长和女生交际，甚至第一次约会时，你们还误约在一家叫Cowboy的同性恋主题酒吧，让你们颇为尴尬。尽管如此，你和【杰西帕】的感情还是迅速升温了。相对的，你在经营公司上很有天分，很快将事业发展得有声有色，同时，你也不可避免地和黑白两道打起了交道，在这个过程中你认识了【杰克】，本地黑帮的老大，他和你年龄相仿，你们非常投缘，而且，似乎你的父亲也很喜欢他，你们经常在一起聚会，他在背后也给了你许多支持。不过，你和你父亲的关系并没有随着你的事业一同好转。你和你父亲依然时不时发生争执，你父亲某日发现公司的账目有问题，因而责问于你，你知道这是【杰西帕】的所作所为，但是由于你和她之间的私情，出于包庇的原因你并没有告诉你父亲事实，你父亲因此认为你贪污了公款，便勒令你注意自己的行为，同样的事情他不想看到第二次，否则，他就把事情公开，并且剥夺你公司和财产的继承权。父亲对你过分严苛的态度与做法，让你不禁开始怀疑，你的父亲是否在外面有私生子，并且已经确定弃你于不顾，因而你调动了许多力量，包括求助于杰克，来调查这件事情的可能性，毕竟如果这是真的，那么你就可能要动用一些非常的手段来保证自己的利益了......",
      "Script": "今天晚上，你又一次邀请了【杰克】和他夫人来到你的庄园，参加你的私人晚宴。",
      "Relationship": "【杰西帕】是你的公司财务，他的父亲【凯佛尔·劳伦】也是你们家的老管家——也是当年你父亲船上的水手长，你们从小一起长大，而你和她之间的感情一直没能公开，因为你们的父亲似乎都非常反对你们在一起。因此，尽管她一直在贪污你公司的钱款，但是你却一直包庇着她。【山姆】的父亲是你父亲船上的船医，因此你们也在小时候就认识，他跟随他父亲走上了从医的道路，由于你的父亲目前患有抑郁症，所以他现在是你父亲的私人心理医生，你也拜托他想办法从你父亲那里调查一些关于私生子的情报。【杰克】是你在与黑道交往时认识的，他和你意气相投，因此和你私交不错，也让你在利用肮脏手段摆平公司事务时，少了许多麻烦。【安妮】是【杰克】的妻子，你对她不甚了解，但是他们夫妻感情似乎并不太好。【约翰】是你的贴身保镖，是你听从【杰西帕】的建议聘请的退伍军人，话不多，手脚麻利，守规矩，所以你很信任他。但是他这几天突然提出了辞职，这让你很困惑。",
      "Performance": "你必须公开：1、山姆曾经是一个花花公子。2、你年轻的时候个性不好，是你父亲让你走上正途。3、你父亲一直告诉你他有一件“年轻时做的让他后悔的事”。4、你父亲房里现在的杯子并不是他自己的，因为前几天杰西帕打破了你父亲的杯子。",
      "Purpose": "1、找到杀害你父亲的凶手，查出他的作案手法和作案动机。2、不要让别人发现杰西帕贪污公款的问题。",
      "Ability": "你的随身物品：1. 一张名片，是一家私人侦探社的。（调查私生子的事情一直没用进展，你想找私家侦探调查此事。）2. 一打财务报表，其中有很多红色铅笔做的批注，数额似乎都有些问题。所有的经手人都是杰西帕。（你刚收到新季度的财务报表，杰西帕经手的账目依然有问题，迫于父亲的压力，晚上你想找杰西帕谈一谈。）3. 用过的针筒。（你不知道这个针筒是哪里来的，你今天下午都没有和你的公文包在一起，所以你也不知道是否有人动过）"
    },
    "约翰": {
      "Story": "你是【约翰】，35岁，你是一个退伍的雇佣兵，执行任务的生活虽然能提供很多刺激，但是却不是你想要的样子。于是你离开了那种生活，回到老家开始当一个简单的求生技能教练。然而，这份工作的工资并不如你的意。你渴望能够赚到更多的金钱，过上更好的生活。于是，当一个赚大钱的机会放在你面前时，你毫不犹豫地答应了：你曾经的一个学生【杰西帕】来找到你，希望你成为他老板【小布莱克】的私人保镖，同时为她监视【小布莱克】，好让她实施一些自己的计划。这份工作可以让你从【小布莱克】和【杰西帕】两边都获得不菲的工资，曾经的雇佣兵生活也让你学会了不要多问雇主问题，于是你就这么安静地一边当着【小布莱克】的保镖，一边当着【杰西帕】的间谍，过上了让你自己满意的日子。同时，【杰西帕】还让你去查询了一家叫【劳伦造船厂】的倒闭和【老布莱克】之间的关系，一开始你有些疑惑，因为那是一家倒闭很久的老公司，在那个不正当竞争充斥的混乱年代，用一些手段来排挤竞争对手是再正常不过的事。随着调查的深入，你慢慢发现，当年【老布莱克】成立了一家皮包公司，收购了【劳伦造船厂】的股权，然后想办法令股价大跌，最终导致了公司倒闭，同时你也明白了【杰西帕】的意图，因为倒闭公司的老总正是她的父亲——管家【凯佛尔·劳伦】。但是，因为你手头还缺少一些详细的证据，所以你目前还没有向【杰西帕】报告此事。你也有一些不为人知的秘密。你其实是一个同性恋，工作之余，你经常偷偷出入当地著名的同性恋聚集地——一家名为Cowboy的酒吧，寻找着属于自己的私密乐趣。有一天，你在Cowboy意外遇到了一个“熟人”——【杰克】，他是你老板的一个黑帮朋友，你知道他们有一些生意上的往来。在这样一个特殊的地点相遇，你们都有些意外，但是相同的“秘密”让你们一拍即合，很快，你们两个就成为了情人。你觉得生活仿佛一直在对你伸出橄榄枝，现在，你有了不错的收入，也有了相合的伴侣。不过，一连串的变故，让你从幸福的美梦中醒来。【杰克】某一天告诉你，你老板【小布莱克】的父亲——【老布莱克】，当年害死了他的父亲，因此，他希望你能杀死他，为【杰克】报仇。与此同时，【杰西帕】也告诉你她已经达到了目的，准备解除和你的雇佣关系，并让你从【小布莱克】那里辞职。于是你买了一份巨额保险，唯一受益人是【杰克】，你计划在这件事后销声匿迹一定时间，这样如果警方认定人口失踪【杰克】就可以拿到一大笔钱，这仿佛是一个机会，为了你的真爱报仇，然后便离开这个是非之地......",
      "Script": "今天晚上，今天是你最后一天当【小布莱克】的保镖，也是你和【杰克】约好实施杀人计划的日子。",
      "Relationship": "【小布莱克】是名义上的老板，对你不错，他对你非常信任，甚至很多和黑帮联系之类的事情他都交给你去做，他和【杰克】的黑帮有一些私下交易。【山姆】的是【老布莱克】的私人心理医生，你知道【小布莱克】让他伺机打探【老布莱克】私生子的问题，同时尝试通过一些心理暗示来扭转【老布莱克】对【小布莱克】的态度。【杰克】是你的情夫，当地黑帮的头目，你和他深爱着对方，因而你会为了他去实施复仇。【安妮】是【杰克】名义上的妻子，你知道【杰克】并不爱【安妮】，虽然她也是一个可怜之人，但是你还是看她很不顺眼。【杰西帕】是你真正的雇主，她给了你和【小布莱克】差不多的工资，你为她监视着【小布莱克】的行踪，她究竟是为了什么不可告人的目的呢？",
      "Performance": "你必须公开：1、杰西帕在你这里学习的时候，成绩非常优异，包括求生、甚至格斗的一些技巧都很出色。2、你已经辞职了，这是你最后一天上班。3、如果你被怀疑，则必须公开：杰西帕指使你监视、调查小布莱克。",
      "Purpose": "1、不要让别人发现你和老布莱克的死有关系。2、不要让别人发现杰克和老布莱克的死有关系。3、不要让别人发现你和杰克有关系。",
      "Ability": "你的随身物品：1. 一份意外保险保单，保额是 2000万美金，受益人是杰克。保险合同明确注明，如果投保人失踪3年以上，受益人也可以获得保险金。（完成这件事时候，你准备让自己在世界上“消失”，这样对你和托特都好，如果能在因此而得到一笔钱，那就更好了。）2. 一张消费小票，内容是“玛格丽特一杯——cowboy酒吧”（cowboy是当地一家非常有名的同性恋酒吧。这是前几天你去消费的小票，你随手放进了口袋里。）"
    }
  },
  "第二幕": {
    "安妮": {
      "Story": "",
      "Script": "晚宴时分，所有人落座，你注意到【山姆】的表情紧张得有些不自然，你隐隐预感到要发生些什么，果然，【老布莱克】的死讯很快传来，你一愣神，然后内心的狂喜便不断涌现——一个大仇已经得报，Purpose就只剩下一个......",
      "Relationship": "【小布莱克】是你丈夫的“生意伙伴”，他的公司经营仰仗着黑帮的不法勾当，你和他本人没有太多来往，但是似乎他和他父亲的关系不太好。【山姆】的是【老布莱克】的私人心理医生，是你的情夫，同时也是害死你母亲的凶手，他曾经是一个花花公子，但是为了你似乎改变了很多。他答应为了你去杀人，今晚的一切也许就是他的杰作。【杰克】是你的丈夫，但是他其实是一个同性恋，所以你们只是形式上的夫妻，他虽然经常打骂你，让你讨厌，但是他为你还清了债务，所以你对他的感觉也是恩怨参半。【约翰】是【小布莱克】的贴身保镖，你只是偶尔见过他几面。【杰西帕】似乎是凯佛尔·劳伦的女儿，除此之外你并不了解。",
      "Performance": "你必须公开：1、认识凯佛尔·劳伦，并且父母曾经在凯佛尔·劳伦的公司工作。公司倒闭以后生活就变得很困苦。2、自己的母亲是因为医生的疏忽才死的。3、你其实和杰克的关系并不太好，她偶尔会打骂你。",
      "Purpose": "1、不要让别人发现你和老布莱克的死有关系。2、成功让两个以上的人怀疑山姆杀人。",
      "Ability": "你的随身物品：1. 一支口红和一支护手霜。奢侈品品牌，全球限量款。（女士的包里有口红和护手霜需要解释么？）2. 大量的现金。（从小到大你都深深的知道没有钱是多么痛苦，所以你会随时带着大量的现金，这是你安全感的来源。）"
    },
    "杰克": {
      "Story": "",
      "Script": "你让【约翰】从【老布莱克】卧室的窗台翻了进去，卸掉【老布莱克】的下巴，将他的手脚捆在床上，并给他注射了过量的肾上腺素，好让他心脏病发身亡。【约翰】做完这一切以后，你走进屋子，一遍欣赏着【老布莱克】痛苦地挣扎，一边阐述着自己的身份和经历，品尝着复仇的快感。不过你发现，【老布莱克】似乎指着墙上画，一直比划着什么，你狐疑地拿下那副画，发现了一个保险箱，你在【老布莱克】手势的指引下，打开了保险箱，发现里面有许多当年你父亲和船员们的合照，以及一些你看不懂的财务报表之类的东西。你转头想搞清楚【老布莱克】葫芦里卖的什么药，却发现他已经死了。你觉得【老布莱克】不配拥有你父亲的照片，于是拿走了所有的合照，匆匆挂好了画，就离开了房间。晚饭时间，【老布莱克】的死讯传来，你淡定地混迹在慌乱的人群中，毕竟，谁会想到你与这起案件有关系呢？",
      "Relationship": "【小布莱克】是【老布莱克】的儿子，现在继承了【老布莱克】的公司，你们有生意上的往来，你为他用不光彩的手段摆平了很多麻烦，他和【老布莱克】的关系似乎并不太好。【安妮】是你名义上的妻子，你和她没有太多感情，也没有太多生活上的交集，事实上，你也觉得她平日里对什么都不关心，只是个愚蠢的花瓶。【约翰】是你的情夫，一个退伍的雇佣兵，【小布莱克】的贴身保镖，你们真心相爱，并准备在这件事之后就帮助他销声匿迹。【杰西帕】似乎是【小布莱克】公司的财务，【约翰】曾经告诉你，她好像有一些经济上的问题。【山姆】是【老布莱克】的心理医生，同时也是当年因为疏忽导致【安妮】母亲死亡的罪魁祸首，但是那件事对你来说已经过去了，所以你和他现在并无交集。",
      "Performance": "你必须公开：1、你认为人如果做过坏事，总会遭到报应，你也是这样。2、你的淡定来自于你在黑帮的经历，在黑帮这样的事很常见。3、如果你被怀疑，则必须公开：小布莱克委托你在调查他父亲私生子的事。",
      "Purpose": "1、不要让别人发现你和老布莱克的死有关系。2、不要让别人发现你和约翰有关系。",
      "Ability": "你的随身物品：1. 一块怀表，指针已经停转但是似乎常被把玩，铜外壳被摸得锃亮。（你父亲的遗物。）2. 一张两个人合影的照片。背后有字“亲爱的老布莱克，我们的友谊地久天长。”落款是哈克。（这个害死你父亲的凶手尽然保留着这张象征两人友谊的照片，他不配，你要收回找张照片。）"
    },
    "杰西帕": {
      "Story": "",
      "Script": "你的父亲告诉你，【老布莱克】是一个老烟枪，每天都会抽大量的香烟，因此，你在前几天来访时，故意打破了【老布莱克】心爱的杯子，并且执意要买一个新的赔给他。今天，你就是带来了这个致命的礼物——一个涂上了剧毒氰化物的高脚杯。你不想让【老布莱克】在你面前当场死亡，所以你把毒药涂在了杯柄上，这样，【老布莱克】在用杯子喝完水后，就会在抽烟的过程中，将手上的毒药沾到过滤嘴上，从而因为摄入了氰化物而身亡。晚上，【小布莱克】邀请你参加他的晚宴，为了不引起怀疑，你被迫接受了这份邀请，并且焦急地等待着，不得不承认你将杯子放在【老布莱克】房中，并且当着他的面斟满美酒的时候，心中还有一丝忐忑，不过此刻，收起内心的不安，似乎是你可以收获成果的时候了......",
      "Relationship": "【小布莱克】是你的老板，你和他从小一起长大，你觉得他还算是个不错的人，虽然似乎结交了一些黑道的关系，但是那也是为了公司的利益。他似乎已经发现了你窃取公司财产的事，不过不知道是不是因为和你的私情，他并没有阻挠你，而你也已经爱上了他。他年轻时失手杀过人，他爸为了这事没少和他吵，不过那件事之后他已经改邪归正走上了正途。【山姆】的父亲是你父亲船上的船医，因此你们也在小时候就认识，他跟随他父亲走上了从医的道路，现在是【老布莱克】的私人心理医生。【杰克】是【小布莱克】在黑道的朋友，你并不是很喜欢这一类人，所以对他敬而远之，所幸的是，他并不像你想象的那样低俗、邋遢，所以总的来说，你并不讨厌他。【安妮】是【杰克】的妻子，你对她不甚了解。【约翰】是【小布莱克】的贴身保镖，这是一个退伍的军人，话不多，手脚麻利可靠，你当初为了监视他而安插了这个眼线，不过眼下，你似乎已经不再需要他了，所以你解除了和他的雇佣关系，同时也让他向【小布莱克】提出了辞职。",
      "Performance": "你必须公开：1、父亲的公司——劳伦造船厂曾经倒闭。2、接受过急救方面的训练，约翰是你师父。3、约翰当小布莱克保镖是你推荐的。4、父辈三人的关系。5、如果你被怀疑，则必须公开：小布莱克杀过人，这事儿他爸爸也知道。",
      "Purpose": "1、不要让别人发现你的杀人手法。2、不要让别人发现你贪污公款的问题。",
      "Ability": "你的随身物品：1. 一张购物清单，上面写的全是一些户外登山用具，和一些野外求生工具。（你参加的野外求生俱乐部下周有活动，你列出一些必要物品，准备过两天有时间把东西买齐）2. 一盒感冒药，还留下2片，看着和老布莱克卧室内散落的药品有些像。（这两天你一直被轻微的感冒困扰，所以随身有带感冒药）"
    },
    "山姆": {
      "Story": "",
      "Script": "你如同往常地给他准备了一些抗抑郁的药物，然后把他经常服用的心脏病药物换成了毫无作用的维生素。这样，只要他心脏病发作，就会因为得不到医治而病发身亡，这样这起案件看起来就可以和你毫无关系。你晚上应邀参加了【老布莱克】儿子【小布莱克】举行的晚宴，【安妮】跟着【杰克】也在席间。而【老布莱克】的死讯却突然传来，这让你觉得非常意外，因为根据你对【老布莱克】身体状况的了解，他应该没有那么快病发才对。你慌乱地思考着应对的方法，而此时，【安妮】脸上兴奋的微笑，让你隐约感觉到了一丝异样......",
      "Relationship": "【小布莱克】是老布莱克的儿子，现在继承了【老布莱克】的公司，你们童年时也经常见面，年轻时他曾经当过小混混，你们一定程度上意气相投，但是【老布莱克】对他恨铁不成钢，所以他们父子关系并不好。他让你在医疗过程中顺便调查一下他父亲有没有私生子，目前你仍一无所获。【安妮】是你的情人，也是你的幕后主使，你深深地爱着她，并对她毫无保留，而且你也相信，她也深爱着你。【杰克】是【安妮】的丈夫，当地的黑帮老大，时常打骂【安妮】，所以你非常恨他，他和【小布莱克】有一些生意上的往来。【杰西帕】是【小布莱克】公司的财务，她父亲是【老布莱克】船上的水手长，现在的管家，所以你们从小就认识，她是一个在各方面都非常出色的成功女性，你知道【小布莱克】一直很喜欢她。【科恩•帕克】是【赛伦•布莱克】的贴身保镖，你只是偶尔见过他几面。",
      "Performance": "你必须公开：1、你曾经是一个外科医生，因为一些意外转行当了心理医生。2、你父亲和杰西帕、小布莱克两人父亲之间的关系。3、你知道布莱克父子的关系不好，经常吵架。",
      "Purpose": "1、 不要让别人发现你和老布莱克的死有关系。2、 不要让别人发现你和安妮有关系。",
      "Ability": "你的随身物品：1. 护照。2. 两张明天凌晨的机票，登机牌的上的名字是山姆和安妮。（今天晚上此间事了，你就会带着耶达，坐凌晨的飞机离开这里，远走高飞。）"
    },
    "小布莱克": {
      "Story": "",
      "Script": "由于你和【杰克】在晚餐前要谈论一些“不方便让别人知道的事情”（你和黑帮的一些交易，以及追查私生子的事），所以你尽可能地减少了庄园内佣人的数量。同时，你的财务【杰西帕】当天也来到庄园看望她的父亲——庄园的老管家，而你父亲的私人医生山姆当天也来到庄园为你的父亲做定期的检查，由于你和他们两人从小就一起长大，所以你也就邀请他们一起参加了晚餐。你本来以为这会又是一个平常的夜晚，但是你的父亲就这么突然死在了自己的房间里，你想起自己的公文包里还有今天收到的有问题的财务报表，你立刻赶去查看，包里的东西都完好，然而，却意外多出了一个用过的针筒。整个下午你除了和【杰克】谈事情，便是在自己的房间里休息，你父亲的死和你并无关系，不过，你与父亲不和的事似乎并不是什么大秘密，所以虽然你从你父亲的死中获利甚多，但是你还是要小心，不要被人误以为自己是凶手。",
      "Relationship": "【杰西帕】是你的公司财务，他的父亲【凯佛尔·劳伦】也是你们家的老管家——也是当年你父亲船上的水手长，你们从小一起长大，而你和她之间的感情一直没能公开，因为你们的父亲似乎都非常反对你们在一起。因此，尽管她一直在贪污你公司的钱款，但是你却一直包庇着她。【山姆】的父亲是你父亲船上的船医，因此你们也在小时候就认识，他跟随他父亲走上了从医的道路，由于你的父亲目前患有抑郁症，所以他现在是你父亲的私人心理医生，你也拜托他想办法从你父亲那里调查一些关于私生子的情报。【杰克】是你在与黑道交往时认识的，他和你意气相投，因此和你私交不错，也让你在利用肮脏手段摆平公司事务时，少了许多麻烦。【安妮】是【杰克】的妻子，你对她不甚了解，但是他们夫妻感情似乎并不太好。【约翰】是你的贴身保镖，是你听从【杰西帕】的建议聘请的退伍军人，话不多，手脚麻利，守规矩，所以你很信任他。但是他这几天突然提出了辞职，这让你很困惑。",
      "Performance": "你必须公开：1、山姆曾经是一个花花公子。2、你年轻的时候个性不好，是你父亲让你走上正途。3、你父亲一直告诉你他有一件“年轻时做的让他后悔的事”。4、你父亲房里现在的杯子并不是他自己的，因为前几天杰西帕打破了你父亲的杯子。",
      "Purpose": "1、找到杀害你父亲的凶手，查出他的作案手法和作案动机。2、不要让别人发现杰西帕贪污公款的问题。",
      "Ability": "你的随身物品：1. 一张名片，是一家私人侦探社的。（调查私生子的事情一直没用进展，你想找私家侦探调查此事。）2. 一打财务报表，其中有很多红色铅笔做的批注，数额似乎都有些问题。所有的经手人都是杰西帕。（你刚收到新季度的财务报表，杰西帕经手的账目依然有问题，迫于父亲的压力，晚上你想找杰西帕谈一谈。）3. 用过的针筒。（你不知道这个针筒是哪里来的，你今天下午都没有和你的公文包在一起，所以你也不知道是否有人动过）"
    },
    "约翰": {
      "Story": "",
      "Script": "下午，当【山姆】医生给【老布莱克】做完常规检查以后，你从屋顶翻窗进入【老布莱克】的房间，身手敏捷地将他制服并卸掉了他的下巴，然后，为有心脏病症状的【老布莱克】注射了杰克事先准备好的过量的肾上腺素。由于你进来时打破了阳台上的一个花盆，于是你草草收拾一番，将花盆的残骸从阳台扔下，便回到屋顶，匆匆离去。然后，将用过的针筒放进了【小布莱克】的公文包，意图嫁祸给他。晚餐时间，【老布莱克】死亡的消息传来，习惯了杀人的你假装镇定，心理默默祈求这是你最后一次结束别人的生命......",
      "Relationship": "【小布莱克】是名义上的老板，对你不错，他对你非常信任，甚至很多和黑帮联系之类的事情他都交给你去做，他和【杰克】的黑帮有一些私下交易。【山姆】的是【老布莱克】的私人心理医生，你知道【小布莱克】让他伺机打探【老布莱克】私生子的问题，同时尝试通过一些心理暗示来扭转【老布莱克】对【小布莱克】的态度。【杰克】是你的情夫，当地黑帮的头目，你和他深爱着对方，因而你会为了他去实施复仇。【安妮】是【杰克】名义上的妻子，你知道【杰克】并不爱【安妮】，虽然她也是一个可怜之人，但是你还是看她很不顺眼。【杰西帕】是你真正的雇主，她给了你和【小布莱克】差不多的工资，你为她监视着【小布莱克】的行踪，她究竟是为了什么不可告人的目的呢？",
      "Performance": "你必须公开：1、杰西帕在你这里学习的时候，成绩非常优异，包括求生、甚至格斗的一些技巧都很出色。2、你已经辞职了，这是你最后一天上班。3、如果你被怀疑，则必须公开：杰西帕指使你监视、调查小布莱克。",
      "Purpose": "1、不要让别人发现你和老布莱克的死有关系。2、不要让别人发现杰克和老布莱克的死有关系。3、不要让别人发现你和杰克有关系。",
      "Ability": "你的随身物品：1. 一份意外保险保单，保额是 2000万美金，受益人是杰克。保险合同明确注明，如果投保人失踪3年以上，受益人也可以获得保险金。（完成这件事时候，你准备让自己在世界上“消失”，这样对你和托特都好，如果能在因此而得到一笔钱，那就更好了。）2. 一张消费小票，内容是“玛格丽特一杯——cowboy酒吧”（cowboy是当地一家非常有名的同性恋酒吧。这是前几天你去消费的小票，你随手放进了口袋里。）"
    }
  }
}