{
    "The Eastern Star Cruise Ship": "Two years ago, through his father's friend's introduction, Manager Xiu became the bar manager of the luxury cruise ship, the Eastern Star. Life on the ship filled him with a strong longing for a luxurious lifestyle. Later, he happened to meet his high school classmate, Liu Qi, who was then serving as the Third Mate on the ship. The two became closer over time. Not long after, Liu Qi proposed a secret deal to Manager Xiu, telling him that smuggling drugs via the cruise ship could yield huge profits. Manager Xiu accepted the offer. He began hiding drugs inside the boxes of fireworks, which were filled with gunpowder, under his management. Liu Qi would transfer 50,000 yuan to him each month. A year ago, the smuggling operation was discovered by the old Captain Yang Chenlin. Liu Qi killed Captain Yang and then forced Manager Xiu to testify falsely, leading to Liu Qi's acquittal. Terrified of Liu Qi, Manager Xiu bought a revolver for self-defense. After Captain Yang's death, Liu Qi was promoted to Vice Captain. Six months ago, Liu Qi told Manager Xiu that the profits from drug trafficking would increase, so he had Manager Xiu hide drugs in chocolates for delivery. For the money, Manager Xiu agreed. However, two months ago, the drug orders decreased significantly. When Manager Xiu asked for an explanation, Liu Qi ignored him. On the day of the incident, in the afternoon, while chatting with Crew Member Han in his room, Manager Xiu learned that she had been helping Liu Qi deliver the chocolates. Feeling betrayed, Manager Xiu confronted Liu Qi and sent a threatening text message. That evening, Liu Qi came to Manager Xiu's room, bringing the liquor that Manager Xiu liked as a peace offering. Manager Xiu found it suspicious, so he carefully examined the liquor and noticed a needle mark on the bottle cap. He poured the liquor into a silver cup, and when the cup turned black, he realized the liquor was poisoned. Liu Qi intended to silence him, just like he had done with the former captain. Determined to strike first, Manager Xiu went to the bridge to retrieve a bullet from the gun (everyone on the ship knew there was a gun there). Then, he waited for the fireworks to begin, slipped away unnoticed, and ran to the warehouse where Liu Qi was. In the warehouse, he saw Liu Qi with an injury on his back, and Manager Xiu shot him. The gunshot was masked by the fireworks. After the murder, Manager Xiu returned to his room and loaded the revolver with the bullet he had just taken. He hid the empty shell casing in a candle."
    ,
    "Night at the Museum": "Case Analysis\nThe Full Sequence of Events\nIn this case, the real murderer of Director Zhen is\n【Security Wei】\nMurder Process Analysis\nSecurity Wei, who patrolled the museum every day, was not a modern person. His true identity was the armor of General Borchu, who assisted Genghis Khan in founding the empire 800 years ago.\nThe resurrection spell recorded: Soaking Borchu's armor in the pure blood of Genghis Khan's descendants could revive him.\nIn October 2016, Director Zhen found Bai Xiao Ye's mother, Mu Bai, who had Genghis Khan's pure bloodline. He used her blood to soak the armor. After this ritual, Borchu was indeed resurrected, but unexpectedly, the spirit of the armor was also brought back to life.\nAfter Borchu's soul was revived, it attached itself to Manager Sa and woke up at the museum's entrance. Meanwhile, the spirit of the armor, taking a human form, woke up inside the museum. Director Zhen mistook the armor's spirit, Security Wei, for Borchu and kept pressuring him for the location of the tomb. Meanwhile, Borchu himself lived as Manager Sa and joined the museum as a guide in January 2017.\nSecurity Wei once gave Director Zhen a vague location from his fragmented memories, and unexpectedly, Director Zhen found a treasure. Feeling regretful, Security Wei grew increasingly frustrated. Before the incident, Director Zhen, unsatisfied with the burial items he had found, pressed Security Wei again for the main tomb's location to discover more treasures. He threatened to seal him back unless he complied. However, Security Wei, despite following Borchu for many years, only had partial memories and couldn't recall the tomb's location. Not wanting to be sealed again, and knowing Zhen's greedy nature and his intent to destroy the treasures, Security Wei decided to kill him.\nOn the day of the incident (February 17, 2017):\nAt 14:00, Uncle Bai picked the lock and took the wooden box containing documents about his mother from Zhen's room.\nAt 14:30, he left but forgot to close the door.\nAt 14:40, Manager Sa noticed the door was open, entered the room, and swapped Zhen's blood pressure medication with knockout powder from the museum exhibit.\nAt 15:00, Sa left.\nAt 15:00, Curio He entered Zhen's room, found the door open, searched, and took a box belonging to his father.\nAt 18:00, Security Wei brought a museum exhibit dagger to Zhen's room and noticed the broken lock. To avoid suspicion, he fixed the lock and then hid in a long wooden cabinet near the sofa, intending to ambush Zhen. However, he accidentally fell asleep.\nAt 18:30, Zhen returned to his room, noticed that the treasure box was missing, became furious, and suffered a medical episode. He took his blood pressure medication, now containing knockout powder, and fainted on the floor.\nAt 18:45, Security Wei woke up, saw Zhen unconscious on the sofa, locked the door, dragged him to the bathroom, and made him kneel by the bathtub. He then cut Zhen's wrists with a dagger to stage a suicide.\nAt 19:00, after letting the blood flow for a while, Security Wei was about to leave, but noises outside the door made him hesitant to open it.\nAt 19:05, Curio He arrived at the door and tried to open it but failed.\nAt 19:15, Manager Sa also tried to open the door but couldn't.\nAt 19:30, Mystery Ou came to the door, and at the same time, Detective Neighbour Gui arrived, ready to break in. Hearing the commotion outside, Security Wei quickly hit himself with an ashtray and pretended to faint on the floor.\n"
    ,
    "The Final Performance of a Big Star": "Tianchuan Li was nothing more than a despicable man. He paid Di Huang to frame Qingfeng Shan, leading Qingfeng to develop a drug addiction, and took photos to blackmail him into quitting the role, effectively eliminating his biggest competitor. Li also engaged in illegal activities, collaborating with Xiong Zhou, who ran a casino, to launder money for personal gain. He impregnated a model he used to date—Siqi Qi—but didn’t want the child. Even after she gave birth, he refused to acknowledge the child as his daughter, all to preserve his celebrity image and career. Recently, he may have fallen in love with Sha Wang, but his true love was always himself, and given his fickle nature, who knows how long their relationship would last? A year ago, Li even reported his own brother—Richard Li—to the police, leaving him with a criminal record. Now he pretends to support Richard and Johnny’s charity work, but in reality, he’s using their charity foundation to launder money. He’s also spun the narrative of his charitable support to garner publicity for himself—killing two birds with one stone.\n\nLast night, after the celebratory party, everyone went back to their rooms to rest. Li and Sha returned to their suite, as did Weiwen Han and Manli Shen. Li had arranged for Xiong Zhou to come to the hotel to discuss business, and Sha received a phone call in their suite from Di Huang, who was looking for Li. Huang had decided to confess all the bad deeds he helped Li commit to Sha, and they agreed to meet at the Fisher Bar. Afterward, Sha left to meet Huang. Not long after she left, Zhou arrived at the hotel and went up to the suite to meet Li. Their discussion didn’t go well, and the two had an argument. Manli Shen was woken up by the noise of their quarrel. Meanwhile, Sha, having learned of Li’s misdeeds, decided to confront him. Coincidentally, Li, having failed his business discussion with Zhou, was looking for Sha to comfort himself and called her to meet him in the empty banquet hall where no one would be after the party. However, Sha confronted him about his secrets the moment they met. Li decided to placate Sha and think of a solution later. But seeing through his false sweetness, Sha became completely disillusioned with Li and decided to teach him a lesson. She pretended to reconcile with him, luring him into undressing and sitting in a chair, then suddenly tied him up and left him there, walking away.\n\nThe night guard called a taxi for Sha when she left the hotel, and after she was gone, he went back to the office to slack off. He didn’t see Zhou leave the Fisher Bar after drinking a few more glasses, nor did he notice the figure in black entering the hotel—that person was Richard Li! Last night, Richard had been spending time with Johnny at home, but his brother ruined it all. Richard knew about Li’s money laundering for Zhou, and when Johnny mentioned the shady operations of Liyuan Financial Investments within their charity foundation, Richard realized Li was likely using the foundation as a cover for laundering. Furious that his brother had deceived him and dragged Johnny and the foundation into this mess, Richard’s mind was in chaos. After a brief argument, Johnny left the house in anger around 2 a.m. Richard then went to his brother’s bedroom and found the documents related to Liyuan Financial, confirming his suspicions. Remembering how his brother had previously reported him to the police, a flood of old and new grievances rushed through Richard. He took the gun from Li’s bedroom and headed to the hotel to find his brother.\n\nWhen Richard entered the suite, he found it empty. He then made his way to the banquet hall where the party had been held the night before. There, he saw his brother, naked and tied to a chair, begging for help. The sight of his own brother, in such a humiliating state, disgusted Richard. Overcome with shame, disappointment, and anger, he pulled out the gun and shot Li in the chest, ending the ugly scene before him, as well as Li’s life.\n\nLi Tianchuan’s death seemed shrouded in mystery, but when the layers were peeled back, the truth was clear. Sha Wang was the prime suspect, but she didn’t have a gun. She had been sweet with Li at the party and couldn’t have premeditated the murder by acquiring a gun in such a short time. After her conversation with Huang, she may have been motivated, but she left the hotel at 2:32 a.m., and there wasn’t enough time for her to find a gun and kill Li. Huang and Qingfeng Shan were hosting a party together at the time of the incident, surrounded by witnesses, so they had clear alibis. Siqi Qi didn’t want Li dead; she hoped he would acknowledge their child. Moreover, she couldn’t have left her baby alone at night to go kill him. Johnny had no motive to kill, as he didn’t know about Li’s money laundering. Zhou had an alibi; he was in the bar, seen by the bartender and other patrons, and the hotel’s surveillance confirmed his departure. He didn’t want Li dead; he wanted Li to continue laundering money for him. Zhizhi Lv had no motive either. He was blackmailing Li, and with Li dead, he would gain nothing. Furthermore, even if Li died, Zhizhi couldn’t replace him as the lead in ‘The Grand Canal.’ Manli Shen wouldn’t kill over harassment; she had already planned to resign. Weiwen Han had a gun at the hotel but had no motive to kill Li. Li was his ‘cash cow,’ and Han wouldn’t be foolish enough to kill him. Richard Li was the only one with a strong motive, the opportunity, and the ability to carry out the crime. Li had once reported him to the police, sending him to prison, and now he was pretending to support Richard and Johnny’s charity work while secretly laundering money through their foundation. When Johnny left around 2 a.m., Richard had no alibi afterward. Plus, since he lived with his brother, he could easily access the gun from Li’s bedroom."
    ,
    "Bride in Filial Dress": "The Past Story\nThe land of 'Baili Village' originally belonged to the owner of 'Falan Manor', **Meng Shen** (also the owner of 'Falan' Trading Company). **Meng Shen** was obsessed with chemical research and left many private affairs to **Du Housekeeper** (Du Huixin) in charge. The business of Suzhou Trading Company was managed by **Chen Qingwu**, and the land rent of 'Baili Village' was managed by **Yao Changshou**. **Du Housekeeper** trusted his assistant **Fang Chengshan** and arranged for **Fang Chengshan** and **Yao Changshou**'s family to live in the mansion in 'Baili Village' belonging to the **Meng** family. **Fang Chengshan**'s daughter **Fang Minyue** became the tutor of **Yao Mengren** and **Yao Zhongyi**, and fell in love with **Zhang Decai**.\n(1900) **Yu Beichen** found a batch of rare 'fluorite', and handed it to **Meng Shen** along with other ores. **Meng Shen** then asked **Du Housekeeper** to store it in 'Baili Village'. **Tian Hongjiao** introduced her fiancé **Fan Jin Kui** to her uncle **Fang Chengshan** to take on this job. **Fan Jin Kui**, along with the 'Li Brothers', opened a tunnel in the cave, located under the Western-style house in the northern forest of the village. Due to a lack of understanding of geology and dangerous operations, **Yu Beichen** immediately stopped them after seeing it, but it was too late, and a collapse occurred, causing the death of the 'Li Brothers'.\n**Du Housekeeper** covered up the truth. **Fan Jin Kui**, who insisted on seeking justice for his brothers, went to the villa to find him, causing an accident, **Du Housekeeper** died, and **Du Guicheng** returned to take over the position of the head of 'Falan Manor'.\n**Fang Chengshan** drew a map of the location of the buried items and intended to return it along with the key to the Western-style house to **Meng Shen**, but was kidnapped by his colleagues **Yao Changshou** and **Chen Qingwu** in the northern forest of the village, trying to take away the map from **Fang Chengshan**.\n**Fang Chengshan** was unwilling to hand it over to them, and was killed when he tore up the map, then was exchanged clothes with the fleeing **Fan Jin Kui**, disguised as his own body. **Yao Changshou** and **Chen Qingwu**, because **Meng Shen** was alive at the time, did not dare to dig up the treasure privately, so they took half of the map each. To show trust and to guard against each other, the two agreed on a marriage alliance between their children on the spot. **Fang Chengshan** was regarded as missing, and his wife took his daughter **Fang Minyue** to leave 'Baili Village' and went to Shanghai.\n(1901) After the owner of 'Falan Manor' **Meng Shen** was murdered (Du Guicheng was arrested as the real culprit and sent to the police station by Yu Beichen), **Chen Qingwu** and **Yao Changshou** embezzled the assets of the **Meng** family in Suzhou and 'Baili Village', but also started to guard against each other from then on, both wanting to monopolize the treasure, but both only had half of the map.\n(1903) **Yao Changshou**'s first wife **Mrs. Xu** used the balcony railing to kill the concubine **Zhang Yadi**, and then asked her husband to send **Zhang Yadi**'s son away, but she herself died of illness not long after. **Zhang Yadi**'s nephew **Zhang Decai** was arrested for theft before leaving the mansion and could not fulfill his promise with **Fang Minyue**.\n(1911) After **Yao Mengren** married **Tian Hongjiao**, **Yao Mengren** and **Chen Junmeng** got married. At that time, **Yao Mengren** had already had a rift with his father and yearned for the revolution - he took the opportunity to send his wife back to her parents' home and went to Wuchang privately. **Yao Changshou** was very scared, so he lied to the outside world that he had died of an infectious disease and wrote a letter to call back his second son **Yao Zhongyi**. At this time, **Yao Changshou** found the tunnel entrance in the forest according to the map, and in order to prevent people from discovering it, he built a fake tomb for **Yao Mengren** on it. **Chen Qingwu** suspected that this was related to the treasure, and immediately sent his daughter back to 'Baili Village'. **Yao Changshou** could only break through the back wall of the Western-style house and arranged for her to live in and 'mourn'.\nThe Current Story\nHalf a month ago, **Yao Changshou** fell from the first floor of the Western-style house, got toxic substances on his body and got sick. **Dr. Fang** could not prescribe the right medicine, and the illness became more serious due to taking 'sedatives' containing 'scopolamine'.\n'White-headed Snake' stole military supplies and used **Di Zhu** (Zhang Decai) to hide them in the tunnel, but was drunk by **Fan Jin Kui** and was therefore arrested. The 'half map' found on him was the one **Chen Shi Tian** stole from **Chen Qingwu**, and was taken away by **Fan Jin Kui** after killing him. Later, 'White-headed Snake' tried to escape and was shot dead by **Xu Boqing**, who had changed his name from **Yao Mengren**.\n**Xu Boqing**, as a Republic of China soldier, returned to the south and received an order from the army to investigate this 'arms trade', bringing the 'half map' to 'Baili Village' to wait for the capture of 'Golden Beard' (Fan Jin Kui) and 'Insider' **Di Zhu**.\nHints\n00, The motive for the murder came from the 'half map' held by the deceased (the blood on the map belongs to Chen Shi Tian, but Fang Minyue thought it was her father's). **Fang Minyue** was discovered while stealing, the deceased recognized her by the moonlight and wanted to hug **Fang Minyue**, but was mistaken by **Fang Minyue** as wanting to catch her, and she heard the deceased admit to killing 'the former owner of the map' (Xu Boqing refers to the 'White-headed Snake' who was executed on the spot, not Fang Chengshan), and in anger, she shot and killed the person. **Di Zhu** saw the door of the deceased's room open the first time she came out at night, and it was closed the second time, when the deceased was already on the balcony with Yao Zhongyi, and **Dr. Fang** sneaked into the deceased's room at this time. The expression of the deceased was horrified, because he recognized the person who shot him but did not believe that the other party would kill him.\n01, **Yao Mengren** has always liked women like **Fang Minyue** (independent, slightly masculine attire) since he was a child, which is why he pursued **Ling Yun** and asked his wife to decorate with 'balloon flower' and 'literary bamboo' when he got married. He is also a contradictory person. On the one hand, he yearns for the freedom and equality taught by **Fang Minyue**, on the other hand, because of his family background and many habits formed since childhood, such as the attitude towards his younger brother and servants - his previous private trip to Wuchang and giving up his military identity and responsibilities due to emotional frustration are also manifestations of willfulness and disregard for the consequences.\n02, The treasure buried by the **Meng** family mainly consists of 'sulfur' (to avoid poisonous insects, produces a blue flame when burned), 'saltpeter', and 'fluorite' (fluorescent).\n03, A total of four shots were fired, namely:\nI. (22:30) **Yao Zhongyi** fired an empty shot on the balcony with a 'special magazine pistol'.\nII. (23:00) **Ling Yun** hit the 'railing' with a 'special Hanyang rifle' on the second-floor balcony.\nIII. (23:00) **Dr. Fang** killed **Yao Mengren** with a 'special magazine pistol' in Xu Boqing's room on the second floor.\nIV. (00:30)Renyu Hu hit the 'white scarf' with a 'horse brand submachine gun' outside the door.\n04, Yao Mengren recognized Fang Minyue before being shot.\n05, The dust raised when Yao Changshou fell in the Western-style house contained sulfur and fluorite dust, which stuck to Chen Junmeng.\n06, The handwriting on the 'note' received by Ling Yun and the 'last letter' given by Zhang Decai to Dr. Fang are the same, both written by Di Zhu (Zhang Decai).\n07, Among Uncle Gui, Dr. Fang, and Dr. Yu, only Uncle Gui really has a medical qualification.\n08, The one confronting Ling Yun on the balcony was the Mysterious Figure disguised by Di Zhu, and the 'three pieces of camouflage' are 'sunglasses' (left in Di Zhu's room), 'black bowler hat' (picked up by Yao Zhongyi, containing a message sent by Chen Junmeng through a carrier pigeon), 'white scarf' (thrown down by Di Zhu, hit by Renyu Hu's gunfire, and left on the body after dragging the body).\n09, Di Zhu ignited the fire by igniting the chemical substances mixed in the soil, causing a big fire and toxic smoke.\n10, Renyu Hu's name comes from 'Golden Beard'.\n11, Uncle Gui smoked 'opium' in the room, and Madam Hong inhaled it after entering the room, causing hallucinations.\nThe timeline of that night\nDr. Yu woke up at 23:00\nDr. Yu pushed someone off the balcony at 23:10\nDr. Yu was active on the balcony at 23:20\nDr. Yu returned to the room at 23:30\nDr. Yu fell asleep at 23:40\n\nChen Junmeng touched the hand at 21:30\nChen Junmeng took out the gold lock at 21:40\nChen Junmeng heard the gunshot at 22:30\nChen Junmeng heard the gunshot at 23:00\nChen Junmeng heard the fall at 23:10\nChen Junmeng heard the fall at 23:40\nChen Junmeng went out at 23:50\nChen Junmeng returned to the room at 00:00\nChen Junmeng heard the gunshot at 00:30\nChen Junmeng heard the conversation at 00:40\n\nRenyu Hu heard at 23:00\nRenyu Hu witnessed the push at 23:10\nRenyu Hu returned to the room at 23:20\nRenyu Hu saw Chen Junmeng at 23:50\nRenyu Hu hid at 00:00\nRenyu Hu left the old house at 00:10\nRenyu Hu saw Madam Hong at 00:20\nRenyu Hu fired at the scarf at 00:30\nRenyu Hu moved the body at 00:40\nRenyu Hu went to the master bedroom at 00:50\n\nLing Yun fired on the balcony at 23:00\nLing Yun returned to the room at 23:10\nLing Yun opened the door to look at 23:20\nLing Yun went downstairs at 23:50\n\nYao Zhongyi took the fish at 21:50\nYao Zhongyi went upstairs at 22:00\nYao Zhongyi went to the balcony at 22:10\nYao Zhongyi fired and threw the gun at 22:30\nYao Zhongyi was in a trance at 22:40\nYao Zhongyi saw the body at 23:00\nYao Zhongyi wanted to go downstairs at 23:10\nYao Zhongyi knocked on the door with the fish at 23:20\nYao Zhongyi returned to the room at 23:30\nYao Zhongyi picked up the bowler hat at 23:50\nYao Zhongyi looked for Chen Junmeng at 00:00\nYao Zhongyi ran away at 00:10\nYao Zhongyi went to the master bedroom to look for medicine at 00:20\nYao Zhongyi saw Madam Hong at 00:50\n\nUncle Gui pondered over the condition at 22:00\nUncle Gui looked for Madam Hong at 22:10\nUncle Gui went to the living room at 22:20\nUncle Gui smoked opium at 22:30\nUncle Gui saw Madam Hong at 22:40\nUncle Gui smoked opium at 23:10\nUncle Gui saw the body at 01:00\nUncle Gui moved the body at 01:10\n\nMadam Hong went to get sleeping pills at 21:30\nMadam Hong put sleeping pills at 21:40\nMadam Hong went to look for more medicine at 21:50\nMadam Hong looked for Dr. Fang at 22:10\nMadam Hong was called away at 22:20\nMadam Hong went to the living room at 22:40\nMadam Hong went to the kitchen at 22:50\nMadam Hong found the fish was gone at 23:00\nMadam Hong picked up the gun at 23:10\nMadam Hong looked for Uncle Gui at 23:20\nMadam Hong heard a noise at 23:40\nMadam Hong was scared at 23:50\nMadam Hong saw Renyu Hu at 00:20\n\nDr. Fang talked about the condition at 22:10\nDr. Fang entered Xu Boqing's room at 22:20\nDr. Fang fell from the sky at 22:30\nDr. Fang saw Xu Boqing at 22:40\nDr. Fang robbed at 23:00\nDr. Fang calmed down at 23:10\nDr. Fang heard a knock at 23:20\nDr. Fang returned to the room at 23:30\nDr. Fang saw the body being moved at 00:40\n\nDi Zhu saw Fang Minyue at 22:10\nDi Zhu disguised and stuffed a note at 22:20\nDi Zhu waited on the balcony at 22:30\nDi Zhu was at 22:40\nDi Zhu heard a shout at 22:50\nDi Zhu was scared at 23:00\nDi Zhu was hit by someone on the railing at 23:10\nDi Zhu saw the body when returning to the room at 23:20\nDi Zhu took tools to clean at 23:30\nDi Zhu pushed the body down at 23:40\nDi Zhu took the cleaning tools at 23:50\nDi Zhu threw the white scarf at 00:30\n\nChen Anqiao went to the balcony at 21:50\nChen Anqiao hid at 22:00\nChen Anqiao heard the gunshot at 22:30\nChen Anqiao ran back to the servant's room at 22:40\nChen Anqiao heard the gunshot at 23:00\nChen Anqiao kicked the gun at 23:10\nChen Anqiao saw Dr. Yu at 23:20\nChen Anqiao rested at 23:50\n\nXu Boqing went to the balcony at 22:10\nXu Boqing insulted at 22:20\nXu Boqing fell off the balcony at 22:30\nXu Boqing got up at 22:40\nXu Boqing called for help at 22:50\nXu Boqing was killed at 23:00\nXu Boqing fell into Di Zhu's room at 23:10\nXu Boqing's body was pushed down at 23:50"
    ,
    "Raging Sea of Rest Life": "On that day, besides Little Black, Jessipa was the first to arrive at the manor. Old Black had caused the collapse of her father's Lauren Shipyard, changing her family's previously affluent life. Therefore, she and her father conspired to take revenge on Old Black. She used her financial identity to steal a large amount of property from Black's family business and pretended to be with Little Black to provide convenience for herself. However, in the process, she gradually fell in love with Little Black and even became pregnant with his child. But the grudge could not be left unsettled. According to her plan with her father, she deliberately smashed Old Black's beloved cup a few days in advance and promised to give him a new one. She knew that Old Black was a heavy smoker, so she coated the handle of the cup with highly toxic cyanide. In this way, when Old Black finished drinking with this cup, he would die of poisoning from the filter mouth after smoking with his hands contaminated by the poison. At this time, Jessipa should have already left the scene of the crime. Even if the cup was given by her, she could pretend to be unaware to escape the blame. So she gave the cup to Old Black in the room this afternoon and deliberately filled it with fine wine before leaving. However, Jessipa's perfect plan encountered a problem. Old Black didn't touch a cigarette at all that day. Because Dr. Sam came to the manor that day to conduct a regular psychological examination for Old Black. Although he was just a psychologist, Old Black restrained himself from smoking to avoid being repeatedly reminded by the doctor. However, Sam also had his own plan. He was instigated by someone to kill Old Black. Old Black suffered from a more serious heart disease, so Sam secretly replaced Old Black's heart medicine with common cold medicine after the routine examination. In this way, as long as Old Black had a heart attack, he would die due to lack of treatment, and Sam could extricate himself from the incident and fly away with his beloved that night. And this beloved person, who instigated him to commit the murder, was Annie. Annie's married life with Jack was not happy, so she has been having an affair. Sam was her lover. Annie's childhood was not happy. After her parents' company went bankrupt, her mother was seriously ill, and life was hard. Soon her father died, and she married the gang leader Jack for money. Her mother was treated, but the good times didn't last long. Her mother died in a medical accident, and Annie became lonely and helpless. Life with Sam was quite pleasant, but she suddenly learned that the medical accident that caused her mother's death was caused by Sam, and the one who caused her parents' company to go bankrupt was Old Black. So she came up with a double-edged plan, asking Sam to help her kill Old Black in the name of affection, and then figuring out how to let Sam be caught and convicted, and then she could clear her relationship with her, and Sam also agreed to the request to kill after hesitation. Annie cleared most of the evidence between herself and Sam, waiting to harvest the results of her plan. However, this plan was disrupted by another person, which is Annie's husband - Jack. Jack is actually a homosexual. He married Annie just because he needed a wife on the surface to cover up his true sexual orientation. Jack lost his father at an early age. His father was an old captain. His mother told him that his father died in a maritime disaster, so he had a very hard childhood as an orphan and a widow. Not to mention that his mother also passed away when he was young. After he mixed into the underworld, he worked hard to climb to his current position, and then by chance, he learned that his father was actually murdered that year, and the one who killed him was the first mate on his ship, Old Black. Because he and Little Black have a lot of business dealings, it is not difficult for him to carry out a revenge plan. After Sam left Old Black's room, Jack sent someone to break in from the roof, subdued Old Black, removed his jaw to prevent him from calling for help, and then injected him with an excessive amount of adrenaline, causing him to have a heart attack and die in agony. Jack watched Old Black struggle, but found that Old Black was pointing to the sea map on the wall and seemed to want to say something to him. He took down the sea map and found a safe box behind it. Under Old Black's guidance, he opened the box and saw a bunch of financial reports that he didn't understand. While flipping through them, he found a photo of his father and Old Black. He was very angry and felt that Old Black didn't deserve to have such a photo. He turned his head and found that Old Black was already dead, so he hastily restored the sea map, took away the photo, and left the room. The one who helped him carry out the murder plan, the real murderer - John. John is a retired soldier and a homosexual. He was previously hired by Jessipa to serve as Little Black's bodyguard, monitoring Little Black to facilitate Jessipa's actions. He accidentally met Jack, and the two hit it off. After understanding Jack's situation, he was willing to contribute his skills to carry out the murder plan, and bought insurance in advance, ready to disappear for a while after the deed was done, both for safety and to deceive a large amount of insurance money. Today is his last day before resignation. He did everything that afternoon, put the syringe into Little Black's bag to frame him, and then prepared to disappear from the world. So, although Jessipa and Sam both implemented their murder plans, the real successful murderer is John, and the mastermind behind him is Jack. As for the past events, in fact, the first mate Old Black at that time had an affair with the captain's wife and gave birth to Jack. In that maritime disaster, the ship's doctor, the boatswain, the first mate, and the captain survived. They used the remaining resources to build a raft, but the raft was only enough for three people. The strongest of the four people were the first mate and the captain, so the ship's doctor and the boatswain Lauren threatened the first mate to help them get rid of the captain so that the three of them could survive, otherwise they would tell the captain about the affair and let the captain get rid of the first mate. The first mate thought of a way to compromise at the time. He knocked out the captain, left water and food, and planned to rescue the captain after being rescued. However, when he came back, the captain was still dead on the deserted island. This incident made him very self-blaming. After returning, he wanted to divorce his wife and marry the captain's wife, but the captain's wife not only refused but also took Jack and left him. In order to take revenge for the past, he secretly used means to collapse Lauren's company and made Lauren serve under him as a butler. Many years later, he accidentally met Jack, who had mixed into the underworld. He found that this was very likely his lost son, so he secretly funded Jack while secretly investigating him. Now, he has found out that Jack is his biological son, but before he had time to recognize each other as father and son, the tragedy happened..."
    ,
    "Li Chuan Strange Talk Book": "Li Chuan Strange Talk Book: Matsuo Ichiro was born in Tokoyo, and after growing up, he met Yoshiko under a tree and they later became husband and wife. Their life was very happy. Yoshiko not only had a lovely daughter named Tsuki, but was also pregnant with Hiyori. Suddenly, the conscription officers came to this peaceful village, and without any chance to refuse, he was sent to the battlefield. It was the most terrifying experience. The thoughts of the powerful had nothing to do with these ants at the bottom who were fighting desperately. On the battlefield, if he wanted to survive, he had to swing his bayonet with all his might, but the moment that cold object pierced the soft flesh of the other side, he often wondered, who was the other person? Did they also have a wife, like Yoshiko, waiting for her husband's return at home alone? The smell of blood and decay always surrounded him, and no matter how hard he tried, he could not wash them away. He just wanted to be an ordinary person, but when he looked back, he found that he had already stained his hands with blood. The war finally ended, and Heike no Shigekata failed. Everyone was busy escaping, but he just wanted to get back to Tokoyo quickly. Climbing mountains and crossing ridges, the long journey was not considered hard. But Tokoyo seemed to have disappeared from the world, no matter how he searched, he could not find a trace. It was not until this time that Matsuo Ichiro realized that there was something more desperate than the battlefield; he could not go home. No matter what, he wanted to be back with Yoshiko and the children, so he never gave up searching for Tokoyo. Time bent his spine, but it could not extinguish the fire in his heart. Later, a spirit collector who had a connection with him was moved by his persistence and gave him a blueprint called 'Chasing the Rainbow'. 'Chasing the Rainbow' could take him back to Tokoyo, but at the same time, it blurred all memories of Yoshiko and Tokoyo. In his impression, he was a stubborn old man who spent most of his life chasing those illusory and fleeting rainbows. He finally returned here, but no longer remembered the reason why he had been searching for this place so hard. By chance, he was taken in by a young man and brought home. The old and the young, these two lonely souls thus formed a new and strange family and lived their lives. Ichiro met Yoshiko again, sitting with her every day under the big locust tree at the entrance of the village, but no longer recognized each other. And Yoshiko, after getting to know and fall in love with Ichiro under the tree, was opposed by her family. After breaking off the relationship with her family, she finally established a happy family with Ichiro. She also changed her surname from Takeuchi to Matsuo according to tradition. Later, the conscription officers took Ichiro away, and she was left to take care of the young Tsuki alone. What made things worse was that she suddenly found out she was pregnant again. Every day she was looking forward to her husband's safe return. The flow of meaning began to make trouble, and the priest agreed to trade with Heike no Shigekata on the condition of sealing Tokoyo. Once the barrier was set, the wanderers outside would never be able to return home. Everyone was silent, only Yoshiko was protesting. No matter how hard she ran and shouted, she could not wake up the crowd who pretended to be deaf and blind. Nothing could be changed, this was the bloody reality. The barrier had been set, but she still refused to give up. The priest, fearing her actions, stole the power of the male and erased all her memories about her husband Matsuo. The incomplete memories smoothed her edges and changed her character. She became someone who acted on instinct all day, sitting under the tree every day, daydreaming. Although she could not remember anything, her body still drove her to wait for the person who would never come back. Those who once dared not even look her in the eye now began to bully her. The child became the entirety of her life. Despairingly, Hiyori was stabbed to death by Heike no Shigekata. Her relationship with Tsuki also gradually deteriorated. In order to avenge Hiyori, she bravely assassinated Heike no Shigekata. Unexpectedly, what appeared in front of the public was always the shadow with the ability to stop time. Ichiro happened to save her and also gave her the treasure umbrella for self-defense, which allowed her to save her own life. Then, Chihara, Chihara's father also left Tokoyo due to conscription, and her mother, in order to protect Chihara, chose silence when trading with Heike no Shigekata. The decision had been made, but she could not face such a cruel self, so every time Chihara asked about her father, she vaguely passed the matter. Because of her physical condition, she passed away when Chihara was very young. Since then, Chihara has been living alone. In order to survive, she learned about human relationships very early and lived every day under the scrutiny of adults. By chance one day, she met Hiyori who was being bullied. The timid her chose to escape and turned away from the scene of bullying. Since then, she has been tormented by guilt. Unexpectedly, Hiyori not only did not blame her but also wanted to be friends with her happily. The two innocent little guys quickly became best friends, experiencing their own little adventures together. Hiyori was a child with a strong curiosity and always wanted to pull Chihara to explore the ventilation building. After observing for a long time, he finally found a gap in the guard shift, and excitedly asked Chihara to join him. At that time, Chihara refused Hiyori's proposal for other matters, but did not expect that Hiyori would leave this world forever. Chihara became a person again. A long time later, she found the fainted Lang in a corner of Tokoyo. After several tests, she finally trusted him and no longer lived a life of suspicion. Later, she saw the ghost's hundred ghost eyes, which could communicate with ghosts, and entrusted Chihara to send the soul lily to those ghosts. If they accepted and took good care of it without telling the truth to the ghosts' relatives and friends, and let the flower bloom for two days, they would have a chance to see the person they missed for one minute. However, all the people who received the flowers, including Sa Yuan Chihara, did not accept and cherish these flowers. (The one who sent flowers to Yoshiko and Tsuki was the deceased Hiyori, and the one who sent flowers to Keita, Jing, and Zi was Kitahara Nao. The reason why Nao knew the name Keita was because Keita and the person he played as Shige mentioned his wish to be called Keita in the next life, to be a child of a fishing family.) Hoshino Atsutada, for the first eighteen years of life, has always been imprisoned in a small stone room underground, and the relationship with Keita is not too bad, but because of the opposing fate, it has never been close. Loneliness is a problem he cannot avoid. In his impression, the one who accompanied him the most was the female ghost Yuki, who was eager to scare him with a new bloody appearance every day. At first, he was also scared and very resistant to Yuki, but after a long time, he gradually got used to her existence, and sometimes even confided in Yuki the troubles he could not tell others. Snow mother accompanied Atsuta day by day. After witnessing the growth of this young man, she gradually fell in love with this single young man, and she did not mean to scare Atsuta, but went to see her sweetheart every day with careful dressing, but because of the misunderstanding caused by the spirits' misunderstanding of humans. Later, when Atsuta could not repair the divine water world with the heart spell, it was also Yuki who helped repair it. Hoshino Kyoko, as the chosen branch of the twin grass, had no name and grew up under the pressure of the Hoshino family. His father was very cold and only raised her as a tool for the main branch. The twin sisters also treated her badly because of the opposing fate, so she never felt any family affection since she was a child. In her growth process, she met Kitahara Nao. Originally, she was the main branch of the pupil's fiance, and she contacted him with the main branch, and also felt sincere care for the first time in her life. The two people grew up together, and similar destinies made the two fall in love slowly in the process of getting along. Unfortunately, before the inheritance ceremony came, her father found out about the two people's secret meetings. In a fit of anger, he scolded and beat the pupil, and despair prompted her to escape this cold family. She left the building in a small boat, but unexpectedly fell into the water and was taken back by her father.Because of the drowning incident, she formed a beautiful bond with the spirit of Lan Chuan, Qin He. Unlike other monsters in the river, it was not satisfied with devouring spirits, but instead wanted to sustain itself by consuming the positive emotions willingly provided by its host. The child became its ideal prey, and it had been silently observing the life of Tongzi. Finally, at the moment when Tongzi was about to be burned to death during the inheritance ceremony, it extended its helping hand. After obtaining Tongzi's consent, it stole the true power of Lady Gouyi in exchange for all of Tongzi's future positive emotions, swapping the soul of the branch child with the main branch. This allowed Tongzi to live on in the body of her twin sister. Just as she thought she could live happily with Nao, she found her life quietly stepping into another abyss. She could no longer feel any positive emotions of joy or happiness, and could no longer even love someone. Numbness and indifference filled her entire life. No matter facing her husband or her own children, she could not muster a smile. Her marriage to Nao, although respectful, was not happy. In her eyes, everything had lost its luster. Nao could feel the change in Tongzi but could not find any reason. In his eyes, he could only simply think that Tongzi did not love him. Later, when the flow of oblivion invaded, the god official who should have protected the people, Liangzi, had no offensive Onmyodo because of his branch status. To conceal his identity, he could only hide in the Qi Building under the pretext of continuing to take care of the children. In the end, when the flow attacked the Qi Building, she narrowly escaped because her father discovered her true identity as a branch and locked her in a secret room. After being released, she learned that her husband Nao had been injured by bandits and died in the lake. Although Tongzi could not feel positive love, when she thought Nao was dead, she was overwhelmed by immense grief. The frozen love, at this moment, was transmitted in reverse to every nerve of the child. It was then that she realized that her love for Nao had never changed. Later, she decided to avenge Nao, and the arrival of Pingjiang Gate gave her a perfect opportunity. Blinded by hatred, she agreed to Pingjiang Gate's demand to establish the divine water realm. As a god official guarding the eternal world, she personally abandoned those people who were forced to join the army to protect their families. Fear made people crazy, and almost everyone tacitly approved the two people's transactions. The divine water realm was quickly spread over the eternal world. Only one woman was an exception, Matsuo Ryoko. She ran and scolded on the streets every day for her husband, denouncing the silence of the weak. Tongzi was worried that if she continued like this for a long time, it would inevitably affect people's hearts. However, she once again helped to smooth out the trouble, stealing the power of the male field and erasing all of Ryoko's memories about her husband. Everything returned to calm. In fact, Nao did not die. The truth was that her father, in order to protect the secrets of the twin taxes of the Hoshino family, forced Nao to commit suicide and jump into the lake. Fortunately, Nao was very good at swimming. Jumping into the water gave him a glimmer of hope. After being rescued by the villagers, he disguised himself as an old man named Mao Shu and secretly entered the Hoshino family to explore its secrets. Later, he finally gained the trust of the child's father and understood the truth. As a father and a husband, he chose to stay here and protect his loved ones in another way. In the long years when Doujing and Keita lived, the care that Fengzi could not provide was also given by the identity of Mao Shu. Time finally came to the inheritance ceremony. Mao Shu knew he could save Keita, but if the Hoshino family did not find a body when checking the fire scene, Keita would never have a peaceful day. So as a father, for the sake of his child, he was willing to sacrifice himself. He arranged in advance to have the carpenter put his body into the sandwich layer of the wooden box and then commit suicide. In the fire scene, he could become the burnt corpse and replace Keita to be found by the Hoshino family. As she wished, he saved Keita and left this world quietly and forever. The child outside the field was completely unaware, and because she thought Keita died in the fire, she once again felt the reverse impact of her love for her son. Over the years, she never praised her husband and Keita, but now she looked at the fire scene and cried like a child. She loved this lively child so much, but she never knew it.Keita, as the new vice branch of the Hoshino family, has known since he was a child that he will die at the age of eighteen, but he is still optimistic and curious about the world. Perhaps because it is rare, he cherishes it even more. He treats his life very seriously and tries his best to meet the beauty of this world. Every night, he would ask Mao Shu to let him go out to play, and it was this opportunity that allowed him to meet Yue He. Under Keita's cheeky demeanor, the two gradually became friends and later developed into an ambiguous relationship. However, knowing his own destiny, he never dared to reveal his true feelings. Later, as the inheritance ceremony was about to arrive, Keita asked Yue He to meet under the flower tree, wanting to say goodbye to her properly. Unexpectedly, due to the effect of the twin grass, his skin became transparent, and as Yue He approached, he was afraid of scaring her, so he could only hide in the nearby bushes. That night was very quiet, and he silently accompanied Yue He until dawn. At the inheritance ceremony, he resigned himself to entering the fire. Unexpectedly, he found a corpse in the wooden sandwich layer, understood Mao Shu's intention, and found a jade fake with the name of the child carved on the corpse. Too much information made him unable to react. At that time, it was already dusk, and his body had become transparent. He could have taken advantage of the chaos to escape from the fire, but he was too shocked to move. His spirit, Tang Nan, urgently used his ability to erase his memory of seeing all this. In the panic, he urged him to leave here quickly. The jade pendant was taken away from the fire by Keita. He who had spoken silently guarded Yue He's side, protecting her from being rescued by others. The stones that were inexplicably bounced and the quilt that rose out of thin air were actually proof left by the transparent person, Keita.Yue He, born in a nameless family since childhood, has never seen her own father's side, and she also has a mother who seems a bit late. Because of her family, she has been bullied by people around her since she was a child. The only one who can give her love in life is her own brother who is as cheerful as the sun. But I didn't expect that a visit to the ceremony would take away her brother's life. Her relationship with her mother also began to deteriorate, and life became silent. Later, she met Keita underwater, and the two became friends, gradually developing into a warm relationship. Keita is careless and often gives Yue He things with the Hoshino family emblem, so she guessed the identity of the Hoshino heir early on. From the beginning of the two people's contact, she had already foreseen the end, so she was counting down to the two people's parting every day. On the day of the cherry tree date, Yue He had already had a premonition in her heart. The inheritance ceremony was approaching, and perhaps this was the last time the two met. Unexpectedly, Keita didn't show up at all, but because she had been preparing in her heart. In the end, she sensible, she silently bid farewell to Keita under the tree.Perhaps due to the interruption of the Hoshino bloodline, the barrier that trapped you in the House of Breath began to gradually lose its effect. After an unknown period, you finally escaped from the House of Breath, and everything in the world has changed. Spirits and humans can now traverse the lake and move directly between the eternal night and the human world. The Divine Water Party also dissipated with the death of Lord Pingjiang. The entire world has once again become tightly connected with this world. Excessive freedom is always accompanied by uncontrollable indulgence and madness. Without the constraints of the barrier, spirits use their abilities to act recklessly among humans, and ambitious people have also come with the wind, brutally killing and capturing those spirits with strange abilities. The contradictions between races are intensifying, and it seems that they are about to go to war. The Hoshino family has long since declined, and no one can stop it. The peaceful life of all people and spirits in the world has been shattered. Amidst the chaos of war, the House of Breath, which has lost its magical power, has long since sunk to the bottom of the lake. No one has ever discovered that in this building, there are several cold bodies tightly leaning on each other."
    ,
    "Fox Hotel": "Act One Ending\nAfter Xiao Nuan entered\nInari God: Let me think about what tasks are still unfinished? Oh right, the dark clouds and curse of the Snow Woman. You must be very curious about what happened to the Snow Woman's mother, right? Let me calculate~ (pretending to calculate)... it turns out like this~ This matter is actually related to your father, Sky Dog~ They were... in love? No, wait... it doesn't seem like that... Hmm~? What I sense is justice, the power of protection. Oh...(nodding thoughtfully) So that's how it is, Sky Dog's father received a task to eliminate the emotionally unstable Snow Woman of Mount Fuji. However, his father was a very upright person; he believed that no matter the reason, one should not deprive others of their right to live. But when he arrived at Mount Fuji, he found that the Snow Woman's mother had lost control of her emotions and magic, freezing everything within a hundred miles and causing many deaths. His father realized that he could not continue to let the Big Snow Woman rampage, or more innocent people would die. His father knocked out the Big Snow Woman and took her to a place beneath Mount Fuji, filled with magma. He used the power of the magma to seal the Big Snow Woman's uncontrolled magic. However, he feared that the magma might harm her. So, he used his own magic to create a protective shield, placing her mother inside. For many years afterward, the two of them screamed crazily: Let me out! I want to kill all the men in the world! The other one calmly persuaded: Calm down a bit...\nAnd so many years passed, until his father was about to exhaust his magic, and his hair and wings turned white. Finally, the Big Snow Woman realized that this protective shield was not imprisonment but protection. The Big Snow Woman was finally willing to calm down, gently telling Sky Dog's father: Let me down, I am willing to calm down, I... I want to go home, I miss my daughter. At this point, Sky Dog's father upheld his justice and completed his mission. So, Snow Princess, the curse on your mother has actually been lifted. Because Sky Dog's father was sincerely protecting your mother. Then let me break your curse! ...Eh? Your curse has also been broken? Who did it? Nopperabo? Let me see... (pretending to be a fortune teller) Hmm... Nopperabo indeed did a lot for you... But what I see is a red, furry little paw! It knocked repeatedly on an ice-locked door... The little paw was covered in frostbite and small wounds, but it kept knocking persistently... Finally, it knocked open that ice-locked door and the heart of Snow Princess. That paw-shaped biscuit warmed Snow Princess's long-frozen heart... So, Snow Princess, do you know who broke your curse? Yes, who says only love can break a curse? Friendship can also warm the coldest ice in the world...\nNow for the last matter! (Asking in the order of Yuko—Sky Dog—Nopperabo—Xiao Nuan—Snow Princess—Fox—Raccoon Cat: Do you think Wind Ichirou's cooking is delicious! Everyone must answer that it is delicious) I, Inari God, also think it is delicious! So, Ayu, do you think Wind Ichirou's cooking is delicious? (Waiting for Ayu to answer delicious) So Ayu, Wind Ichirou has fulfilled his promise to you~ Are you willing to accept him? (Waiting for Ayu's response)\nThen let us see everyone's ending~ Wind Ichirou followed Ayu to her White Fox Village. Little Bai saw Ayu and immediately jumped into her arms, crying: Mom, you're finally back! Wind Ichirou and Ayu opened a restaurant in the village, and brought Wind Ichirou's parents over. The whole family lived happily there. Yuko no longer had to see the world through two small holes. She flew with Sky Dog to every corner of the world, touching the cherry blossoms of spring, flowing through the summer streams, stepping on the autumn leaves, and treading on the snowy white winter. Sky Dog often took her to White Fox Village to visit Sister Ayu and Brother Wind Ichirou. The Snow Woman returned to her ice cave at home. After a long absence, her mother saw her and immediately hugged the Snow Woman, crying: Daughter, I’ve made you suffer, I'm sorry, Mom won't go anywhere anymore and won't lose her temper again. Mom will stay home and be with you. Snow Princess bravely took on the responsibility of guarding Mount Fuji, happily living with her mother. Although Lord Nopperabo no longer had the great place to scrounge food, Mount Fuji is not far from Kyoto~ Lord Nopperabo often runs to the ice cave at the top of Mount Fuji, wondering what’s so good to eat in that icy world? As for Xiao Nuan, although she was taken by Inari God to fan for five hundred years, Inari God must eat, sleep, and play cards against monsters~ So there are always people seeing a little red figure sneaking down from the divine realm, sometimes running to Ayu's restaurant in White Fox Village to eat, sometimes going to the top of Mount Fuji to deliver paw biscuits, and sometimes playing kites in a big courtyard in Kyoto with a long-headed monster~ This whole family of the Fox Hotel sometimes agrees to meet on Inari Mountain during the cherry blossom season to enjoy the cherry blossoms, have picnics, and play cards against monsters~\n\n\n\n\n\n\n\nSingle Ending Text Version (Text content of audio, can be used with background audio without narration)June 12, 2000\nKyoto, Entrance Garden\nAt the entrance of the shopping street, a mature and sexy woman stood holding a cute girl of six or seven years old, pausing there for a long time. For some reason, the woman hesitated to enter this street filled with restaurants, and it was unclear what she was pondering. After a long while, she finally mustered the courage to lead the girl into the street. As she walked, she looked around, searching for something. Her eyes were filled with tension and a hint of anticipation. Suddenly, the woman stopped in her tracks, staring blankly at a sign that read 'Ayumi Restaurant.' She gazed for a long time, tears silently sliding down her delicate face. The woman reached up to wipe away the tears and took the girl inside the restaurant. With a creak, the old wooden sliding door was pushed open. Behind the bar at the entrance stood a scruffy middle-aged man, wearing a somewhat greasy chef's outfit, skillfully chopping ingredients. He didn’t look up, only saying, 'Please take a seat. The menu is posted on the wall; just let me know what you'd like.' The woman gently sat the girl down in front of the bar and glanced around. Besides the simple menu, the wall was covered in sticky notes, each one stating: Delicious! The food here is truly delicious. The woman looked at the man behind the bar. He was a bit older, with wrinkles on his face, but he was still the Ichirou from her memories... With a slightly trembling voice, she quietly asked, 'Boss, do you have... takoyaki?'\nUpon hearing 'takoyaki,' the man suddenly raised his head but immediately turned away when he saw the woman. After pausing for a moment, he began to prepare the ingredients for takoyaki. However, as he chopped the cabbage, tears as big as beans fell onto the knife, the cabbage, and the cutting board. The man hastily wiped his face with his sleeve and quickly finished a plate of takoyaki. He kept his head down, not daring to look at the woman, and softly placed the takoyaki on the bar, saying, 'Give it a try.' The woman took one and fed one to the girl. The girl happily said to her, 'Mom, this is the best takoyaki Little Bai has ever eaten!'\nThe woman smiled indulgently, stroking the girl's head, saying, 'This is also the best takoyaki mom has ever eaten.' At this moment, the man finally gathered the courage to look up at the woman before him. Their eyes met, and he gently asked her, 'You’re here.' The woman smiled through her tears and softly replied, 'I’m here; did you wait long?'\nMarch 22, 2006\nDuck River\nAt two-thirty in the morning, with a 'ding-dong' sound, the electronic sensor door of a Sunny convenience store opened. A man wearing a trench coat and a checkered hat rushed into the convenience store like the wind. He hurried to the shelf, grabbed a red bean bun, and then picked up two cans of beer from the refrigerator.\nHe had just placed the bun and beer on the counter to pay when the cashier girl, who was shorter than others, unexpectedly threw the bun and beer into the trash can. She gave the man a reproachful glance and took out a pink bento from the drawer, saying, 'It's late at night, and you're eating cold food. What about your stomach?'\nThe boy scratched his head in embarrassment, took the bento, and opened it to find octopus sausage, thick omelet, and handmade rice balls. While eating, he mumbled to the girl, 'Peach, let me tell you, today I helped a woman find her long-lost child. The reunion between mother and child was incredibly touching! Plus, that woman seems quite wealthy; she gave me a lot of commission! Just a little bit more, Peach, and I can take you to America for treatment on your leg!'\nThe girl smiled at the boy, gently saying, 'Aze, slow down while eating. Talk after you finish; be careful not to choke.'\nAfter the boy quickly finished the rice ball, he went around the counter to put a jacket on the girl sitting in the wheelchair, saying, 'Peach, the cherry blossoms by the river have bloomed; let me push you out to take a look!'\nThe girl smiled and nodded. The boy locked the convenience store door and pushed the girl along the riverside path. The cherry blossom trees along the way were in full bloom, and the moonlight gently fell, enveloping the entire street in a soft sea of flowers. The two of them strolled along the path, admiring the blooming night cherry blossoms. A breeze blew, scattering the cherry blossoms from the trees. Petals landed on their heads, bodies, and legs.\nThe girl bent down and carefully picked a complete cherry blossom from her leg, gently placing it in her palm, and turned to the boy, smiling, saying, 'Aze, look! This way, I can also touch the cherry blossoms!'\nSeptember 2, 2009\nKyoto, Kyoto University, School Gate\nAt 8 a.m., a girl wearing a checkered dress with a black ponytail rushed into the school, quickly completing her enrollment procedures. Then she stood at the school gate, seemingly waiting for someone.\nShe stood there, waiting obsessively, from dawn until sunset. She waited until the bustling street gradually fell into silence, until the sky was filled with dark clouds, until the clouds brought light rain, until the rain soaked the girl completely. She kept waiting and waiting until she realized that the person she was waiting for truly would not appear.On the same day, at 2 p.m.\nIn a law firm in Kyoto, an old man with graying hair and a stooped back sat at a desk, carefully reading a property donation contract. The contract stipulated that his entire estate would be divided into two parts, one to be gifted to a girl named Momoko Suzumiya and the other to a first-year Kyoto University student named Nana Kinomoto. After signing his name, Ichirou Kiryu, at the end of the contract, he seemed to release a heavy burden and let out a long sigh. He then turned and walked out of the firm.\nHe looked up at the sky at the door, and it seemed like it was going to rain. After hesitating for a long time, he took a black umbrella from the entrance of the firm and headed towards Kyoto University.\nHe walked steadily and slowly. Eventually, he arrived at Kyoto University, at the school gate, across from a dark alley.\nLight rain began to fall from the sky. He slowly opened the black umbrella in his hand, completely hiding himself in the darkness. He looked at the girl at the school gate; she was dressed in a beautiful outfit, with a proud ponytail. She had truly been accepted into Kyoto University.\nDark clouds gathered above her, and the rain soaked her hair. The man wished he could rush over and use the umbrella to shield her from the clouds and rain. However, he lifted his foot several times, but ultimately stopped in place. He knew he couldn't go. The girl's life was just beginning! She would encounter more and better people in the future, and there would be someone truly good to her, someone who would shield her from the clouds. But that person shouldn’t be him.\nThe man watched as the heavy rain soaked the girl. He saw her turn around dejectedly and return to school. He casually threw the umbrella on the ground and let the rain beat down on his face and body, seemingly trying to cover up the tears that slipped from the corners of his eyes with the rain. Then he turned around, hunched over, and gradually walked into the darkness.\n\n\nMarch 4, 2010, Kyoto, Inari Shrine Mountain\nNews Report: Our station's exclusive report states that yesterday a passerby discovered a man's corpse in Inari Shrine Mountain. According to police investigation, the deceased was named Hidetaka Kojima, an honorary chairman of the Kyoto Whale Research and Protection Committee. The deceased had recently been preparing to run for the position of deputy director of the Kyoto Environmental Bureau. According to eyewitnesses, the deceased was last seen at Inari Shrine, seemingly praying. Due to the deceased's close ties with senior officials in the Kyoto Police Department, the police mobilized most of their forces to capture the murderer.\n\nMarch 5, 2010, Kyoto Police Department\nNews Live: This station is live broadcasting. The recent murder case of the famous Hidetaka Kojima has attracted considerable attention. We have received exclusive news that someone has come to the police department today to confess! The suspect is a man in his sixties named Ichirou Kiryu, a former deputy leader of the Yamaguchi-gumi. After confessing, he completely explained his motive and method for the murder. It is said that due to personal grudges, he lured the deceased to the mountains, fought with him, then picked up a stone and knocked him unconscious, suffocating him with a handkerchief. In the end, he also stabbed him multiple times with a dagger he carried with him in a fit of rage. His testimony matched the circumstances of the deceased's death perfectly. The police quickly arrested him. Now let's bring you an exclusive interview.\nReporter: Mr. Kiryu, can you tell us why you killed the deceased?\nIchirou Kiryu: For some personal grudges.\nReporter: It is reported that your previous gang activities and this murder case will be punished cumulatively, and you will be sentenced to life imprisonment. Do you have anything to say to others? You can convey your message through the camera.\nIchirou Kiryu: Don’t be sad; this is my responsibility to bear. The mistakes I made should be ended by me. You all must live well.\n\n\n\nFinal Outcome\nIn 2013, during graduation season, a graduate from the Kyoto University Fine Arts Department named Nana Kinomoto was quite different from her classmates. While most of her classmates pursued careers in the booming animation market, she chose to engage in a niche industry, a sunset industry: tabletop games.Not long after graduation, she became a tabletop game designer and released her first independent game, Monster Cards. (She takes out the box of Monster Cards to show everyone.) This game quickly became a sensation throughout Kyoto due to its simple yet fun rules and vivid artistic design. Couples running a ryotei (traditional Japanese inn) were playing it, young couples from detective agencies were playing it, and even the shrine maidens at Inari Shrine were getting in on the fun.\nRecently, Inari Shrine launched a new small souvenir gift, Paw Cookies. These are cookies shaped like the little paws of the shrine's signature fox. Everyone who comes to make a wish can receive a small packet of these cookies. They're crunchy, sweet, and eating them brings a warmth to the heart, like the gentle sunlight pouring down on you.\nLater, you all went to Inari Shrine to make wishes. Every time you clasped your hands together, you could always feel a tense gaze watching you from behind! It seemed to hear the wishes in your hearts. Yet your wishes were simply hopes for family health, a desire not to lose your way, and aspirations for a happier life. At such moments, that tense gaze would relax. But when you turned around, all you could see was a flash of red disappearing from your sight. Occasionally, a cute little shrine maiden would stop you at Inari Shrine and ask: “Excuse me, have you found the Fox Hotel? Have your wishes come true?”\nThank you all, today's Fox Hotel event is now concluded. Thank you.\n\nClosing Statement:\nIn the end, we still don’t know if Ayu’s little Bai can really heal, whether Nobita’s parents have improved, if Momoko's mother has woken up, if Hei Ze has cracked the big case and upheld justice, if Ichirou Kiryu has walked out of prison, or if Nana has made good friends, or if Xiao Nuan has reunited with her family. We don’t know these things, because that’s reality. Reality can never have a perfect ending like a story. But I believe that all of you here have had your wishes realized at the Fox Hotel, and they will surely come true in reality, because fulfilling wishes doesn’t rely on gods but on the most precious strength in your hearts. You all can bravely face the reality you once wanted to escape from and courageously take steps forward; that is the greatest victory. Life is not always smooth sailing; there will always be difficulties, but don’t be afraid. Keep moving forward.\nThe Fox Hotel is always behind you, silently watching over you.\nThe Fox Hotel is a place you can come to whenever you feel exhausted, overwhelmed by life, and need a break, a place to occasionally escape to. Just like every script-based entertainment venue, here you can experience different lives, whether in laughter, warmth, or tears. But in life, there are still reasons and motivations that compel us to move forward. You all must go back and live bravely and happily. I hope the Fox Hotel can bring warmth to everyone. Thank you.\n\nEaster Eggs:\nThe Old Spider and the passage to reality, along with the eternal coexistence, are inspired by Spirited Away.\nThe song sending off Xiao Nuan comes from Anohana: The Flower We Saw That Day, and we happen to have a reverse situation with it.\nThe song Path of Wind is from My Neighbor Totoro.\nThe BGM at the opening and during the first card game comes from Natsume's Book of Friends, telling a warm story between a boy and yokai.\nThe music during the card game is from Chihayafuru, which is also the inspiration for Monster Cards.\nThe first song of the second act comes from Midnight Diner, and the second song is from 5 Centimeters Per Second.\nThe gameplay of Monster Cards references Catch the Turtle and German Cockroach.\nThere are more Easter eggs for everyone to discover!"
    ,
    "Article 22 School Rules": "The entire incident revolves around the transfer student 【Fuqing Huang】, who is a bisexual individual possessing both male and female characteristics physiologically. Because of this, 【Fuqing Huang】 had no friends during childhood, and due to the ambiguity of gender, did not know whether to consider themselves male or female. This led to the development of both male and female personalities: the male persona is 【Fuqing Huang】, and the female persona is 'Wenling Jiang'. To avoid discrimination from those around, 【Fuqing Huang】's parents frequently arranged for them to transfer schools, so apart from their parents, no one knew the truth about 【Fuqing Huang】 being a bisexual person.\nLater, 【Fuqing Huang】 attended 'Truth High School' and entered Class 3 of the second year, where they became friends with 【Xuanxuan Li】, 【Yuqing Xie】, and 【Lenxing Ye】. The homeroom teacher for Class 3 of the second year, Teacher Li, is the father of 【Xuanxuan Li】. Although he appears to be upright and serious, he is actually a psychologically twisted pervert. He collects students' privacy to threaten and control them. His targets include not only girls but also attractive boys, among whom 【Mu Bai】 is also a victim.\nWhen 【Fuqing Huang】 arrived in Class 3 of the second year, they attracted Teacher Li's attention because, based solely on appearance, 【Fuqing Huang】 is an absolute beauty. Teacher Li then began to stalk and collect information on 【Fuqing Huang】 until he secretly peeped at 【Fuqing Huang】's secret of being bisexual in a male bathroom stall. He then started to threaten 【Fuqing Huang】 to force compliance and intentionally leaked this information to 【Yuqing Xie】 to spread it, leading everyone in the class to harbor malice and discrimination against 【Fuqing Huang】.\nTeacher Li's abnormal behavior caught the attention of 【Yao Xuan】, a girl with a severe Oedipus complex, who once deliberately caused an accident that killed someone who was almost to become her stepmother. She does not allow anyone to share the love of her father, Teacher Li. When Teacher Li and 【Fuqing Huang】 met on the rooftop, she overheard everything. However, she did not blame her father but rather targeted 【Fuqing Huang】. Taking advantage of Teacher Li's departure from the rooftop, she pushed 【Fuqing Huang】 off the edge. In the moment of being pushed, 【Fuqing Huang】 grabbed 【Yao Xuan】's left hand, pulling down her four-leaf clover ring, and then 【Fuqing Huang】 fell to their death from the rooftop.\nThrough 'Wenwen Jiang's notes, it can be seen that during the meeting with Teacher Li on the rooftop, 【Fuqing Huang】 was actually being led by the persona 'Wenling Jiang', so the one experiencing death was also 'Wenling'. Her hatred transformed into a curse upon her death, enveloping the entire Class 3 of the second year, and turning December 2nd into a cursed space. At that time, 【Fuqing Huang】's male persona did not dominate the body and thus did not bear any resentment. The male persona was forcibly expelled by 'Wenling Jiang', becoming an existence akin to a thought form. Although 【Fuqing Huang】 had died, due to 'Wenling Jiang's curse, they maintained the form from before death, and their memories of the 'Wenling Jiang' persona were cursed to be forgotten, only vaguely remembering 'Wenling' as a childhood friend. 【Fuqing Huang】's mother did not realize that 【Fuqing Huang】 had died; she was merely happy that the 'Wenling Jiang' persona within them had disappeared, so she did not inform 【Fuqing Huang】 of their past dissociative identity.\nMeanwhile, the curse manifested by 'Wenling Jiang' began to kill the students of Class 3 of the second year, pulling them into the cursed space of December 2nd to kill them. Each student must die three times in the cursed space to truly be released. Before that, they endure unimaginable fear, and when they are killed, their names and memories disappear from everyone's recollections. As for 【Fuqing Huang】, as the embodiment of the curse, they simultaneously vanished from the memories of all classmates and teachers at the moment of death. Therefore, when 【Fuqing Huang】 transferred to Truth High School, no one remembered they had once been their classmate.\n【Fuqing Huang】 entered Truth High School because of the curse. 'Wenling' sought to kill the students of Class 3 while also hoping for liberation. The method of liberation was written in their notes, using the name of a spirit medium to kill oneself with their own curse. The strongest evil spirit in Truth High School was 'Wenling Jiang' herself. Thus, the spirit medium summoned can only be 'Wenling'. To break the curse of Truth High School, one must apply a curse to the embodiment of the curse itself, calling for 【Fuqing Huang】. This was because 'Wenling' had a glimmer of hope for redemption in her heart.\nWhen 【Fuqing Huang】 entered Class 3 of the second year, they received no special treatment. They were still a target for the curse's eradication. Everyone who was pulled into the cursed space of December 2nd would experience 'three cycles,' meaning they would have three lives, and only after dying three times could they truly die. This is also why everyone encountered people who looked exactly like themselves.\nUpon entering the cursed space, the curse from 'Wenling' manifested all the inner demons of the individuals as malevolent spirits to kill in the cursed space. Students who had previously died in Class 3 of the second year and duty teachers, as well as security guards, had all turned into ghosts, but they would not harm the individuals; instead, they would help them. The entity manifesting the curse was a gigantic white malevolent spirit lurking in the water tank on the rooftop. The white-robed evil spirit was the most fundamental malevolent spirit of the cursed space, residing in the rooftop water tank. Because of its existence, all inner demons manifested as malevolent spirits would not continue to chase the individuals after they escaped to the rooftop, as the rooftop was the most terrifying place in Truth High School. Once everyone gathered on the rooftop, the white-robed malevolent spirit's essence would appear, marking the time when the curse was at its strongest. At this moment, if they curse 'Wenling Jiang' by calling the spirit medium, the curse would break. If they choose to flee the rooftop, it would be deemed a failure to break the curse, and afterward, 'Wenling Jiang' would transform into an truly unresolvable and terrifying malevolent spirit, brutally killing everyone. When 'Article 22 School Rules - Audio 2' began to spread throughout the school, it signified that the malevolent spirit was about to begin a merciless slaughter.\nRegarding the rooftop, it was the place where 'Wenling' was killed, so the white-robed malevolent spirit transformed from her curse dwells in the rooftop water tank. Due to a trace of her redemption mentality existing within 'Wenling', the groups usually do not encounter fatal situations before ascending to the rooftop. All inner demons manifested as malevolent spirits are free to act without a fixed intent to kill. However, once everyone gathers on the rooftop, the white-robed malevolent spirit awakens, and all inner demons are controlled by her. Thus, fleeing from the rooftop is equivalent to a failure to break the curse, allowing the white-robed malevolent spirit to command the inner demons to launch indiscriminate attacks on everyone. This is why when they escape the rooftop, they are instead annihilated by the malevolent spirits.\nThe difficulty of this incident lies in how to curse 'Wenling Jiang'. To summon a spirit medium, one must write the name of the cursed person. However, 'Wenling Jiang' is merely the name of 【Fuqing Huang】's female persona, which is essentially a meaningless alias. If the group ultimately writes down 'Wenling Jiang's name, the curse will fail; a nonexistent person cannot be cursed, and everyone will be killed by the malevolent spirit due to the failure. Regardless of which persona dominates the body on December 2nd, the person who dies is undoubtedly 【Fuqing Huang】 themselves. Therefore, to break the curse, one must write 【Fuqing Huang】's name."

}
  
